{"masked_text": "And in the key battlegrounds, including right here in [MASK0], all still very much in play.", "masks": ["Pennsylvania"]}
{"masked_text": "In your home state of [MASK0], you surprised many with regard to your six-week abortion ban because you initially had said that it was too short and you said, \"I'm going to be voting that we need more than six weeks.\"", "masks": ["Florida"]}
{"masked_text": "They even have, and you can look at the governor of [MASK0], the previous governor of [MASK0], not the current governor, who's doing an excellent job, but the governor before.", "masks": ["West_virginia"]}
{"masked_text": "In fact, when they got a very negative decision on IVF from the [MASK0] courts, I saw the people of [MASK0] and the legislature two days later voted it in.", "masks": ["Alabama"]}
{"masked_text": "The governor of [MASK0] said we put the baby aside and then we determine what we want to do with the baby.", "masks": ["Virginia"]}
{"masked_text": "DAVID MUIR: I just want to clarify here, you bring up Springfield, [MASK0].", "masks": ["Ohio"]}
{"masked_text": "Every one of those cases was involved with the DOJ, from Atlanta and Fani Willis -- to the attorney general of [MASK0] and the D.A. In [MASK0].", "masks": ["New_york"]}
{"masked_text": "But in particular, let's talk about fracking because we're here in [MASK0].", "masks": ["Pennsylvania"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: In [MASK0], she went out -- wait a minute.", "masks": ["Minnesota"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: She went out -- she went out in [MASK0] and wanted to let criminals that killed people, that burned down Minneapolis, she went out and raised money to get them out of jail.", "masks": ["Minnesota"]}
{"masked_text": "She wants to confiscate your guns and she will never allow fracking in [MASK0].", "masks": ["Pennsylvania"]}
{"masked_text": "If she won the election, fracking in [MASK0] will end on day one.", "masks": ["Pennsylvania"]}
{"masked_text": "I went to Nancy Pelosi and the mayor of [MASK0], D.C. And the mayor put it back in writing, as you know.", "masks": ["Washington"]}
{"masked_text": "It would have never happened if Nancy Pelosi and the mayor of [MASK0] did their jobs.", "masks": ["Washington"]}
{"masked_text": "I would say we would both leave this debate right now, I'd like to see her go down to [MASK0], D.C. during this debate 'cause we're wasting a lot of time.", "masks": ["Washington"]}
{"masked_text": "Go down to [MASK0], D.C. And let her sign a bill to close up the border.", "masks": ["Washington"]}
{"masked_text": "I'll show you [MASK0] and I'll show you [MASK1] and I'll show you [MASK2] and I'll show you -- we have so many facts and statistics.", "masks": ["Georgia", "Wisconsin", "Pennsylvania"]}
{"masked_text": "And why don't you tell the 800,000 Polish Americans right here in [MASK0] how quickly you would give up for the sake of favor and what you think is a friendship with what is known to be a dictator who would eat you for lunch.", "masks": ["Pennsylvania"]}
{"masked_text": "Let's remember, this is the same individual who took out a full-page ad in The [MASK0] Times calling for the execution of five young Black and Latino boys who were innocent, the Central Park Five.", "masks": ["New_york"]}
{"masked_text": "She has a plan to not allow fracking in [MASK0] or anywhere else.", "masks": ["Pennsylvania"]}
{"masked_text": "Because they will kill the United Auto Workers and any auto worker, whether it's in Detroit or [MASK0] or any other place.", "masks": ["South_carolina"]}
