{"masked_text": "VICE PRESIDENT KAMALA HARRIS: So, I was raised as a middle-class kid. And I am actually the only person on this stage who has a plan that is about lifting up the middle class and working people of America. I believe in the ambition, the aspirations, the dreams of the American people. And that is why I imagine and have actually a plan to build what I call an opportunity economy. Because here's the thing. We know that we have a shortage of homes and housing, and the cost of housing is too expensive for far too many people. We know that [MASK0] families need support to raise their children. And I intend on extending a tax cut for those families of $6,000, which is the largest child tax credit that we have given in a long time. So that those [MASK0] families can afford to buy a crib, buy a car seat, buy clothes for their children. My passion, one of them, is small businesses. I was actually -- my mother raised my sister and me but there was a woman who helped raise us. We call her our second mother. She was a small business owner. I love our small businesses. My plan is to give a $50,000 tax deduction to start-up small businesses, knowing they are part of the backbone of America's economy. My opponent, on the other hand, his plan is to do what he has done before, which is to provide a tax cut for billionaires and big corporations, which will result in $5 trillion to America's deficit. My opponent has a plan that I call the Trump sales tax, which would be a 20% tax on everyday goods that you rely on to get through the month. Economists have said that Trump's sales tax would actually result for middle-class families in about $4,000 more a year because of his policies and his ideas about what should be the backs of middle-class people paying for tax cuts for billionaires.", "masks": ["Young"]}
{"masked_text": "LINSEY DAVIS: But if I could just get a yes or no. Because your running mate [MASK0] has said that you would veto if it did come to your desk.", "masks": ["Vance"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Well, I didn't discuss it with JD In all fairness. JD -- And I don't mind if he has a certain view but I think he was speaking for me but I really didn't. Look, we don't have to discuss it because she'd never be able to get it just like she couldn't get student loans. They couldn't get -- they didn't even come close to getting student loans. They didn't even come close to getting student loans. They taunted [MASK0] people and a lot of other people that had loans. They can never get this approved. So it doesn't matter what she says about going to congress. Wonderful. Let's go to congress. Do it. But the fact is that for years they wanted to get it out of congress and out of the federal government and we did something that everybody said couldn't be done. And now you have a vote of the people on abortion.", "masks": ["Young"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Talk about extreme. Um, you know, this is I think one of the reasons why in this election I actually have the endorsement of 200 Republicans who have formally worked with President Bush, [MASK0], and John McCain including the endorsement of former Vice President Dick Cheney and Congressmember Liz Cheney. And if you want to really know the inside track on who the former president is, if he didn't make it clear already, just ask people who have worked with him. His former chief of staff, a four-star general, has said he has contempt for the constitution of the United States. His former national security adviser has said he is dangerous and unfit. His former secretary of defense has said the nation, the republic would never survive another Trump term. And when we listen to this kind of rhetoric, when the issues that affect the American people are not being addressed, I think the choice is clear in this election.", "masks": ["Romney"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well let's talk about extreme. And understand the context in which this election in 2024 is taking place. The United States Supreme Court recently ruled that the former president would essentially be immune from any misconduct if he were to enter the white house again. Understand, this is someone who has openly said he would terminate, I'm quoting, terminate the constitution of the United States. That he would weaponize the Department of Justice against his political enemies. Someone who has openly expressed disdain for members of our military. Understand what it would mean if Donald Trump were back in the white house with no guardrails. Because certainly, we know now the court won't stop him. We know [MASK0] is not going to stop him. It's up to the American people to stop him.", "masks": ["Vance"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, let's understand how we got here. On Oct. 7, Hamas, a terrorist organization, slaughtered 1,200 Israelis. Many of them [MASK0] people who were simply attending a concert. Women were horribly raped. And so absolutely, I said then, I say now, Israel has a right to defend itself. We would. And how it does so matters. Because it is also true far too many innocent Palestinians have been killed. Children, mothers. What we know is that this war must end. It must when, end immediately, and the way it will end is we need a cease-fire deal and we need the hostages out. And so we will continue to work around the clock on that. Work around the clock also understanding that we must chart a course for a two-state solution. And in that solution, there must be security for the Israeli people and Israel and in equal measure for the Palestinians. But the one thing I will assure you always, I will always give Israel the ability to defend itself, in particular as it relates to Iran and any threat that Iran and its proxies pose to Israel. But we must have a two-state solution where we can rebuild Gaza, where the Palestinians have security, self-determination and the dignity they so rightly deserve.", "masks": ["Young"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: I think it's – I mean honestly, I think it's a tragedy that we have someone who wants to be president who has consistently over the course of his career attempted to use race to divide the American people. You know, I do believe that the vast majority of us know that we have so much more in common than what separates us. And we don't want this kind of approach that is just constantly trying to divide us, and especially by race. And let's remember how Donald Trump started. He was a, a, a—land, he owned land, he owned buildings, and he was investigated because he refused to rent property to Black families. Let's remember, this is the same individual who took out a full-page ad in The New York Times calling for the execution of five [MASK0] Black and Latino boys who were innocent, the Central Park Five. Took out a full-page ad calling for their execution. This is the same individual who spread birther lies about the first Black President of the United States. And I think the American people want better than that. Want better than this. Want someone who understands as I do, I travel our country, we see in each other a friend. We see in each other a neighbor. We don't want a leader who is constantly trying to have Americans point their fingers at each other. I meet with people all the time who tell me \"Can we please just have discourse about how we're going to invest in the aspirations and the ambitions and the dreams of the American people?\" Knowing that regardless of people's color or the language their grandmother speaks we all have the same dreams and aspirations and want a president who invests in those, not in hate and division.", "masks": ["Young"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: I want to respond to that, though. I want to just respond briefly. Clearly, I am not Joe Biden, and I am certainly not Donald Trump. And what I do offer is a new generation of leadership for our country. One who believes in what is possible, one who brings a sense of optimism about what we can do instead of always disparaging the American people. I believe in what we can do to strengthen our small businesses, which is why I have a plan. Let's talk about our plans. And, and let's compare the plans. I have a plan to give startup businesses $50,000 tax deduction, to pursue their ambitions, their innovation, their ideas, their hard work. I have a plan. $6,000 for [MASK0] families for the first year of your child's life. To help you in that most critical stage of your child's development. I have a plan that is about allowing people to be able to pursue what has been fleeting in terms of the American dream by offering help with down payment of $25,000, down payment assistance for first-time home buyers. That's the kind of conversation I believe, David, that people really want tonight as opposed to a conversation that is constantly about belittling and name-calling. Let's turn the page and move forward.", "masks": ["Young"]}
{"masked_text": "LINSEY DAVIS: Vice President Harris, in 2017 you supported [MASK0]' proposal to do away with private insurance and create a government-run health care system. Two years later you proposed a plan that included a private insurance option. What is your plan today?", "masks": ["Sanders"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, the former president had said that climate change is a hoax. And what we know is that it is very real. You ask anyone who lives in a state who has experienced these extreme weather occurrences who now is either being denied home insurance or is being jacked up. You ask anybody who has been the victim of what that means in terms of losing their home, having nowhere to go. We know that we can actually deal with this issue. The [MASK0] people of America care deeply about this issue. And I am proud that as vice president over the last four years, we have invested a trillion dollars in a clean energy economy while we have also increased domestic gas production to historic levels. We have created over 800,000 new manufacturing jobs while I have been vice president. We have invested in clean energy to the point that we are opening up factories around the world. Donald Trump said he was going to create manufacturing jobs. He lost manufacturing jobs. And I'm also proud to have the endorsement of the United Auto Workers and Shawn Fain, who also know that part of building a clean energy economy includes investing in American-made products, American automobiles. It includes growing what we can do around American manufacturing and opening up auto plants, not closing them like what happened under Donald Trump.", "masks": ["Young"]}
