{"masked_text": "FORMER PRESIDENT DONALD TRUMP: First of all, I have no sales tax. That's an incorrect statement. She knows that. We're doing tariffs on other countries. Other countries are going to finally, after 75 years, pay us back for all that we've done for the world. And the tariff will be substantial in some cases. I took in billions and billions of dollars, as you know, from [MASK0]. In fact, they never took the tariff off because it was so much money, they can't. It would totally destroy everything that they've set out to do. They've taken in billions of dollars from [MASK0] and other places. They've left the tariffs on. When I had it, I had tariffs and yet I had no inflation. Look, we've had a terrible economy because inflation has -- which is really known as a country buster. It breaks up countries. We have inflation like very few people have ever seen before. Probably the worst in our nation's history. We were at 21%. But that's being generous because many things are 50, 60, 70, and 80% higher than they were just a few years ago. This has been a disaster for people, for the middle class, but for every class. On top of that, we have millions of people pouring into our country from prisons and jails, from mental institutions and insane asylums. And they're coming in and they're taking jobs that are occupied right now by African Americans and Hispanics and also unions. Unions are going to be affected very soon. And you see what's happening. You see what's happening with towns throughout the United States. You look at Springfield, Ohio. You look at Aurora in Colorado. They are taking over the towns. They're taking over buildings. They're going in violently. These are the people that she and Biden let into our country. And they're destroying our country. They're dangerous. They're at the highest level of criminality. And we have to get them out. We have to get them out fast. I created one of the greatest economies in the history of our country. I'll do it again and even better.", "masks": ["China"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: They aren't gonna have higher prices what's gonna have and who's gonna have higher prices is [MASK0] and all of the countries that have been ripping us off for years. I charge, I was the only president ever [MASK0] was paying us hundreds of billions of dollars and so were other countries and you know if she doesn't like 'em they should have gone out and they should have immediately cut the tariffs but those tariffs are there three and a half years now under their administration. We are gonna take in billions of dollars, hundreds of billions of dollars. I had no inflation, virtually no inflation, they had the highest inflation, perhaps in the history of our country because I've never seen a worse period of time. People can't go out and buy cereal bacon or eggs or anything else. These the people of our country are absolutely dying with what they've done. They've destroyed the economy and all you have to do it look at a poll. The polls say 80 and 85 and even 90% that the Trump economy was great that their economy was terrible.", "masks": ["China"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, let's be clear that the Trump administration resulted in a trade deficit, one of the highest we've ever seen in the history of America. He invited trade wars, you wanna talk about his deal with [MASK0] what he ended up doing is under Donald Trump's presidency he ended up selling American chips to [MASK0] to help them improve and modernize their military basically sold us out when a policy about [MASK0] should be in making sure the [MASK1] wins the competition for the 21st century. Which means focusing on the details of what that requires, focusing on relationships with our allies, focusing on investing in American based technology so that we win the race on A.I. and quantum computing, focusing on what we need to do to support America's workforce, so that we don't end up having the on the short end of the stick in terms of workers' rights. But what Donald Trump did let's talk about this with COVID, is he actually thanked President XI for what he did during COVID. Look at his tweet. \"Thank you, President XI,\" exclamation point. When we know that XI was responsible for lacking and not giving us transparency about the origins of COVID.", "masks": ["China", "United_states_of_america"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: First let me respond as to the rallies. She said people start leaving. People don't go to her rallies. There's no reason to go. And the people that do go, she's busing them in and paying them to be there. And then showing them in a different light. So, she can't talk about that. People don't leave my rallies. We have the biggest rallies, the most incredible rallies in the history of politics. That's because people want to take their country back. Our country is being lost. We're a failing nation. And it happened three and a half years ago. And what, what's going on here, you're going to end up in World War 3, just to go into another subject. What they have done to our country by allowing these millions and millions of people to come into our country. And look at what's happening to the towns all over the United States. And a lot of towns don't want to talk -- not going to be Aurora or Springfield. A lot of towns don't want to talk about it because they're so embarrassed by it. In Springfield, they're eating the dogs. The people that came in. They're eating the cats. They're eating -- they're eating the pets of the people that live there. And this is what's happening in our country. And it's a shame. As far as rallies are concerned, as far -- the reason they go is they like what I say. They want to bring our country back. They want to make America great again. It's a very simple phrase. Make America great again. She's destroying this country. And if she becomes president, this country doesn't have a chance of success. Not only success. We'll end up being [MASK0] on steroids.", "masks": ["Venezuela"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Yeah. Thank you. Because when I hear that -- see, I'm a different kind of a person. I fired most of those people. Not so graciously. They did bad things or a bad job. I fired them. They never fired one person. They didn't fire anybody having to do with [MASK0] and the Taliban and the 13 people whose, whose, were just killed viciously and violently killed and I got to know the parents and the family. They should have fired all those generals, all those top people because that was one of the most incompetently handled situations anybody has ever seen. So when somebody does a bad job I fire them. And you take a guy like Esper. He was no good, I fired him. So he writes a book. Another one writes a book. Because with me they can write books. With nobody else can they. But they have done such a poor job. And they never fire anybody. Look at the economy. Look at the inflation. They didn't fire any of their economists. They have the same people. That's a good way not to have books written about you. But just to finish, I got more votes than any Republican in history by far. In fact, I got more votes than any president, sitting president in history by far.", "masks": ["Afghanistan"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Yeah. It is much higher because of them. They allowed criminals. Many, many, millions of criminals. They allowed terrorists. They allowed common street criminals. They allowed people to come in, drug dealers, to come into our country, and they're now in the United States. And told by their countries like [MASK0] don't ever come back or we're going to kill you. Do you know that crime in [MASK0] and crime in countries all over the world is way down? You know why? Because they've taken their criminals off the street and they've given them to her to put into our country. And this will be one of the greatest mistakes in history for them to allow -- and I think they probably did it because they think they're going to get votes. But it's not worth it. Because they're destroying the fabric of our country by what they've done. There's never been anything done like this at all. They've destroyed the fabric of our country. Millions of people let in. And all over the world crime is down. All over the world except here. Crime here is up and through the roof. Despite their fraudulent statements that they made. Crime in this country is through the roof. And we have a new form of crime. It's called migrant crime. And it's happening at levels that nobody thought possible.", "masks": ["Venezuela"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: This is the one that weaponized. Not me. She weaponized. I probably took a bullet to the head because of the things that they say about me. They talk about democracy. I'm a threat to democracy. They're the threat to democracy – With the fake [MASK0] [MASK0] [MASK0] investigation that went nowhere.", "masks": ["Russia"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: They said we didn't have standing. That's the other thing. They said we didn't have standing. A technicality. Can you imagine a system where a person in an election doesn't have standing, the President of the United States doesn't have standing? That's how we lost. If you look at the facts, and I'd love to have you -- you'll do a special on it. I'll show you [MASK0] and I'll show you Wisconsin and I'll show you Pennsylvania and I'll show you -- we have so many facts and statistics. But you know what? That doesn't matter. Because we have to solve the problem that we have right now. That's old news. And the problem that we have right now is we have a nation in decline and they have put it into decline. We have a nation that is dying, David.", "masks": ["Georgia"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Let me just tell you about world leaders. Viktor Orban, one of the most respected men -- they call him a strong man. He's a tough person. Smart. Prime Minister of [MASK0]. They said why is the whole world blowing up? Three years ago it wasn't. Why is it blowing up? He said because you need Trump back as president. They were afraid of him. [MASK1] was afraid. And I don't like to use the word afraid but I'm just quoting him. [MASK1] was afraid of him. [MASK2] was afraid of him. Look at what's going on with [MASK2], by the way. He said [MASK3] was afraid of him. I ended the Nord Stream 2 pipeline and Biden put it back on day one but he ended the XL pipeline. The XL pipeline in our country. He ended that. But he let the Russians build a pipeline going all over Europe and heading into [MASK4]. The biggest pipeline in the world. Look, Viktor Orban said it. He said the most respected, most feared person is Donald Trump. We had no problems when Trump was president. But when this weak pathetic man that you saw at a debate just a few months ago that if he weren't in that debate he'd be running instead of her, she got no votes, he got 14 million votes, what you did, you talk about a threat to democracy. He got 14 million votes and they threw him out of office. And you know what? I'll give you a little secret. He hates her. He can't stand her.", "masks": ["Hungary", "China", "North_korea", "Russia", "Germany"]}
{"masked_text": "LINSEY DAVIS: Turning now to the [MASK0]-Hamas war and the hostages who are still being held, Americans among them. Vice President Harris, in December you said, \"[MASK0] has a right to defend itself\" but you added, \"It matters how.\" Saying international humanitarian law must be respected, [MASK0] must do more to protect innocent civilians. You said that nine months ago. Now an estimated 40,000 Palestinians are dead. Nearly 100 hostages remain. Just last week Prime Minister Benjamin Netanyahu said there's not a deal in the making. President Biden has not been able to break through the stalemate. How would you do it?", "masks": ["Israel"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, let's understand how we got here. On Oct. 7, Hamas, a terrorist organization, slaughtered 1,200 Israelis. Many of them young people who were simply attending a concert. Women were horribly raped. And so absolutely, I said then, I say now, [MASK0] has a right to defend itself. We would. And how it does so matters. Because it is also true far too many innocent Palestinians have been killed. Children, mothers. What we know is that this war must end. It must when, end immediately, and the way it will end is we need a cease-fire deal and we need the hostages out. And so we will continue to work around the clock on that. Work around the clock also understanding that we must chart a course for a two-state solution. And in that solution, there must be security for the Israeli people and [MASK0] and in equal measure for the Palestinians. But the one thing I will assure you always, I will always give [MASK0] the ability to defend itself, in particular as it relates to [MASK1] and any threat that [MASK1] and its proxies pose to [MASK0]. But we must have a two-state solution where we can rebuild Gaza, where the Palestinians have security, self-determination and the dignity they so rightly deserve.", "masks": ["Israel", "Iran"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: If I were president it would have never started. If I were president [MASK0] would have never, ever -- I know Putin very well. He would have never -- and there was no threat of it either, by the way, for four years. Have gone into [MASK1] and killed millions of people when you add it up. Far worse than people understand what's going on over there. But when she mentions about [MASK2] all of a sudden -- she hates [MASK2]. She wouldn't even meet with Netanyahu when he went to Congress to make a very important speech. She refused to be there because she was at a sorority party of hers. She wanted to go to the sorority party. She hates [MASK2]. If she's president, I believe that [MASK2] will not exist within two years from now. And I've been pretty good at predictions. And I hope I'm wrong about that one. She hates [MASK2]. At the same time in her own way she hates the Arab population because the whole place is going to get blown up, Arabs, Jewish people, [MASK2]. [MASK2] will be gone. It would have never happened. [MASK3] was broke under Donald Trump. Now [MASK3] has $300 billion because they took off all the sanctions that I had. [MASK3] had no money for Hamas or Hezbollah or any of the 28 different spheres of terror. And they are spheres of terror. Horrible terror. They had no money. It was a big story, and you know it. You covered it. Very well, actually. They had no money for terror. They were broke. Now they're a rich nation. And now what they're doing is spreading that money around. Look at what's happening with the Houthis and [MASK4]. Look at what's going on in the Middle East. This would have never happened. I will get that settled and fast. And I'll get the war with [MASK1] and [MASK0] ended. If I'm President-Elect, I'll get it done before even becoming president.", "masks": ["Russia", "Ukraine", "Israel", "Iran", "Yemen"]}
{"masked_text": "LINSEY DAVIS: Vice President Harris, he says you hate [MASK0].", "masks": ["Israel"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: That's absolutely not true. I have my entire career and life supported [MASK0] and the Israeli people. He knows that. He's trying to again divide and distract from the reality, which is it is very well known that Donald Trump is weak and wrong on national security and foreign policy. It is well known that he admires dictators, wants to be a dictator on day one according to himself. It is well known that he said of Putin that he can do whatever the hell he wants and go into [MASK1]. It is well known when that he said when [MASK2] went into [MASK1] it was brilliant. It is well known he exchanged love letters with Kim Jong un. And it is absolutely well known that these dictators and autocrats are rooting for you to be president again because they're so clear, they can manipulate you with flattery and favors. And that is why so many military leaders who you have worked with have told me you are a disgrace. That is why we understand that we have to have a president who is not consistently weak and wrong on national security including the importance of upholding and respecting in highest regard our military.", "masks": ["Israel", "Ukraine", "Russia"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: They're the ones -- and she's the one that caused it, that's weak on national security by allowing every nation last month for the year, 168 different countries sending people into our country. Their crime rates are way down. Putin endorsed her last week. Said I hope she wins. And I think he meant it. Because what he's gotten away with is absolutely incredible. It wouldn't have happened with me. The leaders of other countries think that they're weak and incompetent. And they are. They're grossly incompetent. And I just ask one question. Why does Biden go in and kill the Keystone pipeline and approve the single biggest deal that [MASK0]'s ever made, Nordstream 2, the biggest pipeline anywhere in the world going to [MASK1] and all over Europe? Because they're weak and they're ineffective. And Biden, by the way --", "masks": ["Russia", "Germany"]}
{"masked_text": "DAVID MUIR: And I want to turn to the war in [MASK0]. We're now 2 1/2 years into this conflict. Mr. President, it has been the position of the Biden administration that we must defend [MASK0] from [MASK1], from Vladimir Putin, to defend their sovereignty, their democracy, that it's in America's best interest to do so, arguing that if Putin wins he may be emboldened to move even further into other countries. You have said you would solve this war in 24 hours. You said so just before the break tonight. How exactly would you do that? And I want to ask you a very simple question tonight. Do you want [MASK0] to win this war?", "masks": ["Ukraine", "Russia"]}
{"masked_text": "DAVID MUIR: Your time is up. Just to clarify the question, do you believe it's in the U.S. best interests for [MASK0] to win this war? Yes or no?", "masks": ["Ukraine"]}
{"masked_text": "DAVID MUIR: I want to take this to Vice President Harris. I want to get your thoughts on support for [MASK0] in this moment. But also as commander in chief if elected how would you deal with Vladimir Putin and would it be any different from what we're seeing from President Biden?", "masks": ["Ukraine"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, first of all, it's important to remind the former president you're not running against Joe Biden, you're running against me. I believe the reason that Donald Trump says that this war would be over within 24 hours is because he would just give it up. And that's not who we are as Americans. Let's understand what happened here. I actually met with Zelenskyy a few days before [MASK0] invaded, tried through force to change territorial boundaries to defy one of the most important international rules and norms, which is the importance of sovereignty and territorial integrity. And I met with President Zelenskyy. I shared with him American intelligence about how he could defend himself. Days later I went to NATO's eastern flank, to [MASK1] and [MASK2]. And through the work that I and others did we brought 50 countries together to support [MASK3] in its righteous defense. And because of our support, because of the air defense, the ammunition, the artillery, the javelins, the Abrams tanks that we have provided, [MASK3] stands as an independent and free country. If Donald Trump were president, Putin would be sitting in Kyiv right now. And understand what that would mean. Because Putin's agenda is not just about [MASK3]. Understand why the European allies and our NATO allies are so thankful that you are no longer president and that we understand the importance of the greatest military alliance the world has ever known, which is NATO. And what we have done to preserve the ability of Zelenskyy and the Ukrainians to fight for their Independence. Otherwise, Putin would be sitting in Kyiv with his eyes on the rest of Europe. Starting with [MASK1]. And why don't you tell the 800,000 Polish Americans right here in Pennsylvania how quickly you would give up for the sake of favor and what you think is a friendship with what is known to be a dictator who would eat you for lunch.", "masks": ["Russia", "Poland", "Romania", "Ukraine"]}
{"masked_text": "DAVID MUIR: Vice President Harris Thank you. We heard from both of you on [MASK0] tonight. [MASK1] came up in the last hour -- I wanted her to respond to something you said earlier.", "masks": ["Ukraine", "Afghanistan"]}
{"masked_text": "DAVID MUIR: We've talked about [MASK0] and Vladimir Putin. I do want to talk about [MASK1]. It came up in the first hour of this debate.", "masks": ["Ukraine", "Afghanistan"]}
{"masked_text": "DAVID MUIR: Thank you. I want to turn to [MASK0]. We witnessed a poignant moment today on Capitol Hill honoring the soldiers who died in the chaotic withdrawal from [MASK0]. I do want to ask the vice president, do you believe you bear any responsibility in the way that withdrawal played out?", "masks": ["Afghanistan"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, I will tell you, I agreed with President Biden's decision to pull out of [MASK0]. Four presidents said they would, and Joe Biden did. And as a result, America's taxpayers are not paying the $300 million a day we were paying for that endless war. And as of today, there is not one member of the United States military who is in active duty in a combat zone in any war zone around the world, the first time this century. But let's understand how we got to where we are. Donald Trump when he was president negotiated one of the weakest deals you can imagine. He calls himself a dealmaker. Even his national security adviser said it was a weak, terrible deal. And here's how it went down. He bypassed the Afghan government. He negotiated directly with a terrorist organization called the Taliban. The negotiation involved the Taliban getting 5,000 terrorists, Taliban terrorists released.", "masks": ["Afghanistan"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: And get this -- no, get this. And the president at the time invited the Taliban to Camp David. A place of storied significance for us as Americans, a place where we honor the importance of American diplomacy, where we invite and receive respected world leaders. And this former president as president invited them to Camp David because he does not again appreciate the role and responsibility of the President of the United States to be commander in chief with a level of respect. And this gets back to the point of how he has consistently disparaged and demeaned members of our military, fallen soldiers, and the work that we must do to uphold the strength and the respect of the [MASK0] around the world.", "masks": ["United_states_of_america"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Yeah, thank you. So if you take a look at that period of time, the Taliban was killing our soldiers, a lot of them, with snipers. And I got involved with the Taliban because the Taliban was doing the killing. That's the fighting force within [MASK0]. They don't bother doing that because you know, they deal with the wrong people all the time. But I got involved. And Abdul is the head of the Taliban. He is still the head of the Taliban. And I told Abdul don't do it anymore, you do it anymore you're going to have problems. And he said why do you send me a picture of my house? I said you're going to have to figure that out, Abdul. And for 18 months we had nobody killed. We did have an agreement negotiated by Mike Pompeo. It was a very good agreement. The reason it was good, it was -- we were getting out. We would have been out faster than them, but we wouldn't have lost the soldiers. We wouldn't have left many Americans behind. And we wouldn't have left -- we wouldn't have left $85 billion worth of brand new beautiful military equipment behind. And just to finish, they blew it. The agreement said you have to do this, this, this, this, this, and they didn't do it. They didn't do it. The agreement was, was terminated by us because they didn't do what they were supposed to do.", "masks": ["Afghanistan"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: And these people did the worst withdrawal and in my opinion the most embarrassing moment in the history of our country. And by the way, that's why [MASK0] attacked [MASK1]. Because they saw how incompetent she and her boss are.", "masks": ["Russia", "Ukraine"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: That didn't happen under Donald Trump. Let me just tell you, they lost 10,000 manufacturing jobs this last month. It's going -- they're all leaving. They're building big auto plants in [MASK0]. In many cases owned by [MASK1]. They're building these massive plants, and they think they're going to sell their cars into the United States because of these people. What they have given to [MASK1] is unbelievable. But we're not going to let that. We'll put tariffs on those cars so they can't come into our country. Because they will kill the United Auto Workers and any auto worker, whether it's in Detroit or South Carolina or any other place. What they've done to business and manufacturing in this country is horrible. We have nothing because they refuse -- you know, Biden doesn't go after people because supposedly [MASK1] paid him millions of dollars. He's afraid to do it. Between him and his son. They get all this money from [MASK2]. They get all this money from all of these different countries. And then you wonder why is he so loyal to this one, that one [MASK2], [MASK1]? Why is he? Why did he get 3 1/2 million dollars from the mayor of Moscow's wife? Why did he get -- why did she pay him 3 1/2 million dollars? This is a crooked administration, and they're selling our country down the tubes.", "masks": ["Mexico", "China", "Ukraine"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: So, she just started by saying she's going to do this, she's going to do that, she's going to do all these wonderful things. Why hasn't she done it? She's been there for 3 1/2 years. They've had 3 1/2 years to fix the border. They've had 3 1/2 years to create jobs and all the things we talked about. Why hasn't she done it? She should leave right now, go down to that beautiful white house, go to the capitol, get everyone together and do the things you want to do. But you haven't done it. And you won't do it. Because you believe in things that the American people don't believe in. You believe in things like we're not going to frack. We're not going to take fossil fuel. We're not going to do, things that are going to make this country strong, whether you like it or not. [MASK0] tried that and within one year they were back to building normal energy plants. We're not ready for it. We can't sacrifice our country for the sake of bad vision. But I just ask one simple question. Why didn't she do it? We're a failing nation. We're a nation that's in serious decline. We're being laughed at all over the world. All over the world, they laugh, I know the leaders very well. They're coming to see me. They call me. We're laughed at all over the world. They don't understand what happened to us as a nation. We're not a leader. We don't have any idea what's going on. We have wars going on in the Middle East. We have wars going on with [MASK1] and [MASK2]. We're going to end up in a third World War. And it will be a war like no other because of nuclear weapons, the power of weaponry. I rebuilt our entire military. She gave a lot of it away to the Taliban. She gave it to [MASK3]. What these people have done to our country, and maybe toughest of all is allowing millions of people to come into our country, many of them are criminals, and they're destroying our country. The worst president, the worst vice president in the history of our country.", "masks": ["Germany", "Russia", "Ukraine", "Afghanistan"]}
