{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Well, there she goes again. It's a lie. I'm not signing a ban. And there's no reason to sign a ban. Because we've gotten what everybody wanted. Democrats, Republicans and everybody else and every legal scholar wanted it to be brought back into the states. And the states are voting. And it may take a [MASK0] time, but for 52 years this issue has torn our country apart. And they've wanted it back in the states. And I did something that nobody thought was possible. The states are now voting. What she says is an absolute lie. And as far as the abortion ban, no, I'm not in favor of abortion ban. But it doesn't matter because this issue has now been taken over by the states.", "masks": ["Little"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Excuse me. Every one of those cases was started by them against their political opponent. And I'm winning most of them and I'll win the rest on appeal. And you saw that with the decision that came down just recently from the Supreme Court. I'm winning most of them. But those are cases, it's called weaponization. Never happened in this country. They weaponized the [MASK0] department. Every one of those cases was involved with the DOJ, from Atlanta and Fani Willis -- to the attorney general of New York and the D.A. In New York. Every one of those cases. And then they say oh, he was -- he's a criminal. They're the ones that made them go after me. By the way, Joe Biden was found essentially guilty on the documents case. And what happened in my documents case? They said oh, that's the toughest of them all. A complete and total victory. Two months ago it was thrown out. It's weaponization. And they used it. And it's never happened in this country. They used it to try and win an election. They're fake cases.", "masks": ["Justice"]}
{"masked_text": "DAVID MUIR: President Trump, thank you. A really quick response here, Vice President Harris, on this notion of weaponization of the [MASK0] department.", "masks": ["Justice"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well let's talk about extreme. And understand the context in which this election in 2024 is taking place. The United States Supreme Court recently ruled that the former president would essentially be immune from any misconduct if he were to enter the white house again. Understand, this is someone who has openly said he would terminate, I'm quoting, terminate the constitution of the United States. That he would weaponize the Department of [MASK0] against his political enemies. Someone who has openly expressed disdain for members of our military. Understand what it would mean if Donald Trump were back in the white house with no guardrails. Because certainly, we know now the court won't stop him. We know JD Vance is not going to stop him. It's up to the American people to stop him.", "masks": ["Justice"]}
{"masked_text": "DAVID MUIR: We talked immigration here tonight. I do want to focus on this next issue to both of you. Because it really brings us, this into focus. Truth in these times that we're living in. Mr. President, for 3 and a half years after you lost the 2020 election you repeatedly falsely claimed that you won, many times saying you won in a landslide. In the past couple of weeks leading up to this debate, you have said, quote, you lost by a whisker, that you, quote, didn't quite make it, that you came up a [MASK0] bit short.", "masks": ["Little"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Let me just tell you about world leaders. Viktor Orban, one of the most respected men -- they call him a strong man. He's a tough person. Smart. Prime Minister of Hungary. They said why is the whole world blowing up? Three years ago it wasn't. Why is it blowing up? He said because you need Trump back as president. They were afraid of him. China was afraid. And I don't like to use the word afraid but I'm just quoting him. China was afraid of him. North Korea was afraid of him. Look at what's going on with North Korea, by the way. He said Russia was afraid of him. I ended the Nord Stream 2 pipeline and Biden put it back on day one but he ended the XL pipeline. The XL pipeline in our country. He ended that. But he let the Russians build a pipeline going all over Europe and heading into Germany. The biggest pipeline in the world. Look, Viktor Orban said it. He said the most respected, most feared person is Donald Trump. We had no problems when Trump was president. But when this weak pathetic man that you saw at a debate just a few months ago that if he weren't in that debate he'd be running instead of her, she got no votes, he got 14 million votes, what you did, you talk about a threat to democracy. He got 14 million votes and they threw him out of office. And you know what? I'll give you a [MASK0] secret. He hates her. He can't stand her.", "masks": ["Little"]}
{"masked_text": "LINSEY DAVIS: Vice President Harris, in 2017 you supported Bernie [MASK0]' proposal to do away with private insurance and create a government-run health care system. Two years later you proposed a plan that included a private insurance option. What is your plan today?", "masks": ["Sanders"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, first of all, I absolutely support and over the last four years as vice president private health care options. But what we need to do is maintain and grow the Affordable Care Act. But I, I'll get to that, linsey. I just need to respond to a previous point that the former president has made. I've made very clear my position on fracking. And then this business about taking everyone's guns away. [MASK0] and I are both gun owners. We're not taking anybody's guns away. So stop with the continuous lying about this stuff. As it relates to the Affordable Care Act, understand, just look at the history to know where people stand. When Donald Trump was president, 60 times he tried to get rid of the Affordable Care Act. 60 times. I was a senator at the time. When, I will never forget the early morning hours when it was up for a vote in the United States Senate and the late great John McCain, who you have disparaged as being – uh, you don't like him, you said at the time because he got caught, he was an American hero. The late great John McCain, I will never forget that night. Walked onto the Senate floor and said no, you don't. No, you don't. No, you don't get rid of the Affordable Care Act. You have no plan. And what the Affordable Care Act has done is eliminate the ability of insurance companies to deny people with pre-existing conditions. I don't have to tell the people watching tonight, you remember what that was like? Remember when an insurance company could deny if a child had asthma, if someone was a breast cancer survivor, if a grandparent had diabetes? And thankfully, as I've been vice president and we over the last four years have strengthened the Affordable Care Act, we have allowed for the first time Medicare to negotiate drug prices on behalf of you the American people. Donald Trump said he was going to allow Medicare to negotiate dr, drug prices. He never did. We did. And now we have capped the cost of insulin at $35 a month. Since I've been vice president we have capped the cost of prescription medication for seniors at $2,000 a year. And when I am president we will do that for all people understanding that the value I bring to this is that access to health care should be a right and not just a privilege of those who can afford it. And the plan has to be to strengthen the Affordable Care Act, not get rid of it, (in audible) in terms of where Donald Trump stands on that.", "masks": ["Walz"]}
