{"masked_text": "DAVID MUIR: Tonight, the high-stakes showdown here in Philadelphia between Vice President [MASK0] and former president Trump.", "masks": ["Harris"]}
{"masked_text": "DAVID MUIR: Tonight, the high-stakes showdown here in Philadelphia between Vice President Harris and former president [MASK0].", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0] and President Trump are just moments away from taking the stage in this unprecedented race for president.", "masks": ["Harris"]}
{"masked_text": "Vice President Harris and President [MASK0] are just moments away from taking the stage in this unprecedented race for president.", "masks": ["Trump"]}
{"masked_text": "For Vice President [MASK0], this is her first debate since President Biden withdrew from the race on July 21st.", "masks": ["Harris"]}
{"masked_text": "For Vice President Harris, this is her first debate since President [MASK0] withdrew from the race on July 21st.", "masks": ["Biden"]}
{"masked_text": "Of course, that decision followed his debate against President [MASK0] in June.", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0], you and President Trump were elected four years ago and your opponent on the stage here tonight often asks his supporters, are you better off than you were four years ago?", "masks": ["Harris"]}
{"masked_text": "Vice President Harris, you and President [MASK0] were elected four years ago and your opponent on the stage here tonight often asks his supporters, are you better off than you were four years ago?", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: So, I was raised as a middle-class kid.", "masks": ["Harris"]}
{"masked_text": "My opponent has a plan that I call the [MASK0] sales tax, which would be a 20% tax on everyday goods that you rely on to get through the month.", "masks": ["Trump"]}
{"masked_text": "Economists have said that [MASK0]'s sales tax would actually result for middle-class families in about $4,000 more a year because of his policies and his ideas about what should be the backs of middle-class people paying for tax cuts for billionaires.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: First of all, I have no sales tax.", "masks": ["Trump"]}
{"masked_text": "These are the people that she and [MASK0] let into our country.", "masks": ["Biden"]}
{"masked_text": "But I would like to let Vice President [MASK0] respond on the economy here.", "masks": ["Harris"]}
{"masked_text": "[MASK0] left us the worst unemployment since the Great Depression.", "masks": ["Trump"]}
{"masked_text": "[MASK0] left us the worst public health epidemic in a century.", "masks": ["Trump"]}
{"masked_text": "[MASK0] left us the worst attack on our democracy since the Civil War.", "masks": ["Trump"]}
{"masked_text": "And what we have done is clean up [MASK0]'s mess.", "masks": ["Trump"]}
{"masked_text": "DAVID MUIR: President [MASK0], I'll give you a minute here to respond.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Number one, I have nothing to do, as you know and as she knows better than anyone, I have nothing to do with Project 2025.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: So, Trump has no plan for you.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT Harris: So, [MASK0] has no plan for you.", "masks": ["Trump"]}
{"masked_text": "What Goldman Sachs has said is that [MASK0]'s plan would make the economy worse.", "masks": ["Trump"]}
{"masked_text": "What the Wharton School has said is [MASK0]'s plan would actually explode the deficit.", "masks": ["Trump"]}
{"masked_text": "And I'd invite you to know that [MASK0] actually has no plan for you, because he is more interested in defending himself than he is in looking out for you.", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0] has argued it'll mean higher prices on gas, food, clothing medication arguing it costs the typical family nearly four thousand dollars a year.", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: They aren't gonna have higher prices what's gonna have and who's gonna have higher prices is China and all of the countries that have been ripping us off for years.", "masks": ["Trump"]}
{"masked_text": "The polls say 80 and 85 and even 90% that the [MASK0] economy was great that their economy was terrible.", "masks": ["Trump"]}
{"masked_text": "DAVID MUIR: Vice President [MASK0] I do want to ask for your response and you heard what the president said there because the Biden administration did keep a number of the Trump tariffs in place so how do you respond?", "masks": ["Harris"]}
{"masked_text": "DAVID MUIR: Vice President Harris I do want to ask for your response and you heard what the president said there because the [MASK0] administration did keep a number of the Trump tariffs in place so how do you respond?", "masks": ["Biden"]}
{"masked_text": "DAVID MUIR: Vice President Harris I do want to ask for your response and you heard what the president said there because the Biden administration did keep a number of the [MASK0] tariffs in place so how do you respond?", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, let's be clear that the Trump administration resulted in a trade deficit, one of the highest we've ever seen in the history of America.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT Harris: Well, let's be clear that the [MASK0] administration resulted in a trade deficit, one of the highest we've ever seen in the history of America.", "masks": ["Trump"]}
{"masked_text": "He invited trade wars, you wanna talk about his deal with China what he ended up doing is under [MASK0]'s presidency he ended up selling American chips to China to help them improve and modernize their military basically sold us out when a policy about China should be in making sure the United States of America wins the competition for the 21st century.", "masks": ["Trump"]}
{"masked_text": "But what [MASK0] did let's talk about this with COVID, is he actually thanked President XI for what he did during COVID. Look at his tweet.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: First of all, they bought their chips from Taiwan.", "masks": ["Trump"]}
{"masked_text": "President [MASK0], you've often touted that you were able to kill Roe v.", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0] says that women shouldn't trust you on the issue of abortion because you've changed your position so many times.", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Well, the reason I'm doing that vote is because the plan is, as you know, the vote is, they have abortion in the ninth month.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: And that's why I did that, because that predominates.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: And through the genius and heart and strength of six supreme court justices we were able to do that.", "masks": ["Trump"]}
{"masked_text": "Madam vice president, I want to get your response to President [MASK0].", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, as I said, you're going to hear a bunch of lies.", "masks": ["Harris"]}
{"masked_text": "[MASK0] hand-selected three members of the United States Supreme Court with the intention that they would undo the protections of Roe v.", "masks": ["Trump"]}
{"masked_text": "And now in over 20 states there are [MASK0] abortion bans which make it criminal for a doctor or nurse to provide health care.", "masks": ["Trump"]}
{"masked_text": "[MASK0] abortion bans that make no exception even for rape and incest.", "masks": ["Trump"]}
{"masked_text": "And one does not have to abandon their faith or deeply held beliefs to agree the government, and [MASK0] certainly, should not be telling a woman what to do with her body.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: I have talked with women around our country.", "masks": ["Harris"]}
{"masked_text": "But understand, if [MASK0] were to be re-elected, he will sign a national abortion ban.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Well, I won't have to because again -- two things.", "masks": ["Trump"]}
{"masked_text": "Because your running mate [MASK0] has said that you would veto if it did come to your desk.", "masks": ["Vance"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Well, I didn't discuss it with JD In all fairness.", "masks": ["Trump"]}
{"masked_text": "LINSEY DAVIS: Vice President [MASK0], I want to give you your time to respond.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: I absolutely support reinstating the protections of Roe v.", "masks": ["Harris"]}
{"masked_text": "And understand what has been happening under [MASK0]'s abortion bans.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Excuse me, I have to respond.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Why don't you answer the question would you veto –", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Answer the question, would you veto--", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: You could do abortions in the seventh month, the eighth month, the ninth month -", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0], you were tasked by President Biden with getting to the root causes of migration from Central America.", "masks": ["Harris"]}
{"masked_text": "Vice President Harris, you were tasked by President [MASK0] with getting to the root causes of migration from Central America.", "masks": ["Biden"]}
{"masked_text": "We know that illegal border crossings reached a record high in the [MASK0] administration.", "masks": ["Biden"]}
{"masked_text": "This past June, President [MASK0] imposed tough new asylum restrictions.", "masks": ["Biden"]}
{"masked_text": "But my question to you tonight is why did the administration wait until six months before the election to act and would you have done anything differently from President [MASK0] on this?", "masks": ["Biden"]}
{"masked_text": "VICE PRESIDENT [MASK0]: So I'm the only person on this stage who has prosecuted transnational criminal organizations for the trafficking of guns, drugs, and human beings.", "masks": ["Harris"]}
{"masked_text": "[MASK0] got on the phone, called up some folks in Congress, and said kill the bill.", "masks": ["Trump"]}
{"masked_text": "And I'm going to actually do something really unusual and I'm going to invite you to attend one of [MASK0]'s rallies because it's a really interesting thing to watch.", "masks": ["Trump"]}
{"masked_text": "President [MASK0], on that point I want to get your response.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Well, I would like to respond.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: First let me respond as to the rallies.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Well, I've seen people on television", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: The people on television say my dog was taken and used for food.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: But the people on television say their dog was eaten by the people that went there.", "masks": ["Trump"]}
{"masked_text": "DAVID MUIR: Vice President [MASK0], I'll let you respond to the rest of what you heard.", "masks": ["Harris"]}
{"masked_text": "His former secretary of defense has said the nation, the republic would never survive another [MASK0] term.", "masks": ["Trump"]}
{"masked_text": "DAVID MUIR: President [MASK0], I'll give you a quick minute to respond.", "masks": ["Trump"]}
{"masked_text": "President [MASK0], you called this the largest domestic deportation operation in the history of our country.", "masks": ["Trump"]}
{"masked_text": "DAVID MUIR: President [MASK0], as you know, the FBI says overall violent crime is coming down in this country, but Vice President the...", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: use me, the FBI -- they were defrauding statements.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, I think this is so rich.", "masks": ["Harris"]}
{"masked_text": "By the way, [MASK0] was found essentially guilty on the documents case.", "masks": ["Biden"]}
{"masked_text": "A really quick response here, Vice President [MASK0], on this notion of weaponization of the justice department.", "masks": ["Harris"]}
{"masked_text": "Understand what it would mean if [MASK0] were back in the white house with no guardrails.", "masks": ["Trump"]}
{"masked_text": "We know [MASK0] is not going to stop him.", "masks": ["Vance"]}
{"masked_text": "LINDSEY DAVIS: Vice President [MASK0], in your last run for president...", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: This is the one that weaponized.", "masks": ["Trump"]}
{"masked_text": "LINSEY DAVIS: Vice President [MASK0], in your last run for president you said you wanted to ban fracking.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: So my values have not changed.", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Well, first of all, I wasn't given $400 million.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: In Minnesota, she went out -- wait a minute.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: She went out -- she went out in Minnesota and wanted to let criminals that killed people, that burned down Minneapolis, she went out and raised money to get them out of jail.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: These are not good things for the environment that she understands.", "masks": ["Trump"]}
{"masked_text": "LINSEY DAVIS: President [MASK0], we have a lot of issues that we have to get to.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: You just said a thing that isn't covered.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: But when are those, David, when are those people going to be prosecuted?", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: You might ask her that question.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: I had nothing to do with that other than they asked me to make a speech.", "masks": ["Trump"]}
{"masked_text": "But I do want Vice President [MASK0] to respond here.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: I was at the Capitol on January 6th.", "masks": ["Harris"]}
{"masked_text": "[MASK0] the candidate has said in this election there will be a bloodbath, if this -- and the outcome of this election is not to his liking.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: I have said blood bash, bath.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Those people are killing many people, unlike J-6.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: No, I don't acknowledge that at all.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: They said we didn't have standing.", "masks": ["Trump"]}
{"masked_text": "This was a post from President [MASK0] about this upcoming election just weeks away.", "masks": ["Trump"]}
{"masked_text": "One of your campaign's top lawyers responded saying, \"We won't let [MASK0] intimidate us.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Trump was fired by 81 million people.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT Harris: [MASK0] was fired by 81 million people.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Let me just tell you about world leaders.", "masks": ["Trump"]}
{"masked_text": "I ended the Nord Stream 2 pipeline and [MASK0] put it back on day one but he ended the XL pipeline.", "masks": ["Biden"]}
{"masked_text": "He said the most respected, most feared person is [MASK0].", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: But he had 14 million votes.", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0], in December you said, \"Israel has a right to defend itself\"", "masks": ["Harris"]}
{"masked_text": "President [MASK0] has not been able to break through the stalemate.", "masks": ["Biden"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, let's understand how we got here.", "masks": ["Harris"]}
{"masked_text": "LINSEY DAVIS: President [MASK0], how would you negotiate with Netanyahu and also Hamas in order to get the hostages out and prevent the killing of more innocent civilians in Gaza?", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: If I were president it would have never started.", "masks": ["Trump"]}
{"masked_text": "LINSEY DAVIS: Vice President [MASK0], he says you hate Israel.", "masks": ["Harris"]}
{"masked_text": "He's trying to again divide and distract from the reality, which is it is very well known that [MASK0] is weak and wrong on national security and foreign policy.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: They're the ones -- and she's the one that caused it, that's weak on national security by allowing every nation last month for the year, 168 different countries sending people into our country.", "masks": ["Trump"]}
{"masked_text": "Why does [MASK0] go in and kill the Keystone pipeline and approve the single biggest deal that Russia's ever made, Nordstream 2, the biggest pipeline anywhere in the world going to Germany and all over Europe?", "masks": ["Biden"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Gets paid a lot of money --", "masks": ["Trump"]}
{"masked_text": "Mr. President, it has been the position of the [MASK0] administration that we must defend Ukraine from Russia, from Vladimir Putin, to defend their sovereignty, their democracy, that it's in America's best interest to do so, arguing that if Putin wins he may be emboldened to move even further into other countries.", "masks": ["Biden"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: I want the war to stop.", "masks": ["Trump"]}
{"masked_text": "They're in for $150 billion less because [MASK0] and you don't have the courage to ask Europe like I did with NATO. They paid billions and billions, hundreds of billions of dollars when I said either you pay up or we're not going to protect you anymore.", "masks": ["Biden"]}
{"masked_text": "Well, it wasn't because [MASK0] had no idea how to talk to him.", "masks": ["Biden"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: They threw him out of a campaign like a dog.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: I think it's in the U.S. best interest to get this war finished and just get it done.", "masks": ["Trump"]}
{"masked_text": "DAVID MUIR: I want to take this to Vice President [MASK0].", "masks": ["Harris"]}
{"masked_text": "But also as commander in chief if elected how would you deal with Vladimir Putin and would it be any different from what we're seeing from President [MASK0]?", "masks": ["Biden"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, first of all, it's important to remind the former president you're not running against Biden, you're running against me.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT Harris: Well, first of all, it's important to remind the former president you're not running against [MASK0], you're running against me.", "masks": ["Biden"]}
{"masked_text": "I believe the reason that [MASK0] says that this war would be over within 24 hours is because he would just give it up.", "masks": ["Trump"]}
{"masked_text": "If [MASK0] were president, Putin would be sitting in Kyiv right now.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Putin would be sitting in Moscow and he wouldn't have lost 300,000 men and women.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: And that's the kind of talent we have with her.", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0], have you ever met Vladimir Putin, can you clarify tonight?", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Yet again, I said it at the beginning of this debate, you're going to hear a bunch of lies coming from this fella.", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Secretary General Stoltenberg said [MASK0] did the most amazing thing I've ever seen, he got these countries, the 28 countries at the time, to pay up.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: Otherwise we would've never gotten it.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, I will tell you, I agreed with President Biden's decision to pull out of Afghanistan.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT Harris: Well, I will tell you, I agreed with President [MASK0]'s decision to pull out of Afghanistan.", "masks": ["Biden"]}
{"masked_text": "[MASK0] when he was president negotiated one of the weakest deals you can imagine.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: And get this -- no, get this.", "masks": ["Harris"]}
{"masked_text": "President [MASK0], your response to her saying that you began the negotiations with the Taliban.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: And these people did the worst withdrawal and in my opinion the most embarrassing moment in the history of our country.", "masks": ["Trump"]}
{"masked_text": "Mr. President, you recently said of Vice President [MASK0], \"I didn't know she was Black until a number of years ago when she happened to turn Black, and now she wants to be known as Black.\"", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: I think it's – I mean honestly, I think it's a tragedy that we have someone who wants to be president who has consistently over the course of his career attempted to use race to divide the American people.", "masks": ["Harris"]}
{"masked_text": "LINSEY DAVIS: President [MASK0], this is now your third time --", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: This is the most divisive presidency in the history of our country.", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: I want to respond to that, though.", "masks": ["Harris"]}
{"masked_text": "Clearly, I am not [MASK0], and I am certainly not Trump.", "masks": ["Biden"]}
{"masked_text": "Clearly, I am not Biden, and I am certainly not [MASK0].", "masks": ["Trump"]}
{"masked_text": "VICE PRESIDENT [MASK0]: The former president has said something twice and I need to respond too.", "masks": ["Harris"]}
{"masked_text": "LINSEY DAVIS: I'm sorry, we're going to move on, Vice President [MASK0].", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: I have concepts of a plan.", "masks": ["Trump"]}
{"masked_text": "LINSEY DAVIS: Vice President [MASK0], in 2017 you supported Bernie Sanders' proposal to do away with private insurance and create a government-run health care system.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, first of all, I absolutely support and over the last four years as vice president private health care options.", "masks": ["Harris"]}
{"masked_text": "When [MASK0] was president, 60 times he tried to get rid of the Affordable Care Act.", "masks": ["Trump"]}
{"masked_text": "[MASK0] said he was going to allow Medicare to negotiate dr, drug prices.", "masks": ["Trump"]}
{"masked_text": "And the plan has to be to strengthen the Affordable Care Act, not get rid of it, (in audible) in terms of where [MASK0] stands on that.", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: People are paying privately for insurance that have worked hard and made money and they want to have private.", "masks": ["Trump"]}
{"masked_text": "President [MASK0], with regard to the environment, you say that we have to have clean air and clean water.", "masks": ["Trump"]}
{"masked_text": "Vice President [MASK0], you call climate change an existential threat.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: Well, the former president had said that climate change is a hoax.", "masks": ["Harris"]}
{"masked_text": "[MASK0] said he was going to create manufacturing jobs.", "masks": ["Trump"]}
{"masked_text": "It includes growing what we can do around American manufacturing and opening up auto plants, not closing them like what happened under [MASK0].", "masks": ["Trump"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: That didn't happen under [MASK0].", "masks": ["Trump"]}
{"masked_text": "We have nothing because they refuse -- you know, [MASK0] doesn't go after people because supposedly China paid him millions of dollars.", "masks": ["Biden"]}
{"masked_text": "VICE PRESIDENT [MASK0]: So I think you've heard tonight two very different visions for our country.", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT [MASK0]: So, she just started by saying she's going to do this, she's going to do that, she's going to do all these wonderful things.", "masks": ["Trump"]}
