{"masked_text": "I took in billions and billions of dollars, as you know, from [MASK0].", "masks": ["China"]}
{"masked_text": "They've taken in billions of dollars from [MASK0] and other places.", "masks": ["China"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: They aren't gonna have higher prices what's gonna have and who's gonna have higher prices is [MASK0] and all of the countries that have been ripping us off for years.", "masks": ["China"]}
{"masked_text": "I charge, I was the only president ever [MASK0] was paying us hundreds of billions of dollars and so were other countries and you know if she doesn't like 'em they should have gone out and they should have immediately cut the tariffs but those tariffs are there three and a half years now under their administration.", "masks": ["China"]}
{"masked_text": "He invited trade wars, you wanna talk about his deal with [MASK0] what he ended up doing is under Donald Trump's presidency he ended up selling American chips to [MASK0] to help them improve and modernize their military basically sold us out when a policy about [MASK0] should be in making sure the [MASK1] wins the competition for the 21st century.", "masks": ["China", "United_states_of_america"]}
{"masked_text": "They didn't fire anybody having to do with [MASK0] and the Taliban and the 13 people whose, whose, were just killed viciously and violently killed and I got to know the parents and the family.", "masks": ["Afghanistan"]}
{"masked_text": "And told by their countries like [MASK0] don't ever come back or we're going to kill you.", "masks": ["Venezuela"]}
{"masked_text": "Do you know that crime in [MASK0] and crime in countries all over the world is way down?", "masks": ["Venezuela"]}
{"masked_text": "They're the threat to democracy – With the fake [MASK0] [MASK0] [MASK0] investigation that went nowhere.", "masks": ["Russia"]}
{"masked_text": "I'll show you [MASK0] and I'll show you Wisconsin and I'll show you Pennsylvania and I'll show you -- we have so many facts and statistics.", "masks": ["Georgia"]}
{"masked_text": "Look at what's going on with [MASK0], by the way.", "masks": ["North_korea"]}
{"masked_text": "But he let the Russians build a pipeline going all over Europe and heading into [MASK0].", "masks": ["Germany"]}
{"masked_text": "LINSEY DAVIS: Turning now to the [MASK0]-Hamas war and the hostages who are still being held, Americans among them.", "masks": ["Israel"]}
{"masked_text": "Vice President Harris, in December you said, \"[MASK0] has a right to defend itself\"", "masks": ["Israel"]}
{"masked_text": "Saying international humanitarian law must be respected, [MASK0] must do more to protect innocent civilians.", "masks": ["Israel"]}
{"masked_text": "And so absolutely, I said then, I say now, [MASK0] has a right to defend itself.", "masks": ["Israel"]}
{"masked_text": "And in that solution, there must be security for the Israeli people and [MASK0] and in equal measure for the Palestinians.", "masks": ["Israel"]}
{"masked_text": "But the one thing I will assure you always, I will always give [MASK0] the ability to defend itself, in particular as it relates to [MASK1] and any threat that [MASK1] and its proxies pose to [MASK0].", "masks": ["Israel", "Iran"]}
{"masked_text": "If I were president [MASK0] would have never, ever -- I know Putin very well.", "masks": ["Russia"]}
{"masked_text": "Have gone into [MASK0] and killed millions of people when you add it up.", "masks": ["Ukraine"]}
{"masked_text": "But when she mentions about [MASK0] all of a sudden -- she hates [MASK0].", "masks": ["Israel"]}
{"masked_text": "If she's president, I believe that [MASK0] will not exist within two years from now.", "masks": ["Israel"]}
{"masked_text": "At the same time in her own way she hates the Arab population because the whole place is going to get blown up, Arabs, Jewish people, [MASK0].", "masks": ["Israel"]}
{"masked_text": "Now [MASK0] has $300 billion because they took off all the sanctions that I had.", "masks": ["Iran"]}
{"masked_text": "[MASK0] had no money for Hamas or Hezbollah or any of the 28 different spheres of terror.", "masks": ["Iran"]}
{"masked_text": "And I'll get the war with [MASK0] and [MASK1] ended.", "masks": ["Ukraine", "Russia"]}
{"masked_text": "LINSEY DAVIS: Vice President Harris, he says you hate [MASK0].", "masks": ["Israel"]}
{"masked_text": "I have my entire career and life supported [MASK0] and the Israeli people.", "masks": ["Israel"]}
{"masked_text": "It is well known that he said of Putin that he can do whatever the hell he wants and go into [MASK0].", "masks": ["Ukraine"]}
{"masked_text": "It is well known when that he said when [MASK0] went into [MASK1] it was brilliant.", "masks": ["Russia", "Ukraine"]}
{"masked_text": "Why does Biden go in and kill the Keystone pipeline and approve the single biggest deal that [MASK0]'s ever made, Nordstream 2, the biggest pipeline anywhere in the world going to [MASK1] and all over Europe?", "masks": ["Russia", "Germany"]}
{"masked_text": "DAVID MUIR: And I want to turn to the war in [MASK0].", "masks": ["Ukraine"]}
{"masked_text": "Mr. President, it has been the position of the Biden administration that we must defend [MASK0] from [MASK1], from Vladimir Putin, to defend their sovereignty, their democracy, that it's in America's best interest to do so, arguing that if Putin wins he may be emboldened to move even further into other countries.", "masks": ["Ukraine", "Russia"]}
{"masked_text": "Just to clarify the question, do you believe it's in the U.S. best interests for [MASK0] to win this war?", "masks": ["Ukraine"]}
{"masked_text": "I want to get your thoughts on support for [MASK0] in this moment.", "masks": ["Ukraine"]}
{"masked_text": "I actually met with Zelenskyy a few days before [MASK0] invaded, tried through force to change territorial boundaries to defy one of the most important international rules and norms, which is the importance of sovereignty and territorial integrity.", "masks": ["Russia"]}
{"masked_text": "Days later I went to NATO's eastern flank, to [MASK0] and [MASK1].", "masks": ["Poland", "Romania"]}
{"masked_text": "And through the work that I and others did we brought 50 countries together to support [MASK0] in its righteous defense.", "masks": ["Ukraine"]}
{"masked_text": "And because of our support, because of the air defense, the ammunition, the artillery, the javelins, the Abrams tanks that we have provided, [MASK0] stands as an independent and free country.", "masks": ["Ukraine"]}
{"masked_text": "[MASK0] came up in the last hour -- I wanted her to respond to something you said earlier.", "masks": ["Afghanistan"]}
{"masked_text": "We witnessed a poignant moment today on Capitol Hill honoring the soldiers who died in the chaotic withdrawal from [MASK0].", "masks": ["Afghanistan"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, I will tell you, I agreed with President Biden's decision to pull out of [MASK0].", "masks": ["Afghanistan"]}
{"masked_text": "And this gets back to the point of how he has consistently disparaged and demeaned members of our military, fallen soldiers, and the work that we must do to uphold the strength and the respect of the [MASK0] around the world.", "masks": ["United_states_of_america"]}
{"masked_text": "We have nothing because they refuse -- you know, Biden doesn't go after people because supposedly [MASK0] paid him millions of dollars.", "masks": ["China"]}
{"masked_text": "And then you wonder why is he so loyal to this one, that one [MASK0], [MASK1]?", "masks": ["Ukraine", "China"]}
{"masked_text": "[MASK0] tried that and within one year they were back to building normal energy plants.", "masks": ["Germany"]}
