{"masked_text": "DAVID MUIR: Tonight, the high-stakes showdown here in Philadelphia between Vice President Kamala [MASK0] and former president Donald Trump.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: A historic race for president upended just weeks ago.", "masks": ["Davis"]}
{"masked_text": "Vice President Kamala [MASK0] and President Donald Trump are just moments away from taking the stage in this unprecedented race for president.", "masks": ["Harris"]}
{"masked_text": "For Vice President Kamala [MASK0], this is her first debate since President Biden withdrew from the race on July 21st.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: Good evening, we are looking forward to a spirited and thoughtful debate.", "masks": ["Davis"]}
{"masked_text": "LINSEY Davis: [MASK0] evening, we are looking forward to a spirited and thoughtful debate.", "masks": ["Good"]}
{"masked_text": "Vice President [MASK0], you and President Trump were elected four years ago and your opponent on the stage here tonight often asks his supporters, are you better off than you were four years ago?", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: So, I was raised as a middle-class kid.", "masks": ["Harris"]}
{"masked_text": "But I would like to let Vice President [MASK0] respond on the economy here.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: So, Donald Trump has no plan for you.", "masks": ["Harris"]}
{"masked_text": "What [MASK0] Sachs has said is that Donald Trump's plan would make the economy worse.", "masks": ["Goldman"]}
{"masked_text": "It's going to make people want to be able to go and work and create jobs and create a lot of [MASK0], solid money for our -- for our country.", "masks": ["Good"]}
{"masked_text": "You recently said that you might double your plan, imposing tariffs up to 20% on [MASK0] coming into this country.", "masks": ["Good"]}
{"masked_text": "Vice President [MASK0] has argued it'll mean higher prices on gas, food, clothing medication arguing it costs the typical family nearly four thousand dollars a year.", "masks": ["Harris"]}
{"masked_text": "People can't go out and buy cereal [MASK0] or eggs or anything else.", "masks": ["Bacon"]}
{"masked_text": "DAVID MUIR: Vice President [MASK0] I do want to ask for your response and you heard what the president said there because the Biden administration did keep a number of the Trump tariffs in place so how do you respond?", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, let's be clear that the Trump administration resulted in a trade deficit, one of the highest we've ever seen in the history of America.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: I want to turn to the issue of abortion.", "masks": ["Davis"]}
{"masked_text": "Vice President [MASK0] says that women shouldn't trust you on the issue of abortion because you've changed your position so many times.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: There is no state in this country where it is legal to kill a baby after it's born.", "masks": ["Davis"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, as I said, you're going to hear a bunch of lies.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: I have talked with women around our country.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: Would you veto a national abortion ban if it came to --", "masks": ["Davis"]}
{"masked_text": "LINSEY [MASK0]: But if I could just get a yes or no.", "masks": ["Davis"]}
{"masked_text": "LINSEY [MASK0]: Vice President Harris, I want to give you your time to respond.", "masks": ["Davis"]}
{"masked_text": "LINSEY Davis: Vice President [MASK0], I want to give you your time to respond.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: I absolutely support reinstating the protections of Roe v.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Why don't you answer the question would you veto –", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Answer the question, would you veto--", "masks": ["Harris"]}
{"masked_text": "Vice President [MASK0], you were tasked by President Biden with getting to the root causes of migration from Central America.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: So I'm the only person on this stage who has prosecuted transnational criminal organizations for the trafficking of guns, drugs, and human beings.", "masks": ["Harris"]}
{"masked_text": "So maybe he said that and maybe that's a [MASK0] thing to say for a city manager.", "masks": ["Good"]}
{"masked_text": "DAVID MUIR: Vice President [MASK0], I'll let you respond to the rest of what you heard.", "masks": ["Harris"]}
{"masked_text": "Um, you know, this is I think one of the reasons why in this election I actually have the endorsement of 200 Republicans who have formally worked with President [MASK0], Mitt Romney, and John McCain including the endorsement of former Vice President Dick Cheney and Congressmember Liz Cheney.", "masks": ["Bush"]}
{"masked_text": "That's a [MASK0] way not to have books written about you.", "masks": ["Good"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, I think this is so rich.", "masks": ["Harris"]}
{"masked_text": "By the way, Joe Biden was found essentially guilty on the documents [MASK0].", "masks": ["Case"]}
{"masked_text": "A really quick response here, Vice President [MASK0], on this notion of weaponization of the justice department.", "masks": ["Harris"]}
{"masked_text": "LINDSEY [MASK0]: Vice President Harris, in your last run for president...", "masks": ["Davis"]}
{"masked_text": "LINDSEY Davis: Vice President [MASK0], in your last run for president...", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: Vice President Harris, in your last run for president you said you wanted to ban fracking.", "masks": ["Davis"]}
{"masked_text": "LINSEY Davis: Vice President [MASK0], in your last run for president you said you wanted to ban fracking.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: So my values have not changed.", "masks": ["Harris"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: These are not [MASK0] things for the environment that she understands.", "masks": ["Good"]}
{"masked_text": "LINSEY [MASK0]: President Trump, we have a lot of issues that we have to get to.", "masks": ["Davis"]}
{"masked_text": "I went to [MASK0] and the mayor of Washington, D.C. And the mayor put it back in writing, as you know.", "masks": ["Pelosi"]}
{"masked_text": "It would have never happened if [MASK0] and the mayor of Washington did their jobs.", "masks": ["Pelosi"]}
{"masked_text": "DAVID MUIR: The question was about you as president, not about Former Speaker [MASK0].", "masks": ["Pelosi"]}
{"masked_text": "But I do want Vice President [MASK0] to respond here.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: I was at the Capitol on January 6th.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Donald Trump was fired by 81 million people.", "masks": ["Harris"]}
{"masked_text": "Viktor Orban, one of the most respected men -- they call him a [MASK0] man.", "masks": ["Strong"]}
{"masked_text": "LINSEY [MASK0]: Turning now to the Israel-Hamas war and the hostages who are still being held, Americans among them.", "masks": ["Davis"]}
{"masked_text": "Vice President [MASK0], in December you said, \"Israel has a right to defend itself\"", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, let's understand how we got here.", "masks": ["Harris"]}
{"masked_text": "But we must have a two-state solution where we can rebuild Gaza, where the Palestinians have security, [MASK0]-determination and the dignity they so rightly deserve.", "masks": ["Self"]}
{"masked_text": "LINSEY [MASK0]: President Trump, how would you negotiate with Netanyahu and also Hamas in order to get the hostages out and prevent the killing of more innocent civilians in Gaza?", "masks": ["Davis"]}
{"masked_text": "LINSEY [MASK0]: Vice President Harris, he says you hate Israel.", "masks": ["Davis"]}
{"masked_text": "LINSEY Davis: Vice President [MASK0], he says you hate Israel.", "masks": ["Harris"]}
{"masked_text": "It is well known he exchanged love letters with [MASK0] Jong un.", "masks": ["Kim"]}
{"masked_text": "DAVID MUIR: I want to take this to Vice President [MASK0].", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, first of all, it's important to remind the former president you're not running against Joe Biden, you're running against me.", "masks": ["Harris"]}
{"masked_text": "Vice President [MASK0], have you ever met Vladimir Putin, can you clarify tonight?", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Yet again, I said it at the beginning of this debate, you're going to hear a bunch of lies coming from this fella.", "masks": ["Harris"]}
{"masked_text": "We witnessed a poignant moment today on Capitol [MASK0] honoring the soldiers who died in the chaotic withdrawal from Afghanistan.", "masks": ["Hill"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, I will tell you, I agreed with President Biden's decision to pull out of Afghanistan.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: And get this -- no, get this.", "masks": ["Harris"]}
{"masked_text": "The reason it was [MASK0], it was -- we were getting out.", "masks": ["Good"]}
{"masked_text": "Mr. President, you recently said of Vice President [MASK0], \"I didn't know she was Black until a number of years ago when she happened to turn Black, and now she wants to be known as Black.\"", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: I think it's – I mean honestly, I think it's a tragedy that we have someone who wants to be president who has consistently over the course of his career attempted to use race to divide the American people.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: President Trump, this is now your third time --", "masks": ["Davis"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: I want to respond to that, though.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT [MASK0]: The former president has said something twice and I need to respond too.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: I'm sorry, we're going to move on, Vice President Harris.", "masks": ["Davis"]}
{"masked_text": "LINSEY Davis: I'm sorry, we're going to move on, Vice President [MASK0].", "masks": ["Harris"]}
{"masked_text": "I had a choice to make when I was president, do I save it and make it as [MASK0] as it can be?", "masks": ["Good"]}
{"masked_text": "And I felt I had an obligation, even though politically it would have been [MASK0] to just let it rot and let it go away.", "masks": ["Good"]}
{"masked_text": "I decided -- and I told my people, the top people, and they're very [MASK0] people -- I have a lot of [MASK0] people in this -- that administration.", "masks": ["Good"]}
{"masked_text": "I had a choice to make do I save it and make it as [MASK0] as it can be or let it rot?", "masks": ["Good"]}
{"masked_text": "But until then I'd run it as [MASK0] as it can be run.", "masks": ["Good"]}
{"masked_text": "LINSEY [MASK0]: So just a yes or no, you still do not have a plan?", "masks": ["Davis"]}
{"masked_text": "LINSEY [MASK0]: Vice President Harris, in 2017 you supported Bernie Sanders' proposal to do away with private insurance and create a government-run health care system.", "masks": ["Davis"]}
{"masked_text": "LINSEY Davis: Vice President [MASK0], in 2017 you supported Bernie Sanders' proposal to do away with private insurance and create a government-run health care system.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, first of all, I absolutely support and over the last four years as vice president private health care options.", "masks": ["Harris"]}
{"masked_text": "LINSEY [MASK0]: I want to move to an issue that's important --", "masks": ["Davis"]}
{"masked_text": "Vice President [MASK0], you call climate change an existential threat.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: Well, the former president had said that climate change is a hoax.", "masks": ["Harris"]}
{"masked_text": "VICE PRESIDENT KAMALA [MASK0]: So I think you've heard tonight two very different visions for our country.", "masks": ["Harris"]}
{"masked_text": "We're not going to do, things that are going to make this country [MASK0], whether you like it or not.", "masks": ["Strong"]}
{"masked_text": "And from all of us here at ABC News, [MASK0] night.", "masks": ["Good"]}
