{"masked_text": "DAVID MUIR: The candidates separated by the smallest of margins. Essentially tied in the polls nationally. And in the key battlegrounds, including right here in [MASK0], all still very much in play. The ABC News Presidential Debate starts right now.", "masks": ["Pennsylvania"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: First of all, I have no sales tax. That's an incorrect statement. She knows that. We're doing tariffs on other countries. Other countries are going to finally, after 75 years, pay us back for all that we've done for the world. And the tariff will be substantial in some cases. I took in billions and billions of dollars, as you know, from China. In fact, they never took the tariff off because it was so much money, they can't. It would totally destroy everything that they've set out to do. They've taken in billions of dollars from China and other places. They've left the tariffs on. When I had it, I had tariffs and yet I had no inflation. Look, we've had a terrible economy because inflation has -- which is really known as a country buster. It breaks up countries. We have inflation like very few people have ever seen before. Probably the worst in our nation's history. We were at 21%. But that's being generous because many things are 50, 60, 70, and 80% higher than they were just a few years ago. This has been a disaster for people, for the middle class, but for every class. On top of that, we have millions of people pouring into our country from prisons and jails, from mental institutions and insane asylums. And they're coming in and they're taking jobs that are occupied right now by African Americans and Hispanics and also unions. Unions are going to be affected very soon. And you see what's happening. You see what's happening with towns throughout the United States. You look at Springfield, [MASK0]. You look at Aurora in Colorado. They are taking over the towns. They're taking over buildings. They're going in violently. These are the people that she and Biden let into our country. And they're destroying our country. They're dangerous. They're at the highest level of criminality. And we have to get them out. We have to get them out fast. I created one of the greatest economies in the history of our country. I'll do it again and even better.", "masks": ["Ohio"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: First of all, I have no sales tax. That's an incorrect statement. She knows that. We're doing tariffs on other countries. Other countries are going to finally, after 75 years, pay us back for all that we've done for the world. And the tariff will be substantial in some cases. I took in billions and billions of dollars, as you know, from China. In fact, they never took the tariff off because it was so much money, they can't. It would totally destroy everything that they've set out to do. They've taken in billions of dollars from China and other places. They've left the tariffs on. When I had it, I had tariffs and yet I had no inflation. Look, we've had a terrible economy because inflation has -- which is really known as a country buster. It breaks up countries. We have inflation like very few people have ever seen before. Probably the worst in our nation's history. We were at 21%. But that's being generous because many things are 50, 60, 70, and 80% higher than they were just a few years ago. This has been a disaster for people, for the middle class, but for every class. On top of that, we have millions of people pouring into our country from prisons and jails, from mental institutions and insane asylums. And they're coming in and they're taking jobs that are occupied right now by African Americans and Hispanics and also unions. Unions are going to be affected very soon. And you see what's happening. You see what's happening with towns throughout the United States. You look at Springfield, Ohio. You look at Aurora in [MASK0]. They are taking over the towns. They're taking over buildings. They're going in violently. These are the people that she and Biden let into our country. And they're destroying our country. They're dangerous. They're at the highest level of criminality. And we have to get them out. We have to get them out fast. I created one of the greatest economies in the history of our country. I'll do it again and even better.", "masks": ["Colorado"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: First of all, they bought their chips from Taiwan. We hardly make chips anymore because of philosophies like they have and policies like they have. I don't say her because she has no policy. Everything that she believed three years ago and four years ago is out the window. She's going to my philosophy now. In fact, I was going to send her a MAGA hat. She's gone to my philosophy. But if she ever got elected, she'd change it. And it will be the end of our country. She's a Marxist. Everybody knows she's a Marxist. Her father's a Marxist professor in economics. And he taught her well. But when you look at what she's done to our country and when you look at these millions and millions of people that are pouring into our country monthly where it's I believe 21 million people, not the 15 that people say, and I think it's a lot higher than the 21. That's bigger than [MASK0] state. Pouring in. And just look at what they're doing to our country. They're criminals. Many of these people coming in are criminals. And that's bad for our economy too. You mentioned before, we'll talk about immigration later.", "masks": ["New_york"]}
{"masked_text": "LINSEY DAVIS: I want to turn to the issue of abortion. President Trump, you've often touted that you were able to kill Roe v. Wade. Last year, you said that you were proud to be the most pro-life president in American history. Then last month you said that your administration would be great for women and their reproductive rights. In your home state of [MASK0], you surprised many with regard to your six-week abortion ban because you initially had said that it was too short and you said, \"I'm going to be voting that we need more than six weeks.\" But then the very next day, you reversed course and said you would vote to support the six-week ban. Vice President Harris says that women shouldn't trust you on the issue of abortion because you've changed your position so many times. Therefore, why should they trust you?", "masks": ["Florida"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Well, the reason I'm doing that vote is because the plan is, as you know, the vote is, they have abortion in the ninth month. They even have, and you can look at the governor of [MASK0], the previous governor of [MASK0], not the current governor, who's doing an excellent job, but the governor before. He said the baby will be born and we will decide what to do with the baby. In other words, we'll execute the baby.", "masks": ["West_virginia"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: And through the genius and heart and strength of six supreme court justices we were able to do that. Now, I believe in the exceptions for rape, incest and life of the mother. I believe strongly in it. Ronald Reagan did also. 85% of Republicans do. Exceptions. Very important. But we were able to get it. And now states are voting on it. And for the first time you're going to see -- look, this is an issue that's torn our country apart for 52 years. Every legal scholar, every Democrat, every Republican, liberal, conservative, they all wanted this issue to be brought back to the states where the people could vote. And that's what happened, happened. Now, [MASK0], the vote was somewhat liberal. Kansas the vote was somewhat liberal. Much more liberal than people would have thought. But each individual state is voting. It's the vote of the people now. It's not tied up in the federal government. I did a great service in doing it. It took courage to do it. And the supreme court had great courage in doing it. And I give tremendous credit to those six justices.", "masks": ["Ohio"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: And through the genius and heart and strength of six supreme court justices we were able to do that. Now, I believe in the exceptions for rape, incest and life of the mother. I believe strongly in it. Ronald Reagan did also. 85% of Republicans do. Exceptions. Very important. But we were able to get it. And now states are voting on it. And for the first time you're going to see -- look, this is an issue that's torn our country apart for 52 years. Every legal scholar, every Democrat, every Republican, liberal, conservative, they all wanted this issue to be brought back to the states where the people could vote. And that's what happened, happened. Now, Ohio, the vote was somewhat liberal. [MASK0] the vote was somewhat liberal. Much more liberal than people would have thought. But each individual state is voting. It's the vote of the people now. It's not tied up in the federal government. I did a great service in doing it. It took courage to do it. And the supreme court had great courage in doing it. And I give tremendous credit to those six justices.", "masks": ["Kansas"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Excuse me, I have to respond. Another lie. It's another lie. I have been a leader on IVF which is fertilization. The IVF -- I have been a leader. In fact, when they got a very negative decision on IVF from the [MASK0] courts, I saw the people of [MASK0] and the legislature two days later voted it in. I've been a leader on it. They know that and everybody else knows it. I have been a leader on fertilization, IVF. And the other thing, they -- you should ask, will she allow abortion in the eighth month, ninth month, seventh month?", "masks": ["Alabama"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: And probably after birth. Just look at the governor, former governor of [MASK0]. The governor of [MASK0] said we put the baby aside and then we determine what we want to do with the baby.", "masks": ["Virginia"]}
{"masked_text": "DAVID MUIR: I just want to clarify here, you bring up Springfield, [MASK0]. And ABC News did reach out to the city manager there. He told us there have been no credible reports of specific claims of pets being harmed, injured or abused by individuals within the immigrant community --", "masks": ["Ohio"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: Excuse me. Every one of those cases was started by them against their political opponent. And I'm winning most of them and I'll win the rest on appeal. And you saw that with the decision that came down just recently from the Supreme Court. I'm winning most of them. But those are cases, it's called weaponization. Never happened in this country. They weaponized the justice department. Every one of those cases was involved with the DOJ, from Atlanta and Fani Willis -- to the attorney general of [MASK0] and the D.A. In [MASK0]. Every one of those cases. And then they say oh, he was -- he's a criminal. They're the ones that made them go after me. By the way, Joe Biden was found essentially guilty on the documents case. And what happened in my documents case? They said oh, that's the toughest of them all. A complete and total victory. Two months ago it was thrown out. It's weaponization. And they used it. And it's never happened in this country. They used it to try and win an election. They're fake cases.", "masks": ["New_york"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: So my values have not changed. And I'm going to discuss every one -- at least every point that you've made. But in particular, let's talk about fracking because we're here in [MASK0]. I made that very clear in 2020. I will not ban fracking. I have not banned fracking as Vice President of the United States. And, in fact, I was the tie-breaking vote on the Inflation Reduction Act, which opened new leases for fracking. My position is that we have got to invest in diverse sources of energy so we reduce our reliance on foreign oil. We have had the largest increase in domestic oil production in history because of an approach that recognizes that we cannot over rely on foreign oil. As it relates to my values, let me tell you, I grew up a middle-class kid raised by a hard-working mother who worked and saved and was able to buy our first home when I was a teenager. The values I bring to the importance of home ownership knowing not everybody got handed $400 million on a silver platter and then filed bankruptcy six times, is a value that I bring to my work to say we are going to work with the private sector and home builders to increase 3 million homes, increase by 3 million homes by the end of my first term. My work that is related to having a friend when I was in high school who was sexually assaulted by her stepfather. And my focus then, on protecting women and children from violent crime, is based on a value that is deeply grounded in the importance of standing up for those who are most vulnerable. My work that is about protecting social security and Medicare is based on long-standing work that I have done. Protecting seniors from scams. My values have not changed. And what is important is that there is a president who actually brings values and a perspective that is about lifting people up and not beating people down and name-calling. The true measure of the leader is the leader who actually understands that strength is not in beating people down, it's in lifting people up. I intend to be that president.", "masks": ["Pennsylvania"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: In [MASK0], she went out -- wait a minute. I'm talking now. If you don't mind. Please. Does that sound familiar?", "masks": ["Minnesota"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: She went out -- she went out in [MASK0] and wanted to let criminals that killed people, that burned down Minneapolis, she went out and raised money to get them out of jail. She did things that nobody would ever think of. Now she wants to do transgender operations on illegal aliens that are in prison. This is a radical left liberal that would do this. She wants to confiscate your guns and she will never allow fracking in Pennsylvania. If she won the election, fracking in Pennsylvania will end on day one. Just to finish one thing, so important in my opinion, so, I got the oil business going like nobody has ever done before. They took, when they took over, they got rid of it, started getting rid of it, and the prices were going up the roof. They immediately let these guys go to where they were. I would have been five times, four times, five times higher because you're talking about 3 1/2 years ago. They got it up to where I was because they had no choice. Because the prices of energy were quadrupling and doubling. You saw what happened to gasoline. So, they said let's go back to Trump. But if she won the election, the day after that election, they'll go back to destroying our country and oil will be dead, fossil fuel will be dead. We'll go back to windmills and we'll go back to solar, where they need a whole desert to get some energy to come out. You ever see a solar plant? By the way, I'm a big fan of solar. But they take 400, 500 acres of desert soil--", "masks": ["Minnesota"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: She went out -- she went out in Minnesota and wanted to let criminals that killed people, that burned down Minneapolis, she went out and raised money to get them out of jail. She did things that nobody would ever think of. Now she wants to do transgender operations on illegal aliens that are in prison. This is a radical left liberal that would do this. She wants to confiscate your guns and she will never allow fracking in [MASK0]. If she won the election, fracking in [MASK0] will end on day one. Just to finish one thing, so important in my opinion, so, I got the oil business going like nobody has ever done before. They took, when they took over, they got rid of it, started getting rid of it, and the prices were going up the roof. They immediately let these guys go to where they were. I would have been five times, four times, five times higher because you're talking about 3 1/2 years ago. They got it up to where I was because they had no choice. Because the prices of energy were quadrupling and doubling. You saw what happened to gasoline. So, they said let's go back to Trump. But if she won the election, the day after that election, they'll go back to destroying our country and oil will be dead, fossil fuel will be dead. We'll go back to windmills and we'll go back to solar, where they need a whole desert to get some energy to come out. You ever see a solar plant? By the way, I'm a big fan of solar. But they take 400, 500 acres of desert soil--", "masks": ["Pennsylvania"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: I had nothing to do with that other than they asked me to make a speech. I showed up for a speech. I said, I think it's going to be big. I went to Nancy Pelosi and the mayor of [MASK0], D.C. And the mayor put it back in writing, as you know. I said, you know, this is going to be a very big rally or whatever you want to call it. And again, it wasn't done by me. It was done by others. I said I'd like to give you 10,000 National Guard or soldiers. They rejected me. Nancy Pelosi rejected me. It was just two weeks ago, her daughter has a tape of her saying she is fully responsible for what happened. They want to get rid of that tape. It would have never happened if Nancy Pelosi and the mayor of [MASK0] did their jobs. I wasn't responsible for security. Nancy Pelosi was responsible. She didn't do her job.", "masks": ["Washington"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: I have said blood bash, bath. It was a different term, and it was a term that related to energy, because they have destroyed our energy business. That was where bloodbath was. Also, on Charlottesville, that story has been as you would say, debunked. Laura Ingraham, Sean Hannity, Jesse -- all of these people, they covered it. If they go an extra sentence, they will see it was perfect. It was debunked in almost every newspaper. But they still bring it up just like they bring 2025 up. They bring all of this stuff up. I ask you this. You talk about the Capitol. Why are we allowing these millions of people to come through on the southern border? How come she's not doing -- and I'll tell you what I would do. And I would be very proud to do it. I would say we would both leave this debate right now, I'd like to see her go down to [MASK0], D.C. during this debate 'cause we're wasting a lot of time. Go down to -- because she's been so bad, it's so ridiculous. Go down to [MASK0], D.C. And let her sign a bill to close up the border. Because they have the right to do it. They don't need bills. They have the right to do it. The President of the United States, you'll get him out of bed. You'll wake him up at 4:00 in the afternoon, you'll say come on. Come on down to the office, let's sign a bill. If he ... if he signs a bill that the border is closed, all he has to do is say it to the border patrol, who are phenomenal. If they do that, the border is closed.", "masks": ["Washington"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: They said we didn't have standing. That's the other thing. They said we didn't have standing. A technicality. Can you imagine a system where a person in an election doesn't have standing, the President of the United States doesn't have standing? That's how we lost. If you look at the facts, and I'd love to have you -- you'll do a special on it. I'll show you [MASK0] and I'll show you Wisconsin and I'll show you Pennsylvania and I'll show you -- we have so many facts and statistics. But you know what? That doesn't matter. Because we have to solve the problem that we have right now. That's old news. And the problem that we have right now is we have a nation in decline and they have put it into decline. We have a nation that is dying, David.", "masks": ["Georgia"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: They said we didn't have standing. That's the other thing. They said we didn't have standing. A technicality. Can you imagine a system where a person in an election doesn't have standing, the President of the United States doesn't have standing? That's how we lost. If you look at the facts, and I'd love to have you -- you'll do a special on it. I'll show you Georgia and I'll show you [MASK0] and I'll show you Pennsylvania and I'll show you -- we have so many facts and statistics. But you know what? That doesn't matter. Because we have to solve the problem that we have right now. That's old news. And the problem that we have right now is we have a nation in decline and they have put it into decline. We have a nation that is dying, David.", "masks": ["Wisconsin"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: They said we didn't have standing. That's the other thing. They said we didn't have standing. A technicality. Can you imagine a system where a person in an election doesn't have standing, the President of the United States doesn't have standing? That's how we lost. If you look at the facts, and I'd love to have you -- you'll do a special on it. I'll show you Georgia and I'll show you Wisconsin and I'll show you [MASK0] and I'll show you -- we have so many facts and statistics. But you know what? That doesn't matter. Because we have to solve the problem that we have right now. That's old news. And the problem that we have right now is we have a nation in decline and they have put it into decline. We have a nation that is dying, David.", "masks": ["Pennsylvania"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: Well, first of all, it's important to remind the former president you're not running against Joe Biden, you're running against me. I believe the reason that Donald Trump says that this war would be over within 24 hours is because he would just give it up. And that's not who we are as Americans. Let's understand what happened here. I actually met with Zelenskyy a few days before Russia invaded, tried through force to change territorial boundaries to defy one of the most important international rules and norms, which is the importance of sovereignty and territorial integrity. And I met with President Zelenskyy. I shared with him American intelligence about how he could defend himself. Days later I went to NATO's eastern flank, to Poland and Romania. And through the work that I and others did we brought 50 countries together to support Ukraine in its righteous defense. And because of our support, because of the air defense, the ammunition, the artillery, the javelins, the Abrams tanks that we have provided, Ukraine stands as an independent and free country. If Donald Trump were president, Putin would be sitting in Kyiv right now. And understand what that would mean. Because Putin's agenda is not just about Ukraine. Understand why the European allies and our NATO allies are so thankful that you are no longer president and that we understand the importance of the greatest military alliance the world has ever known, which is NATO. And what we have done to preserve the ability of Zelenskyy and the Ukrainians to fight for their Independence. Otherwise, Putin would be sitting in Kyiv with his eyes on the rest of Europe. Starting with Poland. And why don't you tell the 800,000 Polish Americans right here in [MASK0] how quickly you would give up for the sake of favor and what you think is a friendship with what is known to be a dictator who would eat you for lunch.", "masks": ["Pennsylvania"]}
{"masked_text": "VICE PRESIDENT KAMALA HARRIS: I think it's – I mean honestly, I think it's a tragedy that we have someone who wants to be president who has consistently over the course of his career attempted to use race to divide the American people. You know, I do believe that the vast majority of us know that we have so much more in common than what separates us. And we don't want this kind of approach that is just constantly trying to divide us, and especially by race. And let's remember how Donald Trump started. He was a, a, a—land, he owned land, he owned buildings, and he was investigated because he refused to rent property to Black families. Let's remember, this is the same individual who took out a full-page ad in The [MASK0] Times calling for the execution of five young Black and Latino boys who were innocent, the Central Park Five. Took out a full-page ad calling for their execution. This is the same individual who spread birther lies about the first Black President of the United States. And I think the American people want better than that. Want better than this. Want someone who understands as I do, I travel our country, we see in each other a friend. We see in each other a neighbor. We don't want a leader who is constantly trying to have Americans point their fingers at each other. I meet with people all the time who tell me \"Can we please just have discourse about how we're going to invest in the aspirations and the ambitions and the dreams of the American people?\" Knowing that regardless of people's color or the language their grandmother speaks we all have the same dreams and aspirations and want a president who invests in those, not in hate and division.", "masks": ["New_york"]}
{"masked_text": "PRESIDENT TRUMP: She is destroying our country. She has a plan to defund the police. She has a plan to confiscate everybody's gun. She has a plan to not allow fracking in [MASK0] or anywhere else. That's what her plan is until just recently.", "masks": ["Pennsylvania"]}
{"masked_text": "FORMER PRESIDENT DONALD TRUMP: That didn't happen under Donald Trump. Let me just tell you, they lost 10,000 manufacturing jobs this last month. It's going -- they're all leaving. They're building big auto plants in Mexico. In many cases owned by China. They're building these massive plants, and they think they're going to sell their cars into the United States because of these people. What they have given to China is unbelievable. But we're not going to let that. We'll put tariffs on those cars so they can't come into our country. Because they will kill the United Auto Workers and any auto worker, whether it's in Detroit or [MASK0] or any other place. What they've done to business and manufacturing in this country is horrible. We have nothing because they refuse -- you know, Biden doesn't go after people because supposedly China paid him millions of dollars. He's afraid to do it. Between him and his son. They get all this money from Ukraine. They get all this money from all of these different countries. And then you wonder why is he so loyal to this one, that one Ukraine, China? Why is he? Why did he get 3 1/2 million dollars from the mayor of Moscow's wife? Why did he get -- why did she pay him 3 1/2 million dollars? This is a crooked administration, and they're selling our country down the tubes.", "masks": ["South_carolina"]}
