{"masked_text": "Harris selected Tim Walz, the governor of [MASK0], as her running mate.", "masks": ["Minnesota"]}
{"masked_text": "Trump was nominated during the 2024 Republican National Convention along with his running mate, [MASK0] senator JD Vance.", "masks": ["Ohio"]}
{"masked_text": "Key swing states for the presidential election include [MASK0], [MASK1], [MASK2], [MASK3], [MASK4], [MASK5], and [MASK6].", "masks": ["Arizona", "Georgia", "Michigan", "Nevada", "North_carolina", "Pennsylvania", "Wisconsin"]}
{"masked_text": "The [MASK0] Supreme Court, a state Circuit Court in [MASK1], and the Secretary of State of [MASK2] ruled that Trump is ineligible to hold office under Section 3 of the Fourteenth Amendment to the United States Constitution for his role in the January 6 Capitol attack, and as such, attempted to disqualify him from appearing on the ballot.", "masks": ["Colorado", "Illinois", "Maine"]}
{"masked_text": "The [MASK0] Times has reported that \"the Republican Party and its conservative allies are engaged in an unprecedented legal campaign targeting the American voting system\", by restricting voting for partisan advantage ahead of Election Day and preparing to mount \"legally dubious\"", "masks": ["New_york"]}
{"masked_text": "As early as April 1, 2024, The [MASK0] Times reported that the Chinese government had created fake pro-Trump accounts on social media \"promoting conspiracy theories, stoking domestic divisions and attacking President Biden ahead of the election in November.\"", "masks": ["New_york"]}
{"masked_text": "The [MASK0] Times stated the efforts were an attempt at \"sowing internal discord and discrediting the democratic system in the United States more broadly in the eyes of the world.\"", "masks": ["New_york"]}
{"masked_text": "On May 30, Trump was found guilty by a jury of all 34 felony counts in The People of the State of [MASK0] v.", "masks": ["New_york"]}
{"masked_text": "Donald J. Trump for his alleged role in attempting to overturn the 2020 United States presidential election and involvement in the January 6 United States Capitol attack; 10 counts in The State of [MASK0] v.", "masks": ["Georgia"]}
{"masked_text": "for his alleged attempts to overturn the results of the 2020 United States presidential election in [MASK0]; 40 counts in United States of America v.", "masks": ["Georgia"]}
{"masked_text": "According to an April 2024 Reuters/Ipsos poll, the percentage of registered voters who found Trump's charges somewhat to very serious in the federal elections case was 74%, 72% in the [MASK0] case, 69% in the classified documents case, and 64% in the [MASK1] hush money case.", "masks": ["Georgia", "New_york"]}
{"masked_text": "Thus, Trump's sentencing date for his convictions in [MASK0] was delayed from July to September 2024, and then to November 26, and the trial dates in Trump's other cases will likely be delayed as well, to review the applicability of the Supreme Court's decision.", "masks": ["New_york"]}
{"masked_text": "According to another 2024 poll, most of those who voted for Biden in 2020 said they believed he was too old to be an effective president; The [MASK0] Times noted that these concerns \"cut across generations, gender, race and education\".", "masks": ["New_york"]}
{"masked_text": "The [MASK0] Times and Los Angeles Times editorial boards also declared Trump unfit to lead, pointing to what former Trump officials \"have described as his systematic dishonesty, corruption, cruelty and incompetence.\"", "masks": ["New_york"]}
{"masked_text": "On July 13, 2024, Trump survived an assassination attempt while addressing a campaign rally near Butler, [MASK0].", "masks": ["Pennsylvania"]}
{"masked_text": "Trump was shot and wounded on his right ear by Thomas Matthew Crooks, a 20-year-old man from Bethel Park, [MASK0], who fired eight rounds with an AR-15–style rifle from the roof of a building located approximately 400 feet (120 meters) from the stage; the shots killed audience member Corey Comperatore and critically injured two other audience members.", "masks": ["Pennsylvania"]}
{"masked_text": "These are the Rust Belt states of [MASK0], [MASK1], and [MASK2]; and the Sun Belt states of [MASK3], [MASK4], [MASK5], and [MASK6].", "masks": ["Wisconsin", "Michigan", "Pennsylvania", "Arizona", "Georgia", "Nevada", "North_carolina"]}
{"masked_text": "Due to gradual demographic shifts, some former swing states such as [MASK0], [MASK1], and [MASK2] have shifted significantly towards the Republicans, while [MASK3], [MASK4], and [MASK5] have moved towards the Democrats.", "masks": ["Iowa", "Ohio", "Florida", "Colorado", "New_mexico", "Oregon"]}
{"masked_text": "The [MASK0] Post described Trump's campaign as focusing on \"dark and apocalyptic\"", "masks": ["Washington"]}
{"masked_text": "Abortion will be on the ballot in up to ten states in 2024, including the swing states of [MASK0] and [MASK1].", "masks": ["Arizona", "Nevada"]}
{"masked_text": "In his home state of [MASK0], Trump said that he would vote No on Amendment 4, an abortion rights referendum, preserving the six-week ban.", "masks": ["Florida"]}
{"masked_text": " The [MASK0] Times reported that Trump is considering \"an extreme expansion of his first-term crackdown on immigration,\"", "masks": ["New_york"]}
{"masked_text": "The [MASK0] Times reports that both candidates \"embraced a vision of a powerful federal government, using its muscle to intervene in markets in pursuit of a stronger and more prosperous economy.\"", "masks": ["New_york"]}
{"masked_text": "The [MASK0] Times described Harris' economic policy as embracing \"the idea that the federal government must act aggressively to foster competition and correct distortions in private markets.\"", "masks": ["New_york"]}
{"masked_text": "The [MASK0] Post reported in January 2024 that Trump was preparing for a massive trade war.", "masks": ["Washington"]}
{"masked_text": "[MASK0] Governor Ron DeSantis was seen as the main challenger to Trump for the Republican nomination; he raised more campaign funds in the first half of 2022 and had more favorable polling numbers than Trump by the end of 2022.", "masks": ["Florida"]}
{"masked_text": "Following the [MASK0] caucuses, in which Trump posted a landslide victory, DeSantis and businessman Vivek Ramaswamy dropped out of the race and endorsed Trump, leaving the former president and Nikki Haley, the former [MASK1] governor who served in Trump's cabinet, as the only remaining major candidates.", "masks": ["Iowa", "South_carolina"]}
{"masked_text": "On July 15, 2024, the first day of the Republican National Convention, Trump officially announced that Senator JD Vance of [MASK0] would be his running mate.", "masks": ["Ohio"]}
{"masked_text": "Oliver was the party's candidate in the 2022 United States Senate election in [MASK0].", "masks": ["Georgia"]}
