{"masked_text": "The incumbent president, [MASK0], a member of the Democratic Party, initially ran for re-election and became the party's presumptive nominee, facing little opposition.", "masks": ["Biden"]}
{"masked_text": "However, [MASK0]'s performance in the June 2024 presidential debate intensified concerns about his age and health, and led to calls within his party for him to leave the race.", "masks": ["Biden"]}
{"masked_text": "Although initially adamant that he would remain in the race, [MASK0] ultimately withdrew on July 21 and endorsed Vice President Harris, who became the party's nominee on August 5.", "masks": ["Biden"]}
{"masked_text": "Although initially adamant that he would remain in the race, Biden ultimately withdrew on July 21 and endorsed [MASK0], who became the party's nominee on August 5.", "masks": ["Harris"]}
{"masked_text": "[MASK0] selected Walz, the governor of Minnesota, as her running mate.", "masks": ["Harris"]}
{"masked_text": "Harris selected [MASK0], the governor of Minnesota, as her running mate.", "masks": ["Walz"]}
{"masked_text": "[MASK0]'s withdrawal makes him the first eligible incumbent president since Lyndon B. Johnson in 1968 not to run for re-election, and the first to withdraw after securing enough delegates to win the nomination.", "masks": ["Biden"]}
{"masked_text": "[MASK0] is the first nominee who did not participate in the primaries since Hubert Humphrey, also in 1968.", "masks": ["Harris"]}
{"masked_text": "[MASK0]'s predecessor, Trump, a member of the Republican Party, is running for re-election for a second, non-consecutive term, after losing to [MASK0] in 2020.", "masks": ["Biden"]}
{"masked_text": "Biden's predecessor, [MASK0], a member of the Republican Party, is running for re-election for a second, non-consecutive term, after losing to Biden in 2020.", "masks": ["Trump"]}
{"masked_text": "Although more than a dozen candidates sought the nomination, only [MASK0] and four others made it to the primaries.", "masks": ["Trump"]}
{"masked_text": "Other than [MASK0], only Nikki Haley managed to gather any significant support during the Republican primaries.", "masks": ["Trump"]}
{"masked_text": "[MASK0] was nominated during the 2024 Republican National Convention along with his running mate, Ohio senator Vance.", "masks": ["Trump"]}
{"masked_text": "Trump was nominated during the 2024 Republican National Convention along with his running mate, Ohio senator [MASK0].", "masks": ["Vance"]}
{"masked_text": "[MASK0]'s campaign has been criticized by legal experts, historians, and political scientists for invoking violent rhetoric and authoritarian statements.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has made large numbers of false and misleading statements, promoted conspiracy theories, and has continued to repeat false claims that the 2020 election was rigged and stolen from him, which prompted the January 6 Capitol attack.", "masks": ["Trump"]}
{"masked_text": " In 2023 and 2024, [MASK0] was found liable and guilty in civil and criminal proceedings, respectively, for sexual abuse, defamation, financial fraud, and falsifying business records, becoming the first former president to be convicted of a crime.", "masks": ["Trump"]}
{"masked_text": "Numerous election offices are dealing with an increase in retirements and public record demands, owing in part to the electoral mistrust planted by former [MASK0]'s loss in the 2020 election.", "masks": ["Trump"]}
{"masked_text": "[MASK0] is the first president in American history to be impeached twice, and the first to run again after impeachment.", "masks": ["Trump"]}
{"masked_text": "[MASK0] was first impeached by the Democratic-controlled House of Representatives in December 2019 for abuse of power and obstruction of Congress due to his attempts to coerce Ukraine to provide damaging information on Biden and misinformation regarding Russian interference in the 2016 United States elections by withholding military aid.", "masks": ["Trump"]}
{"masked_text": "Trump was first impeached by the Democratic-controlled House of Representatives in December 2019 for abuse of power and obstruction of Congress due to his attempts to coerce Ukraine to provide damaging information on [MASK0] and misinformation regarding Russian interference in the 2016 United States elections by withholding military aid.", "masks": ["Biden"]}
{"masked_text": "[MASK0]'s second impeachment by the House occurred on January 13, 2021, for \"incitement of insurrection\"", "masks": ["Trump"]}
{"masked_text": "As [MASK0] was acquitted by the Senate in both cases, [MASK0] is not barred from seeking reelection to the presidency in 2024.", "masks": ["Trump"]}
{"masked_text": "The Colorado Supreme Court, a state Circuit Court in Illinois, and the Secretary of State of Maine ruled that [MASK0] is ineligible to hold office under Section 3 of the Fourteenth Amendment to the United States Constitution for his role in the January 6 Capitol attack, and as such, attempted to disqualify him from appearing on the ballot.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has made false claims of voter fraud in the 2020 presidential election, and has continued denying the election results as of August 2024.", "masks": ["Trump"]}
{"masked_text": "by immigrants, in an attempt to delegitimize the election in the event of a [MASK0] defeat.", "masks": ["Trump"]}
{"masked_text": "[MASK0] and several Republicans have stated they will not accept the results of the 2024 election if they believe they are \"unfair.\"", "masks": ["Trump"]}
{"masked_text": "of his presidency and not after, his promise to use the Justice Department to go after his political enemies, his plan to use the Insurrection Act of 1807 to deploy the military in Democratic cities and states, attempts to overturn the 2020 United States presidential election, continued Republican efforts to restrict voting following the 2020 presidential election, [MASK0]'s baseless predictions of voter fraud in the 2024 election, and [MASK0]'s public embrace and celebration of the January 6 United States Capitol attack, have raised concerns over the state of democracy in America.", "masks": ["Trump"]}
{"masked_text": "[MASK0]'s political operation said that it plans to deploy more than 100,000 attorneys and volunteers to polling places across battleground states, with an \"election integrity hotline\"", "masks": ["Trump"]}
{"masked_text": "As early as April 1, 2024, The New York Times reported that the Chinese government had created fake pro-[MASK0] accounts on social media \"promoting conspiracy theories, stoking domestic divisions and attacking President Biden ahead of the election in November.\"", "masks": ["Trump"]}
{"masked_text": "As early as April 1, 2024, The New York Times reported that the Chinese government had created fake pro-Trump accounts on social media \"promoting conspiracy theories, stoking domestic divisions and attacking [MASK0] ahead of the election in November.\"", "masks": ["Biden"]}
{"masked_text": "According to disinformation experts and intelligence agencies, Russia spread disinformation ahead of the 2024 election to damage [MASK0] and Democrats, boost candidates supporting isolationism, and undercut support for Ukraine aid and NATO. On September 4, 2024, the United States publicly accused Russia of interfering in the 2024 election and announced several steps to combat Russian influence including sanctions, indictments, and seizing of web domains used to spread propaganda and disinformation.", "masks": ["Biden"]}
{"masked_text": "American intelligence agencies have assessed that Russia prefers [MASK0] to win the election, viewing him as more critical of U.S. support for Ukraine.", "masks": ["Trump"]}
{"masked_text": "Iran has been identified as interfering with the 2024 presidential election through front companies connected to the Islamic Revolutionary Guard Corps through hacking attempts against the [MASK0], Biden, and Harris campaigns starting as early as May 2024.", "masks": ["Trump"]}
{"masked_text": "Iran has been identified as interfering with the 2024 presidential election through front companies connected to the Islamic Revolutionary Guard Corps through hacking attempts against the Trump, [MASK0], and Harris campaigns starting as early as May 2024.", "masks": ["Biden"]}
{"masked_text": "Iran has been identified as interfering with the 2024 presidential election through front companies connected to the Islamic Revolutionary Guard Corps through hacking attempts against the Trump, Biden, and [MASK0] campaigns starting as early as May 2024.", "masks": ["Harris"]}
{"masked_text": "Iran has launched propaganda and disinformation campaigns through fake news websites and accounts on social media to tip the election against former president [MASK0], although it has also targeted both Biden and Harris.", "masks": ["Trump"]}
{"masked_text": "Iran has launched propaganda and disinformation campaigns through fake news websites and accounts on social media to tip the election against former president Trump, although it has also targeted both [MASK0] and Harris.", "masks": ["Biden"]}
{"masked_text": "Iran has launched propaganda and disinformation campaigns through fake news websites and accounts on social media to tip the election against former president Trump, although it has also targeted both Biden and [MASK0].", "masks": ["Harris"]}
{"masked_text": "[MASK0] has been found liable in civil proceedings for both sexual abuse and defamation in 2023 and defamation in 2024, while also being criminally convicted of 34 felonies related to falsifying business records, expected to be an issue during the campaign.", "masks": ["Trump"]}
{"masked_text": "He has four criminal indictments totaling 91 felony counts and there are other lawsuits against [MASK0].", "masks": ["Trump"]}
{"masked_text": "On May 30, [MASK0] was found guilty by a jury of all 34 felony counts in The People of the State of New York v.", "masks": ["Trump"]}
{"masked_text": "Donald J. [MASK0] over falsifying business records for hush money payments to adult film star Stormy Daniels, to ensure her silence about a sexual encounter between them, to influence the 2016 presidential election.", "masks": ["Trump"]}
{"masked_text": "This makes [MASK0] the first former U.S. president to be convicted of a crime in American history.", "masks": ["Trump"]}
{"masked_text": "[MASK0] and many Republicans have made numerous false and misleading statements regarding [MASK0]'s criminal trials, including false claims that they are \"rigged\"", "masks": ["Trump"]}
{"masked_text": "orchestrated by [MASK0] and the Democratic Party, of which there is no evidence.", "masks": ["Biden"]}
{"masked_text": "[MASK0] faces an additional 57 felony counts; four counts in a United States of America v.", "masks": ["Trump"]}
{"masked_text": "Donald J. [MASK0] for his alleged role in attempting to overturn the 2020 United States presidential election and involvement in the January 6 United States Capitol attack; 10 counts in The State of Georgia v.", "masks": ["Trump"]}
{"masked_text": "Donald J. [MASK0], Waltine Nauta, and Carlos De Oliveira relating to his hoarding of classified documents and alleged obstruction of efforts to retrieve them.", "masks": ["Trump"]}
{"masked_text": "In addition to his indictments, on May 9, 2023, [MASK0] was found liable by an anonymous jury for sexual abuse in E. Jean Carroll v.", "masks": ["Trump"]}
{"masked_text": "Donald J. [MASK0] and ordered to pay a total of $88.3 million combined for damages and defamation.", "masks": ["Trump"]}
{"masked_text": "In September 2023, [MASK0] was found guilty of financial fraud and ordered to pay a $457 million judgement currently on appeal.", "masks": ["Trump"]}
{"masked_text": "According to an April 2024 Reuters/Ipsos poll, the percentage of registered voters who found [MASK0]'s charges somewhat to very serious in the federal elections case was 74%, 72% in the Georgia case, 69% in the classified documents case, and 64% in the New York hush money case.", "masks": ["Trump"]}
{"masked_text": "Nearly a quarter of Republican voters said they would not vote for [MASK0] if found guilty of a felony by a jury.", "masks": ["Trump"]}
{"masked_text": "Following his hush money conviction, 15% of likely Republican voters and 49% of independents stated they wanted [MASK0] to drop out, and 54% of registered voters approved of the jury's decision.", "masks": ["Trump"]}
{"masked_text": "Polling also found 56% of Republicans who were unchanged by the verdict, and 35% of Republicans and 18% of independents who stated they were more likely to vote for [MASK0].", "masks": ["Trump"]}
{"masked_text": "[MASK0] has been noted for attempting to delay his trials until after the November election.", "masks": ["Trump"]}
{"masked_text": "If [MASK0] wins the election in November, then on January 20, 2025, [MASK0] could order a new attorney general to dismiss the federal charges he is facing, prevent the state charges from taking affect through a variety of methods, and issue a presidential self-pardon.", "masks": ["Trump"]}
{"masked_text": "On July 1, 2024, the US Supreme Court delivered its 6–3 decision in [MASK0] v.", "masks": ["Trump"]}
{"masked_text": "United States, along ideological lines, ruling that [MASK0] had absolute immunity for acts he committed as president within his core constitutional purview, at least presumptive immunity for official acts within the outer perimeter of his official responsibility, and no immunity for unofficial acts.", "masks": ["Trump"]}
{"masked_text": "Thus, [MASK0]'s sentencing date for his convictions in New York was delayed from July to September 2024, and then to November 26, and the trial dates in [MASK0]'s other cases will likely be delayed as well, to review the applicability of the Supreme Court's decision.", "masks": ["Trump"]}
{"masked_text": "Former Republican president [MASK0] and mass media raised concerns about President Biden's age, including his cognitive state, during and after the 2020 United States presidential election.", "masks": ["Trump"]}
{"masked_text": "Former Republican president Trump and mass media raised concerns about [MASK0]'s age, including his cognitive state, during and after the 2020 United States presidential election.", "masks": ["Biden"]}
{"masked_text": "These concerns increased after a poor performance by [MASK0] during a debate against Trump in the 2024 presidential election, which led a number of commentators and some Democratic lawmakers to call for [MASK0] to drop out of the 2024 presidential race.", "masks": ["Biden"]}
{"masked_text": "These concerns increased after a poor performance by Biden during a debate against [MASK0] in the 2024 presidential election, which led a number of commentators and some Democratic lawmakers to call for Biden to drop out of the 2024 presidential race.", "masks": ["Trump"]}
{"masked_text": "According to a February 2024 poll, [MASK0]'s age and health were major or moderate concerns for 86% of voters generally, up from 76% earlier in 2020.", "masks": ["Biden"]}
{"masked_text": "According to another 2024 poll, most of those who voted for [MASK0] in 2020 said they believed he was too old to be an effective president; The New York Times noted that these concerns \"cut across generations, gender, race and education\".", "masks": ["Biden"]}
{"masked_text": "According to polling released in July and August, a majority of voters polled after the first debate think [MASK0] is too old to serve a second term (51%, 57%, and 60%), with 80% unsure he would be able to finish out a second term.", "masks": ["Trump"]}
{"masked_text": "During and after [MASK0]'s presidency, comments on his age, weight, lifestyle and history of heart disease have raised questions about his physical health.", "masks": ["Trump"]}
{"masked_text": "In addition, numerous public figures, media sources, and mental health professionals have speculated that [MASK0] may have some form of dementia, which runs in his family.", "masks": ["Trump"]}
{"masked_text": "Experts for the science publication STAT who analyzed changes in [MASK0]'s speeches between 2015 and 2024 noted shorter sentences, more tangents, more repetition and more confusion of words and phrases.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has also been criticized for his lack of transparency around his medical records and health.", "masks": ["Trump"]}
{"masked_text": "The New York Times and Los Angeles Times editorial boards also declared [MASK0] unfit to lead, pointing to what former [MASK0] officials \"have described as his systematic dishonesty, corruption, cruelty and incompetence.\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] has also been criticized for his hiring decisions, and noted for his unusual criminal record.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has increasingly embraced extremism, conspiracy theories such as Q-Anon, and far-right militia movements to a greater extent than any modern American president.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has espoused dehumanizing, combative, and violent rhetoric and promised retribution against his political enemies.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has played down but refused to rule out violence following the 2024 election, stating \"it depends\".", "masks": ["Trump"]}
{"masked_text": "On July 13, 2024, [MASK0] survived an assassination attempt while addressing a campaign rally near Butler, Pennsylvania.", "masks": ["Trump"]}
{"masked_text": "[MASK0] was shot and wounded on his right ear by Thomas Matthew Crooks, a 20-year-old man from Bethel Park, Pennsylvania, who fired eight rounds with an AR-15–style rifle from the roof of a building located approximately 400 feet (120 meters) from the stage; the shots killed audience member Corey Comperatore and critically injured two other audience members.", "masks": ["Trump"]}
{"masked_text": "If the state results of 2020 were to stay the same in 2024, which has never occurred before, Democrats would have 303 electoral votes against the Republicans' 235, a slight change from [MASK0]'s 306 and Trump's 232, meaning Democrats lost a net 3 electoral votes to reapportionment.", "masks": ["Biden"]}
{"masked_text": "If the state results of 2020 were to stay the same in 2024, which has never occurred before, Democrats would have 303 electoral votes against the Republicans' 235, a slight change from Biden's 306 and [MASK0]'s 232, meaning Democrats lost a net 3 electoral votes to reapportionment.", "masks": ["Trump"]}
{"masked_text": "The acceleration of this trend has been credited with tipping the 2020 presidential election in favor of Democrat [MASK0], because the incumbent Trump was historically unpopular in the suburbs for a Republican candidate, underperforming there.", "masks": ["Biden"]}
{"masked_text": "The acceleration of this trend has been credited with tipping the 2020 presidential election in favor of Democrat Biden, because the incumbent [MASK0] was historically unpopular in the suburbs for a Republican candidate, underperforming there.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has framed her campaign as \"a choice between freedom and chaos\"", "masks": ["Harris"]}
{"masked_text": "The [MASK0] campaign has sought to highlight her experience as an attorney general and a prosecutor to \"prosecute the case\"", "masks": ["Harris"]}
{"masked_text": "[MASK0] is running as a moderate Democrat and has moderated several of her policy positions since her 2019 run, with many of her domestic policy stances now expected to resemble Biden's.", "masks": ["Harris"]}
{"masked_text": "Harris is running as a moderate Democrat and has moderated several of her policy positions since her 2019 run, with many of her domestic policy stances now expected to resemble [MASK0]'s.", "masks": ["Biden"]}
{"masked_text": "[MASK0]'s stances will also have a particular focus on reproductive healthcare, criminal justice, and civil rights issues.", "masks": ["Harris"]}
{"masked_text": "[MASK0]' campaign has been noted for having an optimistic and joyful tone.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has won over voters with an optimistic message, but has been criticized for her vague optimism rather than concrete policies.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has responded by adding a policy page on a range of topics, from labor unions to cost-of-living issues to health care, to her campaign website.", "masks": ["Harris"]}
{"masked_text": "A central campaign theme for [MASK0]'s second presidential bid is \"retribution\".", "masks": ["Trump"]}
{"masked_text": "[MASK0] announced the theme during his March 2023 speech at the Conservative Political Action Conference (CPAC), stating \"In 2016, I declared, 'I am your voice.' Today, I add: I am your warrior.", "masks": ["Trump"]}
{"masked_text": "[MASK0] is heavily running on immigration as a central campaign focus.", "masks": ["Trump"]}
{"masked_text": "The Washington Post described [MASK0]'s campaign as focusing on \"dark and apocalyptic\"", "masks": ["Trump"]}
{"masked_text": "The Associated Press states that \"[MASK0]'s rallies take on the symbols, rhetoric and agenda of Christian nationalism.\"", "masks": ["Trump"]}
{"masked_text": " During his 2024 presidential campaign, [MASK0] has made numerous false and misleading statements.", "masks": ["Trump"]}
{"masked_text": "The large number of lies and false statements have been attributed to [MASK0]'s rhetorical style described as using the big lie and firehose of falsehood propaganda technique.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has also made many personal attacks against Harris, several of which are sexual in nature, viewed as racist and misogynistic, and considered a continued breaking of norms regarding political speech.", "masks": ["Trump"]}
{"masked_text": "Trump has also made many personal attacks against [MASK0], several of which are sexual in nature, viewed as racist and misogynistic, and considered a continued breaking of norms regarding political speech.", "masks": ["Harris"]}
{"masked_text": "The three justices appointed by former president [MASK0]—Amy Coney Barrett, Brett Kavanaugh, and Neil Gorsuch—all voted to overturn the federal right to an abortion in Dobbs.", "masks": ["Trump"]}
{"masked_text": "Some pundits have argued abortion rights referenda could help [MASK0] in November.", "masks": ["Harris"]}
{"masked_text": " Since becoming the presumptive nominee, [MASK0] has indicated her support for passing legislation which would restore the federal abortion right protections previously guaranteed by Roe.", "masks": ["Harris"]}
{"masked_text": "She argued [MASK0] would let his anti-abortion allies implement Project 2025 proposals to restrict abortion and contraception throughout the US.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has claimed credit for overturning Roe, but criticized Republicans pushing for total abortion bans.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has said he will leave the issue of abortion for the states to decide, but would allow red states to monitor women's pregnancies and prosecute them if they have an abortion.", "masks": ["Trump"]}
{"masked_text": "In his home state of Florida, [MASK0] said that he would vote No on Amendment 4, an abortion rights referendum, preserving the six-week ban.", "masks": ["Trump"]}
{"masked_text": "By June 2024, illegal crossings reached a three-year low following four consecutive monthly drops, which senior officials attributed to increased enforcement between the US and Mexico, the weather, and [MASK0]'s executive order increasing asylum restrictions.", "masks": ["Biden"]}
{"masked_text": "By July 2024, border arrests dropped 33% to a 46-month low as a result of [MASK0]'s executive action after it previously dropped by 55% in June, bringing it to its lowest level since September 2020.", "masks": ["Biden"]}
{"masked_text": "[MASK0] has highlighted her work in combating transnational gangs, drug cartels, and human traffickers while attorney general.", "masks": ["Harris"]}
{"masked_text": "In 2023, as vice president, [MASK0] announced pledges of US$950 million from private companies into Central American communities to address the causes of mass migration, such as poverty.", "masks": ["Harris"]}
{"masked_text": "[MASK0] supports increasing the number of Border Patrol agents and accuses Trump as being unserious on border security.", "masks": ["Harris"]}
{"masked_text": "Harris supports increasing the number of Border Patrol agents and accuses [MASK0] as being unserious on border security.", "masks": ["Trump"]}
{"masked_text": "While vice president, [MASK0] supported a bipartisan bill which would have funded additional border agents and closed the border if too crowded, the bill was rejected by Trump.", "masks": ["Harris"]}
{"masked_text": "While vice president, Harris supported a bipartisan bill which would have funded additional border agents and closed the border if too crowded, the bill was rejected by [MASK0].", "masks": ["Trump"]}
{"masked_text": "[MASK0] called on House and Senate Republicans to kill the bill arguing it would hurt his and Republican's reelection campaigns and deny them the ability to run on immigration as a campaign issue.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has criticized Trump for his opposition to the bill on the campaign trail, and has promised to sign the bill into law as president.", "masks": ["Harris"]}
{"masked_text": "Harris has criticized [MASK0] for his opposition to the bill on the campaign trail, and has promised to sign the bill into law as president.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has stated that if elected, he would increase deportations, send the U.S. military to the border, expand ICE detentions through workplace raids, deputize local law enforcement to handle border security, increase Customs and Border Patrol funding as well as finish building the wall on the southern border.", "masks": ["Trump"]}
{"masked_text": " The New York Times reported that [MASK0] is considering \"an extreme expansion of his first-term crackdown on immigration,\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] has stated his intention to deport 11 million people through the construction of detention camps and using the military.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has made false claims of a \"migrant crime wave\"", "masks": ["Trump"]}
{"masked_text": "[MASK0]'s anti-immigration tone is noted to have grown harsher from his previous time as president, and drawn criticism for using more dehumanizing rhetoric when referring to illegal immigrants.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has called some immigrants \"not human\", \"not people\", and \"animals\".", "masks": ["Trump"]}
{"masked_text": "Since fall 2023, [MASK0] has claimed that immigrants are \"poisoning the blood of our country,\"", "masks": ["Trump"]}
{"masked_text": "[MASK0]'s comments come as part of violent, dehumanizing rhetoric [MASK0] has increasingly utilized during his campaign.", "masks": ["Trump"]}
{"masked_text": "In 2023, the United States saw a record in crude oil production with over 13.2 million barrels of crude per day beating the 13 million barrels per day produced at the peak of [MASK0]'s presidency.", "masks": ["Trump"]}
{"masked_text": "[MASK0] is an advocate for environmental justice to address the impact of climate change on lower-income areas and people of color.", "masks": ["Harris"]}
{"masked_text": "[MASK0] helped pass the Inflation Reduction Act, the largest investment in addressing climate change and clean energy in US history putting the US on track to meet emissions reduction targets by 50–52% below 2005 levels by 2030.", "masks": ["Harris"]}
{"masked_text": "[MASK0]'s campaign has stated that she does not support a ban on fracking.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has ridiculed the idea of man-made climate change and repeatedly referred to his energy policy under the mantra \"drill, baby, drill.\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] says he will increase oil drilling on public lands and offer tax breaks to oil, gas, and coal producers.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has stated his goal for the U.S. to have the lowest cost of electricity and energy of any country in the world.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has promised to roll back electric vehicle initiatives, proposed once again leaving the Paris Climate Accords, and rescinding several environmental regulations.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has stated his intention to roll back parts of the 2022 Inflation Reduction Act.", "masks": ["Trump"]}
{"masked_text": "Some Republicans are concerned that [MASK0]'s former impeachment and four criminal indictments are attempts to influence the election and keep him from office.", "masks": ["Trump"]}
{"masked_text": "However, there is no evidence that [MASK0]'s criminal trials are \"election interference\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] has repeated false claims that the 2020 election was rigged and stolen from him.", "masks": ["Trump"]}
{"masked_text": "[MASK0]'s 2024 campaign has been criticized by legal experts, historians, and political scientists for making increasingly violent and authoritarian statements, which some believe the [MASK0] campaign is intentionally leaning into.", "masks": ["Trump"]}
{"masked_text": "[MASK0]'s platform calls for the vast expansion of presidential powers and the executive branch over every part of the federal government.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has called for stripping employment protections for thousands of career civil service employees and replacing them with political loyalists if deemed an \"obstacle to his agenda\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] has repeatedly stated his intention to have the Justice Department investigate and arrest his domestic political rivals, judges, prosecutors, and witnesses involved in his criminal trials.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has previously tried to prosecute his political rivals and would have fewer checks on his power in a second term.", "masks": ["Trump"]}
{"masked_text": "The document was written in part by former members of the [MASK0] administration such as Russell Vought, and John McEntee while [MASK0] stated he is unfamiliar with parts of the plan.", "masks": ["Trump"]}
{"masked_text": "[MASK0]'s campaign has been noted for using increasingly dehumanizing and violent rhetoric against his political enemies.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has promised to pardon those charged for their involvement in the January 6, 2021, Capitol attack and has called those charged \"hostages\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] has played down but not ruled out violence after the 2024 election if he does not win, stating, \"it depends.\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] was tasked by Biden with protecting democracy through voting rights legislation through her work on the For the People Act.", "masks": ["Harris"]}
{"masked_text": "Harris was tasked by [MASK0] with protecting democracy through voting rights legislation through her work on the For the People Act.", "masks": ["Biden"]}
{"masked_text": "[MASK0] has supported efforts to defend election workers and counter Republican efforts to restrict voting following the 2020 presidential election.", "masks": ["Harris"]}
{"masked_text": "[MASK0] previously supported the George Floyd Justice in Policing Act.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has supported demilitarizing police departments, and has pushed back against calls to defund the police.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated her support to pass the Freedom to Vote Act and John Lewis Rights Voting Rights Advancement Act if elected.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has promised to address price gouging, bring down costs, ban hidden fees and late charges from financial institutions, limit \"unfair\"", "masks": ["Harris"]}
{"masked_text": "The New York Times described [MASK0]' economic policy as embracing \"the idea that the federal government must act aggressively to foster competition and correct distortions in private markets.\"", "masks": ["Harris"]}
{"masked_text": "[MASK0] has proposed raising taxes on corporations and high-earners to fund services for the lower and middle classes and reduce the deficit.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated she supports increasing the top tier capital gains tax rate to 28%, up from 20% and lower than Biden's proposed 39.6%.", "masks": ["Harris"]}
{"masked_text": "Harris has stated she supports increasing the top tier capital gains tax rate to 28%, up from 20% and lower than [MASK0]'s proposed 39.6%.", "masks": ["Biden"]}
{"masked_text": "[MASK0] has stated her support for a Billionaire Minimum Income Tax, increasing the tax on stock buybacks to 4%, and a ten-fold tax reduction for small business ranging from $5,000 to $50,000 in relief.", "masks": ["Harris"]}
{"masked_text": "[MASK0] also supports efforts to create a tax on unrealized gains for those with more than a $100 million in net worth if they do not pay a minimum 25% tax rate on their income inclusive of unrealized gains so long as 80% of said wealth is in tradeable assets.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has also announced support for restoring the corporate tax rate to 28% among several other tax proposals to raise taxes and close loopholes for corporations and the wealthy that would bring in $5 trillion in additional revenue over 10 years.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has also proposed tax breaks to companies delivering economic benefit, such as manufacturing technologies to fight global warming and building affordable housing.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has proposed a ban on corporate price gouging to \"help the food industry become more competitive.\"", "masks": ["Harris"]}
{"masked_text": "[MASK0] has also expressed support for student debt relief, and [MASK0] says she supports raising the minimum wage.", "masks": ["Harris"]}
{"masked_text": "[MASK0] says she will increase home construction to reduce housing costs, arguing that it negatively impacts the economy and hurts working-class families.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has proposed directing $40 billion to construction companies to build starter homes.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has promised to send $25,000 in down-payment assistance to every first time home buyer.", "masks": ["Harris"]}
{"masked_text": "[MASK0] says she will urge Congress to enforce fair housing laws and pass a bill to bar property owners from using services that \"coordinate\"", "masks": ["Harris"]}
{"masked_text": "[MASK0] has proposed further individual and corporate tax cuts beyond his prior 2017 tax cuts.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has argued that keeping taxes low for the wealthy increases job creation, and that these policies coupled with a crackdown in illegal immigration and reduction in inflation will help the middle class.", "masks": ["Trump"]}
{"masked_text": "[MASK0] says he will reduce regulation of business through the creation of an efficiency commission led by Elon Musk, along with reducing environmental regulation.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has said deporting millions of immigrants will bring housing prices down.", "masks": ["Trump"]}
{"masked_text": "And his competitor, [MASK0], has echoed support for the proposal.", "masks": ["Harris"]}
{"masked_text": "[MASK0]'s stated trade policy involves the United States decoupling from the global economy and having the country become more self-contained and exerting its power through individual trade dealings.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has called for 100% tariffs on cars made outside the U.S. and a minimum 60% tariff on Chinese goods.", "masks": ["Trump"]}
{"masked_text": "[MASK0] stated his plans to urge Congress to pass a \"[MASK0] Reciprocal Trade Act\"", "masks": ["Trump"]}
{"masked_text": "The Washington Post reported in January 2024 that [MASK0] was preparing for a massive trade war.", "masks": ["Trump"]}
{"masked_text": "[MASK0]'s trade policies have been described as protectionist, neomercantilist or autarkist.", "masks": ["Trump"]}
{"masked_text": "Increasing inflation has become a more common critique of [MASK0]'s economic plans.", "masks": ["Trump"]}
{"masked_text": "In June 2024, 16 Nobel Prize in Economics laureates signed an open letter arguing that [MASK0]'s fiscal and trade policies coupled with efforts to limit the Federal Reserve's independence would reignite inflation in the United States.", "masks": ["Trump"]}
{"masked_text": "Moody's and most economists surveyed by the WSJ in July 2024 predict that inflation would be worse under [MASK0] than Biden, a result due in part to tariffs, a crack down on illegal immigration, and larger deficits.", "masks": ["Trump"]}
{"masked_text": "Moody's and most economists surveyed by the WSJ in July 2024 predict that inflation would be worse under Trump than [MASK0], a result due in part to tariffs, a crack down on illegal immigration, and larger deficits.", "masks": ["Biden"]}
{"masked_text": "[MASK0] has pledged to terminate the Department of Education, claiming it has been infiltrated by \"radical zealots and Marxists.\"", "masks": ["Trump"]}
{"masked_text": "At the American Federation of Teachers national convention, [MASK0] attacked recent efforts to ban books.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has signaled to generally follow Biden's foreign policy on NATO and Ukraine, supporting both in the aftermath of the Russian invasion.", "masks": ["Harris"]}
{"masked_text": "Harris has signaled to generally follow [MASK0]'s foreign policy on NATO and Ukraine, supporting both in the aftermath of the Russian invasion.", "masks": ["Biden"]}
{"masked_text": "A supporter of the two-state solution, [MASK0] is seen as more sympathetic to Palestinians than Biden, who has described himself as a Zionist and has a long history with Israeli leaders.", "masks": ["Harris"]}
{"masked_text": "A supporter of the two-state solution, Harris is seen as more sympathetic to Palestinians than [MASK0], who has described himself as a Zionist and has a long history with Israeli leaders.", "masks": ["Biden"]}
{"masked_text": "Regarding the Israel–Hamas war, analysts expect [MASK0] to continue Biden's approach.", "masks": ["Harris"]}
{"masked_text": "Regarding the Israel–Hamas war, analysts expect Harris to continue [MASK0]'s approach.", "masks": ["Biden"]}
{"masked_text": "Following Hamas's attack on Israel in 2023, [MASK0] strongly supported Israel's offensive, stating that \"the threat Hamas poses to the people of Israel must be eliminated\".", "masks": ["Harris"]}
{"masked_text": "In March 2024, [MASK0] opposed Israel's invasion of Rafah, called for an immediate ceasefire in Gaza, and stated that the situation in Gaza is a \"humanitarian catastrophe\".", "masks": ["Harris"]}
{"masked_text": "[MASK0] is expected to continue deepening American alliances in Asia and the Pacific with the intention of curbing China's rising power both economically and militarily.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated he would encourage Russia to \"do whatever the hell they want\"", "masks": ["Trump"]}
{"masked_text": "to countries that did not contribute enough to NATO. [MASK0] has said he would cut off aid to Ukraine quickly if reelected.", "masks": ["Trump"]}
{"masked_text": "[MASK0] previously stated he would potentially recognize Russia's illegal annexation of Crimea, and made suggestions that he could have prevented the war by ceding parts of eastern Ukraine to Russia.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has voiced strong support for Israel in the Israel–Hamas war, and has stated that they must \"finish the problem\".", "masks": ["Trump"]}
{"masked_text": "[MASK0] has promised a tougher stance against China than Biden, but has also questioned whether America should defend Taiwan.", "masks": ["Trump"]}
{"masked_text": "Trump has promised a tougher stance against China than [MASK0], but has also questioned whether America should defend Taiwan.", "masks": ["Biden"]}
{"masked_text": "[MASK0] has suggested withdrawing troops from South Korea if it does not pay more to support U.S. troops there.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has previously promised he would bar Gaza residents from entering the United States through an extended travel ban.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has stated he would shut down pro-Palestinian protests, deport demonstrators, and \"set the movement back 25 or 30 years\".", "masks": ["Trump"]}
{"masked_text": "In April 2024, [MASK0] said Israel should \"get it over with ...", "masks": ["Trump"]}
{"masked_text": "In July 2024, [MASK0] said that Israel should end the war in Gaza as soon as possible.", "masks": ["Trump"]}
{"masked_text": "In the Democratic primaries, the Uncommitted National Movement led a protest campaign against [MASK0] over the war, calling for a ceasefire and arms embargo on Israel.", "masks": ["Biden"]}
{"masked_text": "[MASK0] has been seen as more sympathetic to Palestinians during the war, and her and her campaign have interacted with Arab-American and Uncommitted leaders on multiple occasions.", "masks": ["Harris"]}
{"masked_text": "However, [MASK0] has refused to halt  any weapons shipments to Israel or shift policy from Biden, saying Israel has a right to defend itself.", "masks": ["Harris"]}
{"masked_text": "However, Harris has refused to halt  any weapons shipments to Israel or shift policy from [MASK0], saying Israel has a right to defend itself.", "masks": ["Biden"]}
{"masked_text": "[MASK0] also supports Israel's campaign and has said it \"has to have a victory\", though has said it needs to \"get it over with\".", "masks": ["Trump"]}
{"masked_text": "[MASK0] has taken a more hardline stance on pro-Palestinian protests on university campuses, pledging to deport non-citizen protestors and \"set that movement back 25 or 30 years\".", "masks": ["Trump"]}
{"masked_text": "[MASK0] has supported efforts to strengthen coverage under the Affordable Care Act, including setting caps on seniors' out-of-pocket prescription drug prices at $2,000 and limiting the cost of insulin for those on Medicare to $35 enacted as part of the Inflation Reduction Act.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has been a proponent of White House efforts to ban medical debt from credit reports.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated she no longer supports a single-payer healthcare system.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has supported the expanded child tax credit enacted in the American Rescue Plan Act of 2021 that reduced child poverty by 20%.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has expressed support for making child care and elder care more affordable and enacting paid family leave.", "masks": ["Harris"]}
{"masked_text": "On August 16, 2024, [MASK0] announced the proposal of a $6,000 child tax credit, expanding her populist economic agenda.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has made repealing the Affordable Care Act a key issue of the 2024 election.", "masks": ["Trump"]}
{"masked_text": "During an interview on March 11, 2024, [MASK0] suggested he was open to cutting entitlement programs such as Social Security and Medicare, which the [MASK0] campaign later claimed was merely referring to \"cutting waste\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] previously suggested while president in 2020 that he would \"at some point\"", "masks": ["Trump"]}
{"masked_text": "look into cutting entitlement programs, and [MASK0]'s previous budget proposals have suggested some cuts to the programs.", "masks": ["Trump"]}
{"masked_text": "During the Republican primary, [MASK0] attacked his opponents by suggesting they would cut entitlement benefits.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has promised a rollback on Democratic-supported policies surrounding transgender individuals.", "masks": ["Trump"]}
{"masked_text": "[MASK0] stated he will rescind Biden's Title IX protections \"on day one\"", "masks": ["Trump"]}
{"masked_text": "Trump stated he will rescind [MASK0]'s Title IX protections \"on day one\"", "masks": ["Biden"]}
{"masked_text": "[MASK0] has stated he would enact a federal law that would recognize only two genders and claimed that being transgender is a concept made up by \"the radical left.\"", "masks": ["Trump"]}
{"masked_text": "[MASK0] previously withdrew Title IX provisions that allowed transgender youth to have access to the bathrooms of their choice, and he attempted to roll-back several transgender-related policies in the Affordable Care Act.", "masks": ["Trump"]}
{"masked_text": "On April 25, 2023, [MASK0] officially announced his bid for re-election, confirming that Vice President Harris would remain his running mate.", "masks": ["Biden"]}
{"masked_text": "On April 25, 2023, President Biden officially announced his bid for re-election, confirming that [MASK0] would remain his running mate.", "masks": ["Harris"]}
{"masked_text": "Following this announcement, Republicans increased their focus on [MASK0], intensifying criticism against her.", "masks": ["Harris"]}
{"masked_text": "During late 2021, amid [MASK0]'s declining approval ratings, speculation arose regarding whether he would seek re-election.", "masks": ["Biden"]}
{"masked_text": "Public figures, including former Representatives Carolyn Maloney, Tim Ryan and Joe Cunningham, urged [MASK0] not to run.", "masks": ["Biden"]}
{"masked_text": "Concerns about [MASK0]'s age were prominent, given that he was the oldest person to assume the office at age 78, which would make him 82 at the end of his first term and 86 at the end of a potential second term.", "masks": ["Biden"]}
{"masked_text": "An April 2023 poll indicated that 70 percent of Americans, including 51 percent of Democrats, believed [MASK0] should not seek a second term, with nearly half citing his age as the reason.", "masks": ["Biden"]}
{"masked_text": "[MASK0]'s approval rating stood at 41 percent, with 55 percent disapproving, according to the FiveThirtyEight national polling average.", "masks": ["Biden"]}
{"masked_text": "Speculation also arose that [MASK0] might face a primary challenge from the Democratic Party's progressive faction.", "masks": ["Biden"]}
{"masked_text": "However, after Democrats outperformed expectations in the 2022 midterm elections, many believed [MASK0]'s chances of securing the party's nomination had increased.", "masks": ["Biden"]}
{"masked_text": "Author Marianne Williamson was the first to challenge [MASK0] by announcing her candidacy in February 2023.", "masks": ["Biden"]}
{"masked_text": "On March 12, 2024, [MASK0] secured a majority of delegates, becoming the presumptive Democratic nominee.", "masks": ["Biden"]}
{"masked_text": "Despite securing the nomination, [MASK0] faced significant opposition from “uncommitted” voters and the Uncommitted National Movement, who collectively garnered more votes than several major contenders in the 2020 Democratic primaries and won 36 delegates.", "masks": ["Biden"]}
{"masked_text": "Following a widely panned debate performance against [MASK0] on June 27, 2024, Biden withdrew from the race on July 21, endorsing Harris as his successor.", "masks": ["Trump"]}
{"masked_text": "Following a widely panned debate performance against Trump on June 27, 2024, [MASK0] withdrew from the race on July 21, endorsing Harris as his successor.", "masks": ["Biden"]}
{"masked_text": "Following a widely panned debate performance against Trump on June 27, 2024, Biden withdrew from the race on July 21, endorsing [MASK0] as his successor.", "masks": ["Harris"]}
{"masked_text": "[MASK0] quickly announced her campaign and secured enough delegate endorsements by July 22, becoming the presumptive nominee.", "masks": ["Harris"]}
{"masked_text": "Following [MASK0]'s withdrawal, Walz, Josh Shapiro, Mark Kelly, and Andy Beshear emerged as lead candidates in the veepstakes.", "masks": ["Biden"]}
{"masked_text": "Following Biden's withdrawal, [MASK0], Josh Shapiro, Mark Kelly, and Andy Beshear emerged as lead candidates in the veepstakes.", "masks": ["Walz"]}
{"masked_text": "The Democratic Party conducted a virtual roll call vote on August 2, where [MASK0] secured the majority of delegate votes and became the official nominee on August 5.", "masks": ["Harris"]}
{"masked_text": "She selected [MASK0] as her running mate the following day.", "masks": ["Walz"]}
{"masked_text": "If successful, [MASK0] would make history as the first female and first Asian American president of the United States.", "masks": ["Harris"]}
{"masked_text": "[MASK0] would be the first vice president to have served in the war on terror.", "masks": ["Walz"]}
{"masked_text": "[MASK0], the then-incumbent president, was defeated by Biden in the 2020 election and is not term-limited to run again in 2024, making him the fifth ex-president to seek a second non-consecutive term.", "masks": ["Trump"]}
{"masked_text": "Trump, the then-incumbent president, was defeated by [MASK0] in the 2020 election and is not term-limited to run again in 2024, making him the fifth ex-president to seek a second non-consecutive term.", "masks": ["Biden"]}
{"masked_text": "If he wins, [MASK0] would be the second president to win a non-consecutive term, after Grover Cleveland in 1892.", "masks": ["Trump"]}
{"masked_text": "[MASK0] filed a statement of candidacy with the Federal Election Commission (FEC) on November 15, 2022, and announced his candidacy in a speech at Mar-a-Lago the same day.", "masks": ["Trump"]}
{"masked_text": "[MASK0] was considered an early frontrunner for the Republican presidential nomination.", "masks": ["Trump"]}
{"masked_text": "[MASK0] had announced in March 2022 that his former vice president Mike Pence would not be his running mate.", "masks": ["Trump"]}
{"masked_text": "In civil proceedings, [MASK0] has been found liable for sexual abuse and defamation in 2023, defamation in 2024, and financial fraud in 2024, becoming the first former president to be convicted of a crime.", "masks": ["Trump"]}
{"masked_text": "In March 2023, [MASK0] was indicted over his hush money payments to adult film actress Stormy Daniels.", "masks": ["Trump"]}
{"masked_text": "[MASK0] was again indicted in June over his handling of classified documents that contained materials sensitive to national security.", "masks": ["Trump"]}
{"masked_text": "[MASK0] has pleaded not guilty to all the charges related to these indictments.", "masks": ["Trump"]}
{"masked_text": "[MASK0] faced opposition in the primaries, easily defeating Nikki Haley.", "masks": ["Trump"]}
{"masked_text": "Florida Governor Ron DeSantis was seen as the main challenger to [MASK0] for the Republican nomination; he raised more campaign funds in the first half of 2022 and had more favorable polling numbers than [MASK0] by the end of 2022.", "masks": ["Trump"]}
{"masked_text": "At the end of July 2023, FiveThirtyEight's national polling average of the Republican primaries had [MASK0] at 52 percent, and DeSantis at 15.", "masks": ["Trump"]}
{"masked_text": "Following the Iowa caucuses, in which [MASK0] posted a landslide victory, DeSantis and businessman Vivek Ramaswamy dropped out of the race and endorsed [MASK0], leaving the former president and Nikki Haley, the former South Carolina governor who served in [MASK0]'s cabinet, as the only remaining major candidates.", "masks": ["Trump"]}
{"masked_text": "[MASK0] continued to win all four early voting contests while Haley's campaign struggled to gain momentum.", "masks": ["Trump"]}
{"masked_text": "On March 12, 2024, [MASK0] officially became the presumptive Republican presidential nominee.", "masks": ["Trump"]}
{"masked_text": "[MASK0] was lightly injured in an assassination attempt on July 13, 2024.", "masks": ["Trump"]}
{"masked_text": "On July 15, 2024, the first day of the Republican National Convention, [MASK0] officially announced that Senator Vance of Ohio would be his running mate.", "masks": ["Trump"]}
{"masked_text": "On July 15, 2024, the first day of the Republican National Convention, Trump officially announced that [MASK0] of Ohio would be his running mate.", "masks": ["Vance"]}
{"masked_text": "On July 18, 2024, [MASK0] accepted the nomination from the Republican National Convention to become the Republican presidential nominee.", "masks": ["Trump"]}
{"masked_text": "[MASK0] was chosen by the Libertarian Party as its presidential nominee on May 26, 2024, at the 2024 Libertarian National Convention.", "masks": ["Oliver"]}
{"masked_text": "[MASK0] was the party's candidate in the 2022 United States Senate election in Georgia.", "masks": ["Oliver"]}
{"masked_text": "[MASK0] was also the party's candidate in 2012 and 2016.", "masks": ["Stein"]}
{"masked_text": "[MASK0] is a physician and a former member of the Lexington Town Meeting.", "masks": ["Stein"]}
{"masked_text": "On August 16, [MASK0] selected academic Ware as her running mate.", "masks": ["Stein"]}
{"masked_text": "On August 16, Stein selected academic [MASK0] as her running mate.", "masks": ["Ware"]}
{"masked_text": "Robert F. Kennedy Jr., environmental lawyer, anti-vaccine activist and conspiracy theorist, previously Democratic primaries candidate launching an independent campaign (endorsed [MASK0])", "masks": ["Trump"]}
{"masked_text": "In May 2024, the [MASK0] campaign proposed hosting two debates outside of the CPD timetable and refusing to participate in CPD-hosted debates.", "masks": ["Biden"]}
{"masked_text": "[MASK0] and Trump agreed to debates on CNN on June 27 and ABC News on September 10.", "masks": ["Biden"]}
{"masked_text": "Biden and [MASK0] agreed to debates on CNN on June 27 and ABC News on September 10.", "masks": ["Trump"]}
{"masked_text": "On September 12, [MASK0] announced that there would be no third presidential debate.", "masks": ["Trump"]}
{"masked_text": "G. Elliott Morris and Kaleigh Rogers of ABC News' 538 argued that [MASK0] had failed to reassure voters that he was capable of serving as president for another four years.", "masks": ["Biden"]}
{"masked_text": "After the debate, elected officials, party strategists, and fundraisers conversed about replacing [MASK0] as the party's candidate, including whether prominent Democrats should make a public statement asking him to step aside.", "masks": ["Biden"]}
{"masked_text": "In response, [MASK0] initially stated that he would not be dropping out, and prominent Democratic politicians, including Barack Obama and Hillary Clinton, reiterated their support for [MASK0] following the debate.", "masks": ["Biden"]}
{"masked_text": "The debate performance led to [MASK0] ultimately withdrawing his bid for re-election on July 21.", "masks": ["Biden"]}
{"masked_text": "The first presidential debate between [MASK0] and Trump was held on Tuesday September 10 and was hosted by ABC News.", "masks": ["Harris"]}
{"masked_text": "The first presidential debate between Harris and [MASK0] was held on Tuesday September 10 and was hosted by ABC News.", "masks": ["Trump"]}
{"masked_text": "On August 2, [MASK0] announced he was withdrawing as he had agreed only to debate Biden, not Harris.", "masks": ["Trump"]}
{"masked_text": "On August 2, Trump announced he was withdrawing as he had agreed only to debate [MASK0], not Harris.", "masks": ["Biden"]}
{"masked_text": "On August 2, Trump announced he was withdrawing as he had agreed only to debate Biden, not [MASK0].", "masks": ["Harris"]}
{"masked_text": "[MASK0] had made his participation in the ABC debate contingent on Harris participating in a September 4 debate on Fox News.", "masks": ["Trump"]}
{"masked_text": "Trump had made his participation in the ABC debate contingent on [MASK0] participating in a September 4 debate on Fox News.", "masks": ["Harris"]}
{"masked_text": "On August 27, [MASK0] withdrew this demand and recommitted to the ABC debate.", "masks": ["Trump"]}
{"masked_text": "[MASK0] summed up the perceived unfairness of the ABC debates by saying that the two moderators were not fact-checking Harris, but they fact-checked him five times, and that it was a three-on-one fight.", "masks": ["Trump"]}
{"masked_text": "Trump summed up the perceived unfairness of the ABC debates by saying that the two moderators were not fact-checking [MASK0], but they fact-checked him five times, and that it was a three-on-one fight.", "masks": ["Harris"]}
{"masked_text": "The general reception of the debate was that [MASK0] won it.", "masks": ["Harris"]}
{"masked_text": "On August 15, 2024, vice presidential candidates [MASK0] and Walz agreed to a debate hosted on CBS News on October 1, though [MASK0] indicated he would only attend under certain conditions.", "masks": ["Vance"]}
{"masked_text": "On August 15, 2024, vice presidential candidates Vance and [MASK0] agreed to a debate hosted on CBS News on October 1, though Vance indicated he would only attend under certain conditions.", "masks": ["Walz"]}
{"masked_text": "[MASK0] said he couldn't participate in a fake debate where he couldn't exchange good ideas about policy.", "masks": ["Vance"]}
{"masked_text": "In particular, [MASK0] added that he would like to debate Walz at least once.", "masks": ["Vance"]}
{"masked_text": "In particular, Vance added that he would like to debate [MASK0] at least once.", "masks": ["Walz"]}
