{"masked_text": "On November 18, 2022, three days after former president and Republican candidate Donald Trump announced his 2024 re-election bid, U.S. Attorney General Merrick Garland appointed Jack [MASK0] as special counsel to investigate Trump's role in the January 6 U.S. Capitol attack and Trump's mishandling of government documents, including classified documents.", "masks": ["Smith"]}
{"masked_text": "On June 8, 2023, Trump was indicted on 37 federal charges related to his alleged mishandling of classified documents by the office of the [MASK0] special counsel investigation.", "masks": ["Smith"]}
{"masked_text": "In October 2023, Robert F. [MASK0] Jr. announced his run as an independent presidential candidate. On August 23, 2024, [MASK0] announced he was suspending his campaign and backing Trump. In July, intermediaries between Trump and [MASK0] discussed a possible role for [MASK0] in the Trump administration in return for his endorsement; a month later, [MASK0] made similar overtures to the Harris campaign, but was rebuffed.", "masks": ["Kennedy"]}
{"masked_text": "Nebraska Class 2: Republican Ben Sasse resigned his seat on January 8, 2023, to become President of the University of Florida. [MASK0] was appointed by Nebraska governor Jim Pillen to fill the seat until the special election, which will take place concurrently with the regularly-scheduled 2024 Senate elections.", "masks": ["Ricketts"]}
{"masked_text": "California Class 1: Democrat Dianne Feinstein died on September 29, 2023. [MASK0] was appointed by California governor Gavin Newsom to fill the seat until the special election, which will take place concurrently with the regular election for a six-year term.", "masks": ["Butler"]}
{"masked_text": "New York's 26th congressional district: Democrat Tim [MASK0] defeated Republican Gary Dickson to succeed Democrat Brian Higgins, who resigned on February 2, 2024, to become president of Shea's Performing Arts Center. The district has a partisan index of D+9.", "masks": ["Kennedy"]}
{"masked_text": "Ohio's 6th congressional district: Republican Michael Rulli defeated Democrat Michael Kripchak to succeed Republican Bill [MASK0], who resigned on January 21, 2024, to become president of Youngstown State University. The district has a partisan index of R+16.", "masks": ["Johnson"]}
{"masked_text": "Texas's 18th congressional district: Democrat Sheila Jackson [MASK0] died on July 19, 2024. The district has a partisan index of D+23.", "masks": ["Lee"]}
{"masked_text": "Pueblo, Colorado: On January 23, Heather [MASK0] defeated one-term incumbent Nick Gradisar in his bid for re-election.", "masks": ["Graham"]}
{"masked_text": "Milwaukee, Wisconsin: On April 2, one-term incumbent Cavalier [MASK0] won re-election to a full term against David [MASK1].", "masks": ["Johnson", "King"]}
{"masked_text": "Baltimore, Maryland: One-term incumbent Brandon [MASK0] was renominated for re-election. He will face Shannon Wright in the general election.", "masks": ["Scott"]}
{"masked_text": "Cheyenne, Wyoming: One-term incumbent Patrick [MASK0] is running for re-election.", "masks": ["Collins"]}
{"masked_text": "Pueblo, Colorado: On January 23, Heather [MASK0] defeated one-term incumbent Nick Gradisar in his bid for re-election. Republican gain from Democratic.", "masks": ["Graham"]}
{"masked_text": "In May, Forrest Tahdooahnippah was elected as chair of the Comanche Nation, replacing Mark Woommavovah who declined to run for reelection after being censured for his approval of a refinery project on tribal land; Diana Doyebi-Sovo was elected vice-chair. The Ottawa Tribe of Oklahoma elected Mikal [MASK0]-Werner second chief, Kallista Keah as secretary-treasurer, Cody Hollenbeck first councilman, and Rachel Marie Yeakley to the tribe's grievance committee. The Wasco, part of the Confederated Tribes of Warm Springs, elected Jefferson Greene chief in a special election. Michael Q. Primus II, Ben Lucero Wolf, Tiya “Tanequodle” Rosario, and [MASK1] Quetone were elected to the Kiowa Tribe's legislature. The Shoshone-Bannock Tribes in Idaho elected [MASK2] Juan Tyler as chair of the Fort Hall Business Council.", "masks": ["Scott", "Warren", "Lee"]}
{"masked_text": "In July, the Chickasaw Nation reelected David Woerz, Toby Perkins, Nancy Elliott, Shana Tate Darter, and [MASK0] Wood to the tribe's legislature and Linda English Weeks to the tribe's supreme court. Matthew Wesaw was reelected to a fourth term as chair of the Pokagon Band of Potawatomi Indians tribal council.", "masks": ["Scott"]}
{"masked_text": "On July 13, 2024, during a campaign rally in [MASK0], Pennsylvania, presidential candidate Donald Trump was shot at in a failed assassination attempt. The gunfire caused minor damage to Trump's upper right ear, while one spectator was killed and two others were critically injured.", "masks": ["Butler"]}
