{"masked_text": "Although initially adamant that he would remain in the race, Biden ultimately withdrew on July 21 and endorsed Vice President Kamala [MASK0], who became the party's nominee on August 5.", "masks": ["Harris"]}
{"masked_text": "[MASK0] selected Tim Walz, the governor of Minnesota, as her running mate.", "masks": ["Harris"]}
{"masked_text": "Biden's withdrawal makes him the first eligible incumbent president since Lyndon B. [MASK0] in 1968 not to run for re-election, and the first to withdraw after securing enough delegates to win the nomination.", "masks": ["Johnson"]}
{"masked_text": "[MASK0] is the first nominee who did not participate in the primaries since Hubert Humphrey, also in 1968.", "masks": ["Harris"]}
{"masked_text": "Iran has been identified as interfering with the 2024 presidential election through front companies connected to the Islamic Revolutionary Guard Corps through hacking attempts against the Trump, Biden, and [MASK0] campaigns starting as early as May 2024.", "masks": ["Harris"]}
{"masked_text": "Iran has launched propaganda and disinformation campaigns through fake news websites and accounts on social media to tip the election against former president Trump, although it has also targeted both Biden and [MASK0].", "masks": ["Harris"]}
{"masked_text": "According to an April 2024 Reuters/Ipsos poll, the percentage of registered voters who found Trump's charges somewhat to very serious in the federal elections [MASK0] was 74%, 72% in the Georgia [MASK0], 69% in the classified documents [MASK0], and 64% in the New York hush money [MASK0].", "masks": ["Case"]}
{"masked_text": "If Trump wins the election in November, then on January 20, 2025, Trump could order a new attorney general to dismiss the federal charges he is facing, prevent the state charges from taking affect through a variety of methods, and issue a presidential [MASK0]-pardon.", "masks": ["Self"]}
{"masked_text": "[MASK0] has framed her campaign as \"a choice between freedom and chaos\"", "masks": ["Harris"]}
{"masked_text": "The [MASK0] campaign has sought to highlight her experience as an attorney general and a prosecutor to \"prosecute the Case\"", "masks": ["Harris"]}
{"masked_text": "The Harris campaign has sought to highlight her experience as an attorney general and a prosecutor to \"prosecute the [MASK0]\"", "masks": ["Case"]}
{"masked_text": "[MASK0] is running as a moderate Democrat and has moderated several of her policy positions since her 2019 run, with many of her domestic policy stances now expected to resemble Biden's.", "masks": ["Harris"]}
{"masked_text": "[MASK0]'s stances will also have a particular focus on reproductive healthcare, criminal justice, and civil rights issues.", "masks": ["Harris"]}
{"masked_text": "[MASK0]' campaign has been noted for having an optimistic and joyful tone.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has won over voters with an optimistic message, but has been criticized for her vague optimism rather than concrete policies.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has responded by adding a policy page on a range of topics, from labor unions to cost-of-living issues to health care, to her campaign website.", "masks": ["Harris"]}
{"masked_text": "Trump has also made many personal attacks against [MASK0], several of which are sexual in nature, viewed as racist and misogynistic, and considered a continued breaking of norms regarding political speech.", "masks": ["Harris"]}
{"masked_text": "[MASK0] Women's Health Organization decision, in which the Supreme Court overturned Roe v.", "masks": ["Jackson"]}
{"masked_text": "Some pundits have argued abortion rights referenda could help [MASK0] in November.", "masks": ["Harris"]}
{"masked_text": " Since becoming the presumptive nominee, Kamala [MASK0] has indicated her support for passing legislation which would restore the federal abortion right protections previously guaranteed by Roe.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has highlighted her work in combating transnational gangs, drug cartels, and human traffickers while attorney general.", "masks": ["Harris"]}
{"masked_text": "In 2023, as vice president, [MASK0] announced pledges of US$950 million from private companies into Central American communities to address the causes of mass migration, such as poverty.", "masks": ["Harris"]}
{"masked_text": "[MASK0] supports increasing the number of Border Patrol agents and accuses Trump as being unserious on border security.", "masks": ["Harris"]}
{"masked_text": "While vice president, [MASK0] supported a bipartisan bill which would have funded additional border agents and closed the border if too crowded, the bill was rejected by Trump.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has criticized Trump for his opposition to the bill on the campaign trail, and has promised to sign the bill into law as president.", "masks": ["Harris"]}
{"masked_text": "[MASK0] is an advocate for environmental justice to address the impact of climate change on lower-income areas and people of color.", "masks": ["Harris"]}
{"masked_text": "[MASK0] helped pass the Inflation Reduction Act, the largest investment in addressing climate change and clean energy in US history putting the US on track to meet emissions reduction targets by 50–52% below 2005 levels by 2030.", "masks": ["Harris"]}
{"masked_text": "[MASK0]'s campaign has stated that she does not support a ban on fracking.", "masks": ["Harris"]}
{"masked_text": "[MASK0] was tasked by Biden with protecting democracy through voting rights legislation through her work on the For the People Act.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has supported efforts to defend election workers and counter Republican efforts to restrict voting following the 2020 presidential election.", "masks": ["Harris"]}
{"masked_text": "[MASK0] previously supported the George Floyd Justice in Policing Act.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has supported demilitarizing police departments, and has pushed back against calls to defund the police.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated her support to pass the Freedom to Vote Act and John Lewis Rights Voting Rights Advancement Act if elected.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has promised to address price gouging, bring down costs, ban hidden fees and late charges from financial institutions, limit \"unfair\"", "masks": ["Harris"]}
{"masked_text": "The New York Times described [MASK0]' economic policy as embracing \"the idea that the federal government must act aggressively to Foster competition and correct distortions in private markets.\"", "masks": ["Harris"]}
{"masked_text": "The New York Times described Harris' economic policy as embracing \"the idea that the federal government must act aggressively to [MASK0] competition and correct distortions in private markets.\"", "masks": ["Foster"]}
{"masked_text": "[MASK0] has proposed raising taxes on corporations and high-earners to fund services for the lower and middle classes and reduce the deficit.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated she supports increasing the top tier capital gains tax rate to 28%, up from 20% and lower than Biden's proposed 39.6%.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated her support for a Billionaire Minimum Income Tax, increasing the tax on stock buybacks to 4%, and a ten-fold tax reduction for small business ranging from $5,000 to $50,000 in relief.", "masks": ["Harris"]}
{"masked_text": "[MASK0] also supports efforts to create a tax on unrealized gains for those with more than a $100 million in net worth if they do not pay a minimum 25% tax rate on their income inclusive of unrealized gains so long as 80% of said wealth is in tradeable assets.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has also announced support for restoring the corporate tax rate to 28% among several other tax proposals to raise taxes and close loopholes for corporations and the wealthy that would bring in $5 trillion in additional revenue over 10 years.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has also proposed tax breaks to companies delivering economic benefit, such as manufacturing technologies to fight global warming and building affordable housing.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has proposed a ban on corporate price gouging to \"help the food industry become more competitive.\"", "masks": ["Harris"]}
{"masked_text": "[MASK0] has also expressed support for student debt relief, and [MASK0] says she supports raising the minimum wage.", "masks": ["Harris"]}
{"masked_text": "[MASK0] says she will increase home construction to reduce housing costs, arguing that it negatively impacts the economy and hurts working-class families.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has proposed directing $40 billion to construction companies to build starter homes.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has promised to send $25,000 in down-payment assistance to every first time home buyer.", "masks": ["Harris"]}
{"masked_text": "[MASK0] says she will urge Congress to enforce fair housing laws and pass a bill to bar property owners from using services that \"coordinate\"", "masks": ["Harris"]}
{"masked_text": "And his competitor, Kamala [MASK0], has echoed support for the proposal.", "masks": ["Harris"]}
{"masked_text": "Trump's stated trade policy involves the United States decoupling from the global economy and having the country become more [MASK0]-contained and exerting its power through individual trade dealings.", "masks": ["Self"]}
{"masked_text": "At the American Federation of Teachers national convention, [MASK0] attacked recent efforts to ban books.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has signaled to generally follow Biden's foreign policy on NATO and Ukraine, supporting both in the aftermath of the Russian invasion.", "masks": ["Harris"]}
{"masked_text": "A supporter of the two-state solution, [MASK0] is seen as more sympathetic to Palestinians than Biden, who has described himself as a Zionist and has a long history with Israeli leaders.", "masks": ["Harris"]}
{"masked_text": "Regarding the Israel–Hamas war, analysts expect [MASK0] to continue Biden's approach.", "masks": ["Harris"]}
{"masked_text": "Following Hamas's attack on Israel in 2023, [MASK0] strongly supported Israel's offensive, stating that \"the threat Hamas poses to the people of Israel must be eliminated\".", "masks": ["Harris"]}
{"masked_text": "In March 2024, [MASK0] opposed Israel's invasion of Rafah, called for an immediate ceasefire in Gaza, and stated that the situation in Gaza is a \"humanitarian catastrophe\".", "masks": ["Harris"]}
{"masked_text": "[MASK0] is expected to continue deepening American alliances in Asia and the Pacific with the intention of curbing China's rising power both economically and militarily.", "masks": ["Harris"]}
{"masked_text": "Trump has voiced [MASK0] support for Israel in the Israel–Hamas war, and has stated that they must \"finish the problem\".", "masks": ["Strong"]}
{"masked_text": "[MASK0] has been seen as more sympathetic to Palestinians during the war, and her and her campaign have interacted with Arab-American and Uncommitted leaders on multiple occasions.", "masks": ["Harris"]}
{"masked_text": "However, [MASK0] has refused to halt  any weapons shipments to Israel or shift policy from Biden, saying Israel has a right to defend itself.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has supported efforts to strengthen coverage under the Affordable Care Act, including setting caps on seniors' out-of-pocket prescription drug prices at $2,000 and limiting the cost of insulin for those on Medicare to $35 enacted as part of the Inflation Reduction Act.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has been a proponent of White House efforts to ban medical debt from credit reports.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has stated she no longer supports a single-payer healthcare system.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has supported the expanded child tax credit enacted in the American Rescue Plan Act of 2021 that reduced child poverty by 20%.", "masks": ["Harris"]}
{"masked_text": "[MASK0] has expressed support for making child care and elder care more affordable and enacting paid family leave.", "masks": ["Harris"]}
{"masked_text": "On August 16, 2024, Kamala [MASK0] announced the proposal of a $6,000 child tax credit, expanding her populist economic agenda.", "masks": ["Harris"]}
{"masked_text": "On April 25, 2023, President Joe Biden officially announced his bid for re-election, confirming that Vice President Kamala [MASK0] would remain his running mate.", "masks": ["Harris"]}
{"masked_text": "Following this announcement, Republicans increased their focus on [MASK0], intensifying criticism against her.", "masks": ["Harris"]}
{"masked_text": "Public figures, including former Representatives Carolyn Maloney, Tim [MASK0] and Joe Cunningham, urged Biden not to run.", "masks": ["Ryan"]}
{"masked_text": "In April 2023, Robert F. [MASK0] Jr. also entered the race but later shifted his campaign to an independent run on October 9, 2023.", "masks": ["Kennedy"]}
{"masked_text": "Representative [MASK0] joined the race on October 26, 2023.", "masks": ["Phillips"]}
{"masked_text": "Jason [MASK0], who surprised many by winning the American Samoa caucuses, became the first candidate to win a contested primary against an incumbent president since Ted Kennedy in 1980.", "masks": ["Palmer"]}
{"masked_text": "Jason Palmer, who surprised many by winning the American Samoa caucuses, became the first candidate to win a contested primary against an incumbent president since Ted [MASK0] in 1980.", "masks": ["Kennedy"]}
{"masked_text": "Following a widely panned debate performance against Donald Trump on June 27, 2024, Biden withdrew from the race on July 21, endorsing Kamala [MASK0] as his successor.", "masks": ["Harris"]}
{"masked_text": "[MASK0] quickly announced her campaign and secured enough delegate endorsements by July 22, becoming the presumptive nominee.", "masks": ["Harris"]}
{"masked_text": "Following Biden's withdrawal, Tim Walz, Josh Shapiro, Mark [MASK0], and Andy Beshear emerged as lead candidates in the veepstakes.", "masks": ["Kelly"]}
{"masked_text": "Shapiro received pushback from pro-Palestine activists for comments on college protesters and for claiming to volunteer for the IDF, while [MASK0] was criticized by \"labor groups.\"", "masks": ["Kelly"]}
{"masked_text": "The Democratic Party conducted a virtual roll call vote on August 2, where [MASK0] secured the majority of delegate votes and became the official nominee on August 5.", "masks": ["Harris"]}
{"masked_text": "If successful, [MASK0] would make history as the first female and first Asian American president of the United States.", "masks": ["Harris"]}
{"masked_text": "Trump had announced in March 2022 that his former vice president Mike [MASK0] would not be his running mate.", "masks": ["Pence"]}
{"masked_text": "Third-party and independent candidates have also announced presidential runs, including Cornel West and Robert F. [MASK0] Jr.", "masks": ["Kennedy"]}
{"masked_text": "[MASK0] dropped out of the race in August 2024, though he remains on the ballot in some states.", "masks": ["Kennedy"]}
{"masked_text": "Some existing third parties, such as the American Solidarity Party, the Prohibition Party, the Constitution Party, the Libertarian Party and the Party for Socialism and Liberation, and the [MASK0] Party have announced presidential nominees.", "masks": ["Green"]}
{"masked_text": "Party for Socialism and Liberation: Claudia De la [MASK0], political activist", "masks": ["Cruz"]}
{"masked_text": "Cornel West, academic, left-leaning and anti-war activist and public intellectual, previously both, People's Party and [MASK0] Party primaries candidate launching an independent campaign", "masks": ["Green"]}
{"masked_text": "Robert F. [MASK0] Jr., environmental lawyer, anti-vaccine activist and conspiracy theorist, previously Democratic primaries candidate launching an independent campaign (endorsed Trump)", "masks": ["Kennedy"]}
{"masked_text": "(used by some predictors): advantage that is not quite as [MASK0] as \"lean\"", "masks": ["Strong"]}
{"masked_text": "G. Elliott Morris and Kaleigh [MASK0] of ABC News' 538 argued that Biden had failed to reassure voters that he was capable of serving as president for another four years.", "masks": ["Rogers"]}
{"masked_text": "The first presidential debate between [MASK0] and Trump was held on Tuesday September 10 and was hosted by ABC News.", "masks": ["Harris"]}
{"masked_text": "On August 2, Trump announced he was withdrawing as he had agreed only to debate Biden, not [MASK0].", "masks": ["Harris"]}
{"masked_text": "Trump had made his participation in the ABC debate contingent on [MASK0] participating in a September 4 debate on Fox News.", "masks": ["Harris"]}
{"masked_text": "The moderators were David Muir and Linsey [MASK0], and lasted roughly 100 minutes.", "masks": ["Davis"]}
{"masked_text": "Trump summed up the perceived unfairness of the ABC debates by saying that the two moderators were not fact-checking [MASK0], but they fact-checked him five times, and that it was a three-on-one fight.", "masks": ["Harris"]}
{"masked_text": "The general reception of the debate was that [MASK0] won it.", "masks": ["Harris"]}
{"masked_text": "Vance said he couldn't participate in a fake debate where he couldn't exchange [MASK0] ideas about policy.", "masks": ["Good"]}
