{"masked_text": "According to the Kaiser Family Foundation, there were 15 states that have de jure early stage bans on abortion explicitly without exceptions for rape or incest: [MASK0], [MASK1], [MASK2], [MASK3], [MASK4], [MASK5], [MASK6], [MASK7], [MASK8], [MASK9], [MASK10], [MASK11], [MASK12], [MASK13], and [MASK14].", "masks": ["Alabama", "Arizona", "Arkansas", "Florida", "Kentucky", "Louisiana", "Mississippi", "Missouri", "Ohio", "Oklahoma", "South_dakota", "Tennessee", "Texas", "West_virginia", "Wisconsin"]}
{"masked_text": "Mark Robinson, who once advocated for a complete abortion ban without exceptions, underwent a rhetorical shift in his [MASK0] gubernatorial campaign.", "masks": ["North_carolina"]}
{"masked_text": "but as the leading Republican candidate for governor of [MASK0] in 2024, he avoided mentioning abortion on the campaign trail.", "masks": ["North_carolina"]}
{"masked_text": "However, his stance softened following the Supreme Court's 2022 Dobbs decision and the passage of [MASK0]'s 12-week abortion ban in May 2023.", "masks": ["North_carolina"]}
{"masked_text": "On May 10, 2023, Republican [MASK0] Congressman George Santos was indicted on federal charges of fraud and money laundering.", "masks": ["New_york"]}
{"masked_text": "On August 1, 2023, a [MASK0], D.C., federal grand jury indicted Trump again on four felony counts of conspiracy and obstruction related to Trump's role in the January 6 attack and his efforts to overturn the 2020 election.", "masks": ["Washington"]}
{"masked_text": "On August 14, a [MASK0] grand jury indicted Trump on racketeering and other felonies committed in an effort to overturn the state's 2020 election results and the Trump–Raffensperger phone call.", "masks": ["Georgia"]}
{"masked_text": "On September 22, 2023, Democratic U.S. Senator Bob Menendez of [MASK0] and his wife Nadine were both indicted on bribery charges.", "masks": ["New_jersey"]}
{"masked_text": "On December 19, 2023, the [MASK0] Supreme Court removed Trump from the state's 2024 Republican primary, citing the Fourteenth Amendment's ban on candidates who engage in insurrections.", "masks": ["Colorado"]}
{"masked_text": "Other candidates who have entered the 2024 Republican Party presidential primaries include former [MASK0] governor and former U.S. Ambassador to the U.N. Nikki Haley and current [MASK1] governor Ron DeSantis, who have since suspended their campaigns.", "masks": ["South_carolina", "Florida"]}
{"masked_text": "The first Republican presidential debate was held on August 23, 2023, and the first primary contest was the 2024 [MASK0] Republican presidential caucuses, which was held on January 15, 2024.", "masks": ["Iowa"]}
{"masked_text": "Three Democratic-held seats up for election are in the heavily Republican-leaning states of [MASK0], [MASK1], and [MASK2], all of which were won comfortably by Trump in both 2016 and 2020.", "masks": ["Montana", "Ohio", "West_virginia"]}
{"masked_text": "Other potential Republican targets include seats in [MASK0], [MASK1], [MASK2], [MASK3], [MASK4], and [MASK5], while Democrats may target Republican-held seats in [MASK6] and [MASK7].", "masks": ["Arizona", "Michigan", "Nevada", "Pennsylvania", "Wisconsin", "Maryland", "Florida", "Texas"]}
{"masked_text": "[MASK0] Class 2: Republican Ben Sasse resigned his seat on January 8, 2023, to become President of the University of [MASK1].", "masks": ["Nebraska", "Florida"]}
{"masked_text": "Pete Ricketts was appointed by [MASK0] governor Jim Pillen to fill the seat until the special election, which will take place concurrently with the regularly-scheduled 2024 Senate elections.", "masks": ["Nebraska"]}
{"masked_text": "[MASK0] Class 1: Democrat Dianne Feinstein died on September 29, 2023.", "masks": ["California"]}
{"masked_text": "Laphonza Butler was appointed by [MASK0] governor Gavin Newsom to fill the seat until the special election, which will take place concurrently with the regular election for a six-year term.", "masks": ["California"]}
{"masked_text": "[MASK0]'s 3rd congressional district: Democrat Tom Suozzi defeated Republican Mazi Melesa Pilip to succeed Republican George Santos, who was expelled on December 1, 2023, for making false biographical statements and alleged misuse of campaign funds.", "masks": ["New_york"]}
{"masked_text": "[MASK0]'s 26th congressional district: Democrat Tim Kennedy defeated Republican Gary Dickson to succeed Democrat Brian Higgins, who resigned on February 2, 2024, to become president of Shea's Performing Arts Center.", "masks": ["New_york"]}
{"masked_text": "[MASK0]'s 20th congressional district: Republican Vince Fong defeated Republican Mike Boudreaux to succeed Republican Kevin McCarthy, who resigned on December 31, 2023, after his removal as Speaker of the House.", "masks": ["California"]}
{"masked_text": "[MASK0]'s 6th congressional district: Republican Michael Rulli defeated Democrat Michael Kripchak to succeed Republican Bill Johnson, who resigned on January 21, 2024, to become president of Youngstown State University.", "masks": ["Ohio"]}
{"masked_text": "[MASK0]'s 4th congressional district: Republican Greg Lopez defeated Democrat Trisha Calvarese to succeed Republican Ken Buck, who resigned on March 22, 2024, due to dissatisfaction with the current Congress.", "masks": ["Colorado"]}
{"masked_text": "[MASK0]'s 10th congressional district: Democrat Donald Payne Jr. died on April 24, 2024, from complications following a heart attack.", "masks": ["New_jersey"]}
{"masked_text": "[MASK0]'s 8th congressional district: Republican Mike Gallagher resigned on April 24, 2024.", "masks": ["Wisconsin"]}
{"masked_text": "[MASK0]'s 18th congressional district: Democrat Sheila Jackson Lee died on July 19, 2024.", "masks": ["Texas"]}
{"masked_text": "The exceptions are the [MASK0] Senate, [MASK1] Senate, and both legislative chambers in the states of [MASK2], [MASK3], [MASK4], [MASK5], [MASK6], and [MASK7].", "masks": ["Michigan", "Minnesota", "Alabama", "Louisiana", "Maryland", "Mississippi", "New_jersey", "Virginia"]}
{"masked_text": "Pueblo, [MASK0]: On January 23, Heather Graham defeated one-term incumbent Nick Gradisar in his bid for re-election.", "masks": ["Colorado"]}
{"masked_text": "Bridgeport, [MASK0]: On February 27, two-term incumbent Joe Ganim won re-election against John Gomes after the previous election held in November 2023 was found fraudulent.", "masks": ["Connecticut"]}
{"masked_text": "Bakersfield, [MASK0]: On March 5, two-term incumbent Karen Goh won re-election against Gregory Tatum.", "masks": ["California"]}
{"masked_text": "Burlington, [MASK0]: On March 5, Emma Mulvaney-Stanak defeated Joan Shannon, succeeding four-term incumbent Miro Weinberger, who chose to retire.", "masks": ["Vermont"]}
{"masked_text": "Fresno, [MASK0]: On March 5, one-term incumbent Jerry Dyer won re-election against James Barr and Samantha Dussell.", "masks": ["California"]}
{"masked_text": "Riverside, [MASK0]: On March 5, one-term incumbent Patricia Lock Dawson won re-election against Jessica Qattawi.", "masks": ["California"]}
{"masked_text": "San Jose, [MASK0]: On March 5, one-term incumbent Matt Mahan won re-election against Tyrone Wade.", "masks": ["California"]}
{"masked_text": "Kenosha, [MASK0]: On April 2, David Bogdala defeated Lydia Spottswood, succeeding two-term incumbent John Antaramian, who chose to retire.", "masks": ["Wisconsin"]}
{"masked_text": "Milwaukee, [MASK0]: On April 2, one-term incumbent Cavalier Johnson won re-election to a full term against David King.", "masks": ["Wisconsin"]}
{"masked_text": "Anchorage, [MASK0]: On May 14, Suzanne LaFrance defeated one-term incumbent Dave Bronson in his bid for re-election.", "masks": ["Alaska"]}
{"masked_text": "Wheeling, [MASK0]: On May 14, Denny Magruder defeated Rosemary Ketchum, succeeding two-term incumbent Glenn Elliott, who was term-limited.", "masks": ["West_virginia"]}
{"masked_text": "Lubbock, [MASK0]: On June 15, Mark McBrayer defeated Steve Massengale in a runoff, succeeding one-term incumbent Tray Payne, who chose to retire.", "masks": ["Texas"]}
{"masked_text": "Honolulu, [MASK0]: On August 10, one-term incumbent Rick Blangiardi won re-election against Choon James.", "masks": ["Hawaii"]}
{"masked_text": "Miami-Dade County, [MASK0]: On August 20, one-term incumbent Daniella Levine Cava won re-election against Manny Cid and Alexander Otaola.", "masks": ["Florida"]}
{"masked_text": "Austin, [MASK0]: One-term incumbent Kirk Watson is running for re-election.", "masks": ["Texas"]}
{"masked_text": "Baltimore, [MASK0]: One-term incumbent Brandon Scott was renominated for re-election.", "masks": ["Maryland"]}
{"masked_text": "Cheyenne, [MASK0]: One-term incumbent Patrick Collins is running for re-election.", "masks": ["Wyoming"]}
{"masked_text": "Corpus Christi, [MASK0]: Two-term incumbent Paulette Guajardo is running for re-election.", "masks": ["Texas"]}
{"masked_text": "Costa Mesa, [MASK0]: One-term incumbent John Stephens is running for re-election.", "masks": ["California"]}
{"masked_text": "El Paso, [MASK0]: One-term incumbent Oscar Leeser is running for re-election.", "masks": ["Texas"]}
{"masked_text": "Fayetteville, [MASK0]: Four-term incumbent Lioneld Jordan is running for re-election.", "masks": ["Arkansas"]}
{"masked_text": "Grand Forks, [MASK0]: One-term incumbent Brandon Bochenski is running for re-election.", "masks": ["North_dakota"]}
{"masked_text": "Phoenix, [MASK0]: One-term incumbent Kate Gallego is running for re-election.", "masks": ["Arizona"]}
{"masked_text": "Salt Lake County, [MASK0]: One-term incumbent Jenny Wilson is running for re-election.", "masks": ["Utah"]}
{"masked_text": "San Diego, [MASK0]: One-term incumbent Todd Gloria is running for re-election.", "masks": ["California"]}
{"masked_text": "San Francisco, [MASK0]: One-term incumbent London Breed is running for re-election.", "masks": ["California"]}
{"masked_text": "Springdale, [MASK0]: Four-term incumbent Doug Sprouse is running for re-election.", "masks": ["Arkansas"]}
{"masked_text": "[MASK0] Beach, [MASK0]: One-term incumbent Bobby Dyer is running for re-election.", "masks": ["Virginia"]}
{"masked_text": "Grand Rapids, [MASK0]: Two-term incumbent Rosalynn Bliss is term-limited and ineligible to run.", "masks": ["Michigan"]}
{"masked_text": "Huntington, [MASK0]: Three-term incumbent Steve Williams is retiring to run for governor.", "masks": ["West_virginia"]}
{"masked_text": "Irvine, [MASK0]: Two-term incumbent Farrah Khan is term-limited and ineligible to run.", "masks": ["California"]}
{"masked_text": "Las Vegas, [MASK0]: Three-term incumbent Carolyn Goodman is term-limited and ineligible to run.", "masks": ["Nevada"]}
{"masked_text": "Mesa, [MASK0]: Two-term incumbent John Giles is term-limited and ineligible to run.", "masks": ["Arizona"]}
{"masked_text": "Richmond, [MASK0]: Two-term incumbent Levar Stoney is term-limited and ineligible to run.", "masks": ["Virginia"]}
{"masked_text": "Stockton, [MASK0]: One-term incumbent Kevin Lincoln is retiring to run for Congress.", "masks": ["California"]}
{"masked_text": "Tulsa, [MASK0]: Two-term incumbent G. T. Bynum is term-limited and ineligible to run.", "masks": ["Oklahoma"]}
{"masked_text": "Pueblo, [MASK0]: On January 23, Heather Graham defeated one-term incumbent Nick Gradisar in his bid for re-election.", "masks": ["Colorado"]}
{"masked_text": "Burlington, [MASK0]: On March 5, Emma Mulvaney-Stanak defeated Joan Shannon, succeeding four-term incumbent Miro Weinberger, who chose to retire.", "masks": ["Vermont"]}
{"masked_text": "Anchorage, [MASK0]: On May 14, Suzanne LaFrance defeated one-term incumbent Dave Bronson in his bid for re-election.", "masks": ["Alaska"]}
{"masked_text": "Wheeling, [MASK0]: On May 14, Denny Magruder defeated Rosemary Ketchum, succeeding two-term incumbent Glenn Elliott, who was term-limited.", "masks": ["West_virginia"]}
{"masked_text": "Tulsa, [MASK0]: On August 27, Monroe Nichols and Karen Keith advanced to the runoff election, succeeding two-term incumbent G. T. Bynum, who was term-limited.", "masks": ["Oklahoma"]}
{"masked_text": "Also in January, the Shakopee Mdewakanton Sioux Community elevated Cole Miller from vice chair to tribal chairman, and Debra O'Gara was elected president of the Petersburg Indian Association in [MASK0].", "masks": ["Alaska"]}
{"masked_text": "In March, the Apache Tribe of [MASK0] reelected Durell Cooper III as tribal chairman and Matthew Tselee as vice-chairman.", "masks": ["Oklahoma"]}
{"masked_text": "The Peoria Tribe of [MASK0] elected Jason Dollarhide as treasurer, Carolyn Ritchey to the business committee, and Stacy Lindsly to the grievance committee.", "masks": ["Oklahoma"]}
{"masked_text": "The Ottawa Tribe of [MASK0] elected Mikal Scott-Werner second chief, Kallista Keah as secretary-treasurer, Cody Hollenbeck first councilman, and Rachel Marie Yeakley to the tribe's grievance committee.", "masks": ["Oklahoma"]}
{"masked_text": "The Shoshone-Bannock Tribes in [MASK0] elected Lee Juan Tyler as chair of the Fort Hall Business Council.", "masks": ["Idaho"]}
{"masked_text": "In June, the Pascua Yaqui Tribe in [MASK0] elected Julian Hernandez tribal council chair.", "masks": ["Arizona"]}
{"masked_text": "The [MASK0] Tribe of [MASK1] elected Abraham Lincoln, Perri Ahhaitty, and Christie Modlin to the business committee.", "masks": ["Iowa", "Oklahoma"]}
{"masked_text": "Also in June, [MASK0] Chippewa Tribe voters elected Bruce Savage to lead the Fond du Lac Band of Lake Superior Chippewa, and reelected Cathy Chavers as head of the Bois Forte Band of Chippewa, Faron Jackson Sr. of the Leech Lake Band of Ojibwe, and Michael Fairbanks of the White Earth Nation.", "masks": ["Minnesota"]}
{"masked_text": "The five territories and [MASK0], D.C., do not elect members of the Senate, and the territories do not take part in presidential elections; instead, they each elect one non-voting member of the House.", "masks": ["Washington"]}
{"masked_text": "[MASK0]'s unicameral legislature and the governorship and legislature of American Samoa are elected on a non-partisan basis, and political party affiliation is not listed.", "masks": ["Nebraska"]}
{"masked_text": "On July 13, 2024, during a campaign rally in Butler, [MASK0], presidential candidate Donald Trump was shot at in a failed assassination attempt.", "masks": ["Pennsylvania"]}
