{"masked_text": "On November 18, 2022, three days after former president and Republican candidate Donald Trump announced his 2024 re-election bid, U.S. Attorney General Merrick Garland appointed Jack [MASK0] as special counsel to investigate Trump's role in the January 6 U.S. Capitol attack and Trump's mishandling of government documents, including classified documents.", "masks": ["Smith"]}
{"masked_text": "On June 8, 2023, Trump was indicted on 37 federal charges related to his alleged mishandling of classified documents by the office of the [MASK0] special counsel investigation.", "masks": ["Smith"]}
{"masked_text": "On September 22, 2023, Democratic U.S. Senator Bob [MASK0] of New Jersey and his wife Nadine were both indicted on bribery charges.", "masks": ["Menendez"]}
{"masked_text": "President Joe Biden initially ran for a second term and won the primaries, with Vice President Kamala [MASK0] once again serving as his running mate; Biden later withdrew his candidacy on July 21, 2024.", "masks": ["Harris"]}
{"masked_text": "After a survey by the Associated Press of Democratic delegates on July 22, 2024, Kamala [MASK0] became the new presumptive candidate for the Democratic party, a day after declaring her candidacy.", "masks": ["Harris"]}
{"masked_text": "In October 2023, Robert F. [MASK0] Jr. announced his run as an independent presidential candidate.", "masks": ["Kennedy"]}
{"masked_text": "On August 23, 2024, [MASK0] announced he was suspending his campaign and backing Trump.", "masks": ["Kennedy"]}
{"masked_text": "In July, intermediaries between Trump and [MASK0] discussed a possible role for [MASK0] in the Trump administration in return for his endorsement; a month later, [MASK0] made similar overtures to the [MASK1] campaign, but was rebuffed.", "masks": ["Kennedy", "Harris"]}
{"masked_text": "New York's 3rd congressional district: Democrat [MASK0] defeated Republican Mazi Melesa Pilip to succeed Republican George Santos, who was expelled on December 1, 2023, for making false biographical statements and alleged misuse of campaign funds.", "masks": ["Suozzi"]}
{"masked_text": "New York's 26th congressional district: Democrat [MASK0] defeated Republican Gary Dickson to succeed Democrat Brian [MASK1], who resigned on February 2, 2024, to become president of Shea's Performing Arts Center.", "masks": ["Kennedy", "Higgins"]}
{"masked_text": "California's 20th congressional district: Republican [MASK0] defeated Republican Mike Boudreaux to succeed Republican Kevin McCarthy, who resigned on December 31, 2023, after his removal as Speaker of the House.", "masks": ["Fong"]}
{"masked_text": "Ohio's 6th congressional district: Republican [MASK0] defeated Democrat Michael Kripchak to succeed Republican Bill [MASK1], who resigned on January 21, 2024, to become president of Youngstown State University.", "masks": ["Rulli", "Johnson"]}
{"masked_text": "Colorado's 4th congressional district: Republican [MASK0] defeated Democrat Trisha Calvarese to succeed Republican Ken Buck, who resigned on March 22, 2024, due to dissatisfaction with the current Congress.", "masks": ["Lopez"]}
{"masked_text": "Texas's 18th congressional district: Democrat Sheila [MASK0] [MASK1] died on July 19, 2024.", "masks": ["Jackson", "Lee"]}
{"masked_text": "Fresno, California: On March 5, one-term incumbent Jerry Dyer won re-election against [MASK0] [MASK1] and Samantha Dussell.", "masks": ["James", "Barr"]}
{"masked_text": "Milwaukee, Wisconsin: On April 2, one-term incumbent Cavalier [MASK0] won re-election to a full term against David King.", "masks": ["Johnson"]}
{"masked_text": "Honolulu, Hawaii: On August 10, one-term incumbent Rick Blangiardi won re-election against Choon [MASK0].", "masks": ["James"]}
{"masked_text": "Baltimore, Maryland: One-term incumbent Brandon [MASK0] was renominated for re-election.", "masks": ["Scott"]}
{"masked_text": "Cheyenne, Wyoming: One-term incumbent Patrick [MASK0] is running for re-election.", "masks": ["Collins"]}
{"masked_text": "[MASK0] Mesa, California: One-term incumbent John Stephens is running for re-election.", "masks": ["Costa"]}
{"masked_text": "Fayetteville, Arkansas: Four-term incumbent Lioneld [MASK0] is running for re-election.", "masks": ["Jordan"]}
{"masked_text": "Phoenix, Arizona: One-term incumbent Kate [MASK0] is running for re-election.", "masks": ["Gallego"]}
{"masked_text": "Salt Lake County, Utah: One-term incumbent Jenny [MASK0] is running for re-election.", "masks": ["Wilson"]}
{"masked_text": "Huntington, West Virginia: Three-term incumbent Steve [MASK0] is retiring to run for governor.", "masks": ["Williams"]}
{"masked_text": "Also in January, the Shakopee Mdewakanton Sioux Community elevated [MASK0] [MASK1] from vice chair to tribal chairman, and Debra O'Gara was elected president of the Petersburg Indian Association in Alaska.", "masks": ["Cole", "Miller"]}
{"masked_text": "The Ottawa Tribe of Oklahoma elected Mikal [MASK0]-Werner second chief, Kallista Keah as secretary-treasurer, Cody Hollenbeck first councilman, and Rachel Marie Yeakley to the tribe's grievance committee.", "masks": ["Scott"]}
{"masked_text": "The Wasco, part of the Confederated Tribes of Warm Springs, elected Jefferson [MASK0] chief in a special election.", "masks": ["Greene"]}
{"masked_text": "The Shoshone-Bannock Tribes in Idaho elected [MASK0] Juan Tyler as chair of the Fort Hall Business Council.", "masks": ["Lee"]}
{"masked_text": "Also in June, Minnesota Chippewa Tribe voters elected Bruce Savage to lead the Fond du Lac Band of Lake Superior Chippewa, and reelected Cathy Chavers as head of the Bois Forte Band of Chippewa, Faron [MASK0] Sr. of the Leech Lake Band of Ojibwe, and Michael Fairbanks of the White Earth Nation.", "masks": ["Jackson"]}
{"masked_text": "In July, the Chickasaw Nation reelected David Woerz, Toby Perkins, Nancy Elliott, Shana Tate Darter, and [MASK0] Wood to the tribe's legislature and Linda English Weeks to the tribe's supreme court.", "masks": ["Scott"]}
