{"masked_text": "This will be the first presidential election held after the overturn of Roe v. Wade, and the third overall election cycle after the 2022 midterm elections and the 2023 off-year elections. Republican-controlled states predominantly passed near-total bans on abortion in the aftermath of the Supreme Court's June 2022 Dobbs v. [MASK0] Women's Health Organization decision. By April 2023, abortion was \"largely illegal\" throughout much of the United States. According to the Kaiser Family Foundation, there were 15 states that have de jure early stage bans on abortion explicitly without exceptions for rape or incest: Alabama, Arizona, Arkansas, Florida, Kentucky, Louisiana, Mississippi, Missouri, Ohio, Oklahoma, South Dakota, Tennessee, Texas, West Virginia, and Wisconsin. In states with laws granting exceptions, it was reported de facto that \"very few exceptions to these new abortion bans have been granted\" and that patients who had been raped or otherwise qualified for exceptions were being turned away, citing \"ambiguous laws and the threat of criminal penalties make them unwilling to test the rules\".", "masks": ["Jackson"]}
{"masked_text": "On November 18, 2022, three days after former president and Republican candidate Donald Trump announced his 2024 re-election bid, U.S. Attorney General Merrick Garland appointed Jack [MASK0] as special counsel to investigate Trump's role in the January 6 U.S. Capitol attack and Trump's mishandling of government documents, including classified documents.", "masks": ["Smith"]}
{"masked_text": "On June 8, 2023, Trump was indicted on 37 federal charges related to his alleged mishandling of classified documents by the office of the [MASK0] special counsel investigation.", "masks": ["Smith"]}
{"masked_text": "On September 22, 2023, Democratic U.S. Senator Bob [MASK0] of New Jersey and his wife Nadine were both indicted on bribery charges.", "masks": ["Menendez"]}
{"masked_text": "The 2024 United States presidential election will be the 60th quadrennial U.S. presidential election. This will be the first presidential election under the electoral vote distribution determined by the 2020 census. Presidential electors who will elect the President and Vice President of the United States will be chosen; a simple majority (270) of the 538 electoral votes are required to win the election. President Joe Biden initially ran for a second term and won the primaries, with Vice President Kamala [MASK0] once again serving as his running mate; Biden later withdrew his candidacy on July 21, 2024. This is the first election since 1968 in which an eligible incumbent president was not their party's nominee.", "masks": ["Harris"]}
{"masked_text": "After a survey by the Associated Press of Democratic delegates on July 22, 2024, Kamala [MASK0] became the new presumptive candidate for the Democratic party, a day after declaring her candidacy. She would become the official nominee on August 5 following a virtual roll call of delegates.", "masks": ["Harris"]}
{"masked_text": "In October 2023, Robert F. [MASK0] Jr. announced his run as an independent presidential candidate. On August 23, 2024, [MASK0] announced he was suspending his campaign and backing Trump. In July, intermediaries between Trump and [MASK0] discussed a possible role for [MASK0] in the Trump administration in return for his endorsement; a month later, [MASK0] made similar overtures to the Harris campaign, but was rebuffed.", "masks": ["Kennedy"]}
{"masked_text": "In October 2023, Robert F. Kennedy Jr. announced his run as an independent presidential candidate. On August 23, 2024, Kennedy announced he was suspending his campaign and backing Trump. In July, intermediaries between Trump and Kennedy discussed a possible role for Kennedy in the Trump administration in return for his endorsement; a month later, Kennedy made similar overtures to the [MASK0] campaign, but was rebuffed.", "masks": ["Harris"]}
{"masked_text": "New York's 3rd congressional district: Democrat [MASK0] defeated Republican Mazi Melesa Pilip to succeed Republican George Santos, who was expelled on December 1, 2023, for making false biographical statements and alleged misuse of campaign funds. The district has a partisan index of D+2.", "masks": ["Suozzi"]}
{"masked_text": "New York's 26th congressional district: Democrat [MASK0] defeated Republican Gary Dickson to succeed Democrat Brian Higgins, who resigned on February 2, 2024, to become president of Shea's Performing Arts Center. The district has a partisan index of D+9.", "masks": ["Kennedy"]}
{"masked_text": "New York's 26th congressional district: Democrat Kennedy defeated Republican Gary Dickson to succeed Democrat Brian [MASK0], who resigned on February 2, 2024, to become president of Shea's Performing Arts Center. The district has a partisan index of D+9.", "masks": ["Higgins"]}
{"masked_text": "California's 20th congressional district: Republican [MASK0] defeated Republican Mike Boudreaux to succeed Republican Kevin McCarthy, who resigned on December 31, 2023, after his removal as Speaker of the House. The district has a partisan index of R+16.", "masks": ["Fong"]}
{"masked_text": "Ohio's 6th congressional district: Republican [MASK0] defeated Democrat Michael Kripchak to succeed Republican Bill Johnson, who resigned on January 21, 2024, to become president of Youngstown State University. The district has a partisan index of R+16.", "masks": ["Rulli"]}
{"masked_text": "Ohio's 6th congressional district: Republican Rulli defeated Democrat Michael Kripchak to succeed Republican Bill [MASK0], who resigned on January 21, 2024, to become president of Youngstown State University. The district has a partisan index of R+16.", "masks": ["Johnson"]}
{"masked_text": "Colorado's 4th congressional district: Republican [MASK0] defeated Democrat Trisha Calvarese to succeed Republican Ken Buck, who resigned on March 22, 2024, due to dissatisfaction with the current Congress. The district has a partisan index of R+13.", "masks": ["Lopez"]}
{"masked_text": "Texas's 18th congressional district: Democrat Sheila [MASK0] Lee died on July 19, 2024. The district has a partisan index of D+23.", "masks": ["Jackson"]}
{"masked_text": "Texas's 18th congressional district: Democrat Sheila Jackson [MASK0] died on July 19, 2024. The district has a partisan index of D+23.", "masks": ["Lee"]}
{"masked_text": "Fresno, California: On March 5, one-term incumbent Jerry Dyer won re-election against [MASK0] Barr and Samantha Dussell.", "masks": ["James"]}
{"masked_text": "Fresno, California: On March 5, one-term incumbent Jerry Dyer won re-election against James [MASK0] and Samantha Dussell.", "masks": ["Barr"]}
{"masked_text": "Milwaukee, Wisconsin: On April 2, one-term incumbent Cavalier [MASK0] won re-election to a full term against David King.", "masks": ["Johnson"]}
{"masked_text": "Honolulu, Hawaii: On August 10, one-term incumbent Rick Blangiardi won re-election against Choon [MASK0].", "masks": ["James"]}
{"masked_text": "Baltimore, Maryland: One-term incumbent Brandon [MASK0] was renominated for re-election. He will face Shannon Wright in the general election.", "masks": ["Scott"]}
{"masked_text": "Cheyenne, Wyoming: One-term incumbent Patrick [MASK0] is running for re-election.", "masks": ["Collins"]}
{"masked_text": "[MASK0] Mesa, California: One-term incumbent John Stephens is running for re-election.", "masks": ["Costa"]}
{"masked_text": "Fayetteville, Arkansas: Four-term incumbent Lioneld [MASK0] is running for re-election.", "masks": ["Jordan"]}
{"masked_text": "Phoenix, Arizona: One-term incumbent Kate [MASK0] is running for re-election.", "masks": ["Gallego"]}
{"masked_text": "Salt Lake County, Utah: One-term incumbent Jenny [MASK0] is running for re-election.", "masks": ["Wilson"]}
{"masked_text": "San Diego, California: One-term incumbent Todd Gloria is running for re-election. He will face Larry [MASK0] in the runoff election.", "masks": ["Turner"]}
{"masked_text": "Huntington, West Virginia: Three-term incumbent Steve [MASK0] is retiring to run for governor. Jennifer Wheeler and Patrick Farrell are the nominees for the general election.", "masks": ["Williams"]}
{"masked_text": "In January, the Fort McDowell Yavapai Nation elected Sandra Pattea tribal president, ousting long-term tribal leader Bernadine Burnette, who first joined the tribal council in 1992. Also in January, the Shakopee Mdewakanton Sioux Community elevated [MASK0] Miller from vice chair to tribal chairman, and Debra O'Gara was elected president of the Petersburg Indian Association in Alaska.", "masks": ["Cole"]}
{"masked_text": "In January, the Fort McDowell Yavapai Nation elected Sandra Pattea tribal president, ousting long-term tribal leader Bernadine Burnette, who first joined the tribal council in 1992. Also in January, the Shakopee Mdewakanton Sioux Community elevated Cole [MASK0] from vice chair to tribal chairman, and Debra O'Gara was elected president of the Petersburg Indian Association in Alaska.", "masks": ["Miller"]}
{"masked_text": "In May, Forrest Tahdooahnippah was elected as chair of the Comanche Nation, replacing Mark Woommavovah who declined to run for reelection after being censured for his approval of a refinery project on tribal land; Diana Doyebi-Sovo was elected vice-chair. The Ottawa Tribe of Oklahoma elected Mikal [MASK0]-Werner second chief, Kallista Keah as secretary-treasurer, Cody Hollenbeck first councilman, and Rachel Marie Yeakley to the tribe's grievance committee. The Wasco, part of the Confederated Tribes of Warm Springs, elected Jefferson Greene chief in a special election. Michael Q. Primus II, Ben Lucero Wolf, Tiya “Tanequodle” Rosario, and Warren Quetone were elected to the Kiowa Tribe's legislature. The Shoshone-Bannock Tribes in Idaho elected Lee Juan Tyler as chair of the Fort Hall Business Council.", "masks": ["Scott"]}
{"masked_text": "In May, Forrest Tahdooahnippah was elected as chair of the Comanche Nation, replacing Mark Woommavovah who declined to run for reelection after being censured for his approval of a refinery project on tribal land; Diana Doyebi-Sovo was elected vice-chair. The Ottawa Tribe of Oklahoma elected Mikal Scott-Werner second chief, Kallista Keah as secretary-treasurer, Cody Hollenbeck first councilman, and Rachel Marie Yeakley to the tribe's grievance committee. The Wasco, part of the Confederated Tribes of Warm Springs, elected Jefferson [MASK0] chief in a special election. Michael Q. Primus II, Ben Lucero Wolf, Tiya “Tanequodle” Rosario, and Warren Quetone were elected to the Kiowa Tribe's legislature. The Shoshone-Bannock Tribes in Idaho elected Lee Juan Tyler as chair of the Fort Hall Business Council.", "masks": ["Greene"]}
{"masked_text": "In May, Forrest Tahdooahnippah was elected as chair of the Comanche Nation, replacing Mark Woommavovah who declined to run for reelection after being censured for his approval of a refinery project on tribal land; Diana Doyebi-Sovo was elected vice-chair. The Ottawa Tribe of Oklahoma elected Mikal Scott-Werner second chief, Kallista Keah as secretary-treasurer, Cody Hollenbeck first councilman, and Rachel Marie Yeakley to the tribe's grievance committee. The Wasco, part of the Confederated Tribes of Warm Springs, elected Jefferson Greene chief in a special election. Michael Q. Primus II, Ben Lucero Wolf, Tiya “Tanequodle” Rosario, and Warren Quetone were elected to the Kiowa Tribe's legislature. The Shoshone-Bannock Tribes in Idaho elected [MASK0] Juan Tyler as chair of the Fort Hall Business Council.", "masks": ["Lee"]}
{"masked_text": "In June, the Pascua Yaqui Tribe in Arizona elected Julian Hernandez tribal council chair. The Osage Nation elected Pam Shaw, John Maker, Billy Keene, Maria Whitehorn, and Joe Tillman to the Osage Congress. Charles Diebold was reelected chief of the Seneca-Cayuga Nation while Cynthia Bauer and John White Eagle were elected to the tribe's business committee. The Iowa Tribe of Oklahoma elected Abraham Lincoln, Perri Ahhaitty, and Christie Modlin to the business committee. In a June Comanche Nation runoff, Lisa Dawsey was elected tribal administrator and law firm Crowe & Dunlevy was elected tribal attorney. Also in June, Minnesota Chippewa Tribe voters elected Bruce Savage to lead the Fond du Lac Band of Lake Superior Chippewa, and reelected Cathy Chavers as head of the Bois Forte Band of Chippewa, Faron [MASK0] Sr. of the Leech Lake Band of Ojibwe, and Michael Fairbanks of the White Earth Nation.  Grand Portage Band of Chippewa chairperson Robert Deschampe was unopposed. The sixth group in the tribe, the Mille Lacs Band of Ojibwe, elected Virgil Wind chief executive in April when he won the primary election outright with more than 50 percent of the vote. Wind succeeded Melanie Benjamin who decided not to run for a seventh term.", "masks": ["Jackson"]}
{"masked_text": "In July, the Chickasaw Nation reelected David Woerz, Toby Perkins, Nancy Elliott, Shana Tate Darter, and [MASK0] Wood to the tribe's legislature and Linda English Weeks to the tribe's supreme court. Matthew Wesaw was reelected to a fourth term as chair of the Pokagon Band of Potawatomi Indians tribal council.", "masks": ["Scott"]}
