{"masked_text": "The incumbent president, Joe Biden, a member of the Democratic Party, initially ran for re-election and became the party's presumptive nominee, facing [MASK0] opposition.", "masks": ["Little"]}
{"masked_text": "Harris selected [MASK0], the governor of Minnesota, as her running mate.", "masks": ["Walz"]}
{"masked_text": "the [MASK0] Department to target him in relation to his criminal trials.", "masks": ["Justice"]}
{"masked_text": "of his presidency and not after, his promise to use the [MASK0] Department to go after his political enemies, his plan to use the Insurrection Act of 1807 to deploy the military in Democratic cities and states, attempts to overturn the 2020 United States presidential election, continued Republican efforts to restrict voting following the 2020 presidential election, Trump's baseless predictions of voter fraud in the 2024 election, and Trump's public embrace and celebration of the January 6 United States Capitol attack, have raised concerns over the state of democracy in America.", "masks": ["Justice"]}
{"masked_text": "Harris's stances will also have a particular focus on reproductive healthcare, criminal [MASK0], and civil rights issues.", "masks": ["Justice"]}
{"masked_text": "Harris is an advocate for environmental [MASK0] to address the impact of climate change on lower-income areas and people of color.", "masks": ["Justice"]}
{"masked_text": "Trump has repeatedly stated his intention to have the [MASK0] Department investigate and arrest his domestic political rivals, judges, prosecutors, and witnesses involved in his criminal trials.", "masks": ["Justice"]}
{"masked_text": "Harris previously supported the George Floyd [MASK0] in Policing Act.", "masks": ["Justice"]}
{"masked_text": "Following Biden's withdrawal, [MASK0], Shapiro, Mark Kelly, and Beshear emerged as lead candidates in the veepstakes.", "masks": ["Walz"]}
{"masked_text": "Following Biden's withdrawal, Walz, [MASK0], Mark Kelly, and Beshear emerged as lead candidates in the veepstakes.", "masks": ["Shapiro"]}
{"masked_text": "Following Biden's withdrawal, Walz, Shapiro, Mark [MASK0], and Beshear emerged as lead candidates in the veepstakes.", "masks": ["Kelly"]}
{"masked_text": "Following Biden's withdrawal, Walz, Shapiro, Mark Kelly, and [MASK0] emerged as lead candidates in the veepstakes.", "masks": ["Beshear"]}
{"masked_text": "[MASK0] received pushback from pro-Palestine activists for comments on college protesters and for claiming to volunteer for the IDF, while Kelly was criticized by \"labor groups.\"", "masks": ["Shapiro"]}
{"masked_text": "Shapiro received pushback from pro-Palestine activists for comments on college protesters and for claiming to volunteer for the IDF, while [MASK0] was criticized by \"labor groups.\"", "masks": ["Kelly"]}
{"masked_text": "She selected [MASK0] as her running mate the following day.", "masks": ["Walz"]}
{"masked_text": "[MASK0] would be the first vice president to have served in the war on terror.", "masks": ["Walz"]}
{"masked_text": "Florida Governor [MASK0] was seen as the main challenger to Trump for the Republican nomination; he raised more campaign funds in the first half of 2022 and had more favorable polling numbers than Trump by the end of 2022.", "masks": ["Desantis"]}
{"masked_text": "On May 24, 2023, [MASK0] announced his candidacy on Twitter in an online conversation with Twitter CEO Elon Musk.", "masks": ["Desantis"]}
{"masked_text": "At the end of July 2023, FiveThirtyEight's national polling average of the Republican primaries had Trump at 52 percent, and [MASK0] at 15.", "masks": ["Desantis"]}
{"masked_text": "Following the Iowa caucuses, in which Trump posted a landslide victory, [MASK0] and businessman Vivek Ramaswamy dropped out of the race and endorsed Trump, leaving the former president and Nikki Haley, the former South Carolina governor who served in Trump's cabinet, as the only remaining major candidates.", "masks": ["Desantis"]}
{"masked_text": "Some existing third parties, such as the American Solidarity Party, the Prohibition Party, the Constitution Party, the Libertarian Party and the Party for Socialism and Liberation, and the [MASK0] Party have announced presidential nominees.", "masks": ["Green"]}
{"masked_text": "Cornel West, academic, left-leaning and anti-war activist and public intellectual, previously both, People's Party and [MASK0] Party primaries candidate launching an independent campaign", "masks": ["Green"]}
{"masked_text": "On August 15, 2024, vice presidential candidates JD Vance and [MASK0] agreed to a debate hosted on CBS News on October 1, though Vance indicated he would only attend under certain conditions.", "masks": ["Walz"]}
{"masked_text": "In particular, Vance added that he would like to debate [MASK0] at least once.", "masks": ["Walz"]}
