{"masked_text": "In November 2022, former President Donald Trump announced his candidacy in the 2024 presidential election. Other candidates who have entered the 2024 Republican Party presidential primaries include former South Carolina governor and former U.S. Ambassador to the U.N. Nikki Haley and current Florida governor [MASK0], who have since suspended their campaigns. The first Republican presidential debate was held on August 23, 2023, and the first primary contest was the 2024 Iowa Republican presidential caucuses, which was held on January 15, 2024. Trump would win the nomination easily; he was formally nominated at the Republican Convention on July 15, his third consecutive presidential nomination.", "masks": ["Desantis"]}
{"masked_text": "Nebraska Class 2: Republican Ben Sasse resigned his seat on January 8, 2023, to become President of the University of Florida. Pete Ricketts was appointed by Nebraska governor [MASK0] to fill the seat until the special election, which will take place concurrently with the regularly-scheduled 2024 Senate elections.", "masks": ["Pillen"]}
{"masked_text": "California Class 1: Democrat Dianne Feinstein died on September 29, 2023. Laphonza Butler was appointed by California governor [MASK0] to fill the seat until the special election, which will take place concurrently with the regular election for a six-year term.", "masks": ["Newsom"]}
{"masked_text": "Texas's 18th congressional district: Democrat Sheila Jackson [MASK0] died on July 19, 2024. The district has a partisan index of D+23.", "masks": ["Lee"]}
{"masked_text": "Baltimore, Maryland: One-term incumbent Brandon [MASK0] was renominated for re-election. He will face Shannon Wright in the general election.", "masks": ["Scott"]}
{"masked_text": "Wilmington, Delaware: Two-term incumbent Mike Purzycki is retiring. [MASK0] is currently unopposed for the general election.", "masks": ["Carney"]}
{"masked_text": "In March, the Apache Tribe of Oklahoma reelected Durell [MASK0] III as tribal chairman and Matthew Tselee as vice-chairman. Dustin Cozad was elected Apache Treasurer and Donald Komardley and Amber Achilta were elected to the tribe's business committee. The Peoria Tribe of Oklahoma elected Jason Dollarhide as treasurer, Carolyn Ritchey to the business committee, and Stacy Lindsly to the grievance committee.", "masks": ["Cooper"]}
{"masked_text": "In May, Forrest Tahdooahnippah was elected as chair of the Comanche Nation, replacing Mark Woommavovah who declined to run for reelection after being censured for his approval of a refinery project on tribal land; Diana Doyebi-Sovo was elected vice-chair. The Ottawa Tribe of Oklahoma elected Mikal [MASK0]-Werner second chief, Kallista Keah as secretary-treasurer, Cody Hollenbeck first councilman, and Rachel Marie Yeakley to the tribe's grievance committee. The Wasco, part of the Confederated Tribes of Warm Springs, elected Jefferson Greene chief in a special election. Michael Q. Primus II, Ben Lucero Wolf, Tiya “Tanequodle” Rosario, and Warren Quetone were elected to the Kiowa Tribe's legislature. The Shoshone-Bannock Tribes in Idaho elected [MASK1] Juan Tyler as chair of the Fort Hall Business Council.", "masks": ["Scott", "Lee"]}
{"masked_text": "In July, the Chickasaw Nation reelected David Woerz, Toby Perkins, Nancy Elliott, Shana Tate Darter, and [MASK0] Wood to the tribe's legislature and Linda English Weeks to the tribe's supreme court. Matthew Wesaw was reelected to a fourth term as chair of the Pokagon Band of Potawatomi Indians tribal council.", "masks": ["Scott"]}
