{"masked_text": "Democrats outperformed [MASK0]'s results in the 2020 U.S. presidential election in several 2022 House special elections, with abortion cited as a major contributor to their victories.", "masks": ["Biden"]}
{"masked_text": "Some issue polling has shown [MASK0], the 2024 Presidential Republican nominee, outrunning his party and closing the gap with Democrats on the issue of abortion, but no election data with [MASK0] directly on the ballot has happened to verify these results.", "masks": ["Trump"]}
{"masked_text": "On November 18, 2022, three days after former president and Republican candidate [MASK0] announced his 2024 re-election bid, U.S. Attorney General Merrick Garland appointed Jack Smith as special counsel to investigate [MASK0]'s role in the January 6 U.S. Capitol attack and [MASK0]'s mishandling of government documents, including classified documents.", "masks": ["Trump"]}
{"masked_text": "On March 30, 2023, [MASK0] was indicted by a grand jury in Manhattan for his alleged role in a scandal stemming from hush money payments made to Stormy Daniels before the 2016 presidential election.", "masks": ["Trump"]}
{"masked_text": "On June 8, 2023, [MASK0] was indicted on 37 federal charges related to his alleged mishandling of classified documents by the office of the Smith special counsel investigation.", "masks": ["Trump"]}
{"masked_text": "On August 1, 2023, a Washington, D.C., federal grand jury indicted [MASK0] again on four felony counts of conspiracy and obstruction related to [MASK0]'s role in the January 6 attack and his efforts to overturn the 2020 election.", "masks": ["Trump"]}
{"masked_text": "On August 14, a Georgia grand jury indicted [MASK0] on racketeering and other felonies committed in an effort to overturn the state's 2020 election results and the [MASK0]–Raffensperger phone call.", "masks": ["Trump"]}
{"masked_text": "As of September 15, 2023, [MASK0] has pleaded not guilty to all the charges.", "masks": ["Trump"]}
{"masked_text": "On August 11, four months after incumbent president and Democratic candidate [MASK0] announced his re-election bid, Garland appointed David C. Weiss to serve as special counsel to investigate [MASK0]'s son, Hunter [MASK0], who was indicted on September 14, 2023, on three federal firearms-related charges.", "masks": ["Biden"]}
{"masked_text": "On December 19, 2023, the Colorado Supreme Court removed [MASK0] from the state's 2024 Republican primary, citing the Fourteenth Amendment's ban on candidates who engage in insurrections.", "masks": ["Trump"]}
{"masked_text": "[MASK0] initially ran for a second term and won the primaries, with Vice President Harris once again serving as his running mate; [MASK0] later withdrew his candidacy on July 21, 2024.", "masks": ["Biden"]}
{"masked_text": "President Biden initially ran for a second term and won the primaries, with [MASK0] once again serving as his running mate; Biden later withdrew his candidacy on July 21, 2024.", "masks": ["Harris"]}
{"masked_text": "After a survey by the Associated Press of Democratic delegates on July 22, 2024, [MASK0] became the new presumptive candidate for the Democratic party, a day after declaring her candidacy.", "masks": ["Harris"]}
{"masked_text": "In November 2022, former [MASK0] announced his candidacy in the 2024 presidential election.", "masks": ["Trump"]}
{"masked_text": "[MASK0] would win the nomination easily; he was formally nominated at the Republican Convention on July 15, his third consecutive presidential nomination.", "masks": ["Trump"]}
{"masked_text": "On August 23, 2024, Kennedy announced he was suspending his campaign and backing [MASK0].", "masks": ["Trump"]}
{"masked_text": "In July, intermediaries between [MASK0] and Kennedy discussed a possible role for Kennedy in the [MASK0] administration in return for his endorsement; a month later, Kennedy made similar overtures to the Harris campaign, but was rebuffed.", "masks": ["Trump"]}
{"masked_text": "In July, intermediaries between Trump and Kennedy discussed a possible role for Kennedy in the Trump administration in return for his endorsement; a month later, Kennedy made similar overtures to the [MASK0] campaign, but was rebuffed.", "masks": ["Harris"]}
{"masked_text": "Three Democratic-held seats up for election are in the heavily Republican-leaning states of Montana, Ohio, and West Virginia, all of which were won comfortably by [MASK0] in both 2016 and 2020.", "masks": ["Trump"]}
{"masked_text": "On July 13, 2024, during a campaign rally in Butler, Pennsylvania, presidential candidate [MASK0] was shot at in a failed assassination attempt.", "masks": ["Trump"]}
{"masked_text": "The gunfire caused minor damage to [MASK0]'s upper right ear, while one spectator was killed and two others were critically injured.", "masks": ["Trump"]}
