{"masked_text": "Biden's withdrawal makes him the first eligible incumbent president since Lyndon B. [MASK0] in 1968 not to run for re-election, and the first to withdraw after securing enough delegates to win the nomination.", "masks": ["Johnson"]}
{"masked_text": "Trump was nominated during the 2024 Republican National Convention along with his running mate, Ohio senator [MASK0].", "masks": ["Vance"]}
{"masked_text": "On July 13, 2024, Trump survived an assassination attempt while addressing a campaign rally near [MASK0], Pennsylvania.", "masks": ["Butler"]}
{"masked_text": "Trump was shot and wounded on his right ear by Thomas Matthew Crooks, a 20-year-old man from Bethel Park, Pennsylvania, who fired eight [MASK0] with an AR-15–style rifle from the roof of a building located approximately 400 feet (120 meters) from the stage; the shots killed audience member Corey Comperatore and critically injured two other audience members.", "masks": ["Rounds"]}
{"masked_text": "In April 2023, Robert F. [MASK0] Jr. also entered the race but later shifted his campaign to an independent run on October 9, 2023.", "masks": ["Kennedy"]}
{"masked_text": "Jason Palmer, who surprised many by winning the American Samoa caucuses, became the first candidate to win a contested primary against an incumbent president since Ted [MASK0] in 1980.", "masks": ["Kennedy"]}
{"masked_text": "Following Biden's withdrawal, Tim Walz, Josh Shapiro, [MASK0], and Andy Beshear emerged as lead candidates in the veepstakes.", "masks": ["Kelly"]}
{"masked_text": "Shapiro received pushback from pro-Palestine activists for comments on college protesters and for claiming to volunteer for the IDF, while [MASK0] was criticized by \"labor groups.\"", "masks": ["Kelly"]}
{"masked_text": "On July 15, 2024, the first day of the Republican National Convention, Trump officially announced that Senator [MASK0] of Ohio would be his running mate.", "masks": ["Vance"]}
{"masked_text": "Third-party and independent candidates have also announced presidential runs, including Cornel West and Robert F. [MASK0] Jr.", "masks": ["Kennedy"]}
{"masked_text": "[MASK0] dropped out of the race in August 2024, though he remains on the ballot in some states.", "masks": ["Kennedy"]}
{"masked_text": "Party for Socialism and Liberation: Claudia De la [MASK0], political activist", "masks": ["Cruz"]}
{"masked_text": "Robert F. [MASK0] Jr., environmental lawyer, anti-vaccine activist and conspiracy theorist, previously Democratic primaries candidate launching an independent campaign (endorsed Trump)", "masks": ["Kennedy"]}
{"masked_text": "On August 15, 2024, vice presidential candidates [MASK0] and Tim Walz agreed to a debate hosted on CBS News on October 1, though [MASK0] indicated he would only attend under certain conditions.", "masks": ["Vance"]}
{"masked_text": "[MASK0] said he couldn't participate in a fake debate where he couldn't exchange good ideas about policy.", "masks": ["Vance"]}
{"masked_text": "In particular, [MASK0] added that he would like to debate Walz at least once.", "masks": ["Vance"]}
