{"masked_text": "The presidential election will take place at the same time as elections for the U.S. Senate, House, gubernatorial, and state legislatures. Key swing states for the presidential election include Arizona, [MASK0], Michigan, Nevada, North Carolina, Pennsylvania, and Wisconsin. Leading campaign issues are abortion, border security and immigration, climate change, democracy, the economy, education, foreign policy, healthcare, and LGBT rights. The winners are scheduled to be inaugurated on January 20, 2025, as the 47th president and 50th vice president of the United States.", "masks": ["Georgia"]}
{"masked_text": "Trump is the first president in American history to be impeached twice, and the first to run again after impeachment. Trump was first impeached by the Democratic-controlled House of Representatives in December 2019 for abuse of power and obstruction of Congress due to his attempts to coerce [MASK0] to provide damaging information on Joe Biden and misinformation regarding Russian interference in the 2016 United States elections by withholding military aid. Trump's second impeachment by the House occurred on January 13, 2021, for \"incitement of insurrection\" owing to his role in the January 6 United States Capitol attack. As Trump was acquitted by the Senate in both cases, Trump is not barred from seeking reelection to the presidency in 2024.", "masks": ["Ukraine"]}
{"masked_text": "Before the election, current and former U.S. officials stated that foreign interference in the 2024 election was likely. Three major factors cited were \"America's deepening domestic political crises, the collapse of controversial attempts to control political speech on social media, and the rise of generative AI.\" [MASK0], Russia, and Iran have since all been identified as mounting influence operations and attempts to interfere with the 2024 election. US intelligence officials have described the efforts as part of broader efforts by authoritarian nations to use the internet to erode support for democracy.", "masks": ["China"]}
{"masked_text": "Before the election, current and former U.S. officials stated that foreign interference in the 2024 election was likely. Three major factors cited were \"America's deepening domestic political crises, the collapse of controversial attempts to control political speech on social media, and the rise of generative AI.\" China, [MASK0], and Iran have since all been identified as mounting influence operations and attempts to interfere with the 2024 election. US intelligence officials have described the efforts as part of broader efforts by authoritarian nations to use the internet to erode support for democracy.", "masks": ["Russia"]}
{"masked_text": "Before the election, current and former U.S. officials stated that foreign interference in the 2024 election was likely. Three major factors cited were \"America's deepening domestic political crises, the collapse of controversial attempts to control political speech on social media, and the rise of generative AI.\" China, Russia, and [MASK0] have since all been identified as mounting influence operations and attempts to interfere with the 2024 election. US intelligence officials have described the efforts as part of broader efforts by authoritarian nations to use the internet to erode support for democracy.", "masks": ["Iran"]}
{"masked_text": "[MASK0] has been identified as interfering with the 2024 election through propaganda and disinformation campaigns linked to its Spamouflage operation. US intelligence agencies described the effort as not targeting any particular candidate, but focusing on issues important to Beijing such as Taiwan, and \"undermining confidence in elections, voting, and the U.S. in general.\" As early as April 1, 2024, The New York Times reported that the Chinese government had created fake pro-Trump accounts on social media \"promoting conspiracy theories, stoking domestic divisions and attacking President Biden ahead of the election in November.\"", "masks": ["China"]}
{"masked_text": "According to disinformation experts and intelligence agencies, [MASK0] spread disinformation ahead of the 2024 election to damage Joe Biden and Democrats, boost candidates supporting isolationism, and undercut support for Ukraine aid and NATO. On September 4, 2024, the United States publicly accused [MASK0] of interfering in the 2024 election and announced several steps to combat Russian influence including sanctions, indictments, and seizing of web domains used to spread propaganda and disinformation. American intelligence agencies have assessed that [MASK0] prefers Trump to win the election, viewing him as more critical of U.S. support for Ukraine.", "masks": ["Russia"]}
{"masked_text": "According to disinformation experts and intelligence agencies, Russia spread disinformation ahead of the 2024 election to damage Joe Biden and Democrats, boost candidates supporting isolationism, and undercut support for [MASK0] aid and NATO. On September 4, 2024, the United States publicly accused Russia of interfering in the 2024 election and announced several steps to combat Russian influence including sanctions, indictments, and seizing of web domains used to spread propaganda and disinformation. American intelligence agencies have assessed that Russia prefers Trump to win the election, viewing him as more critical of U.S. support for [MASK0].", "masks": ["Ukraine"]}
{"masked_text": "[MASK0] has been identified as interfering with the 2024 presidential election through front companies connected to the Islamic Revolutionary Guard Corps through hacking attempts against the Trump, Biden, and Harris campaigns starting as early as May 2024. [MASK0] has launched propaganda and disinformation campaigns through fake news websites and accounts on social media to tip the election against former president Trump, although it has also targeted both Biden and Harris. The New York Times stated the efforts were an attempt at \"sowing internal discord and discrediting the democratic system in the United States more broadly in the eyes of the world.\"", "masks": ["Iran"]}
{"masked_text": "Trump faces an additional 57 felony counts; four counts in a [MASK0] v. Donald J. Trump for his alleged role in attempting to overturn the 2020 United States presidential election and involvement in the January 6 United States Capitol attack; 10 counts in The State of Georgia v. Donald J. Trump, et al. for his alleged attempts to overturn the results of the 2020 United States presidential election in Georgia; 40 counts in [MASK0] v. Donald J. Trump, Waltine Nauta, and Carlos De Oliveira relating to his hoarding of classified documents and alleged obstruction of efforts to retrieve them.", "masks": ["United_states_of_america"]}
{"masked_text": "Trump faces an additional 57 felony counts; four counts in a United_states_of_america v. Donald J. Trump for his alleged role in attempting to overturn the 2020 United States presidential election and involvement in the January 6 United States Capitol attack; 10 counts in The State of [MASK0] v. Donald J. Trump, et al. for his alleged attempts to overturn the results of the 2020 United States presidential election in [MASK0]; 40 counts in United_states_of_america v. Donald J. Trump, Waltine Nauta, and Carlos De Oliveira relating to his hoarding of classified documents and alleged obstruction of efforts to retrieve them.", "masks": ["Georgia"]}
{"masked_text": "According to an April 2024 Reuters/Ipsos poll, the percentage of registered voters who found Trump's charges somewhat to very serious in the federal elections case was 74%, 72% in the [MASK0] case, 69% in the classified documents case, and 64% in the New York hush money case. Nearly a quarter of Republican voters said they would not vote for Trump if found guilty of a felony by a jury. Following his hush money conviction, 15% of likely Republican voters and 49% of independents stated they wanted Trump to drop out, and 54% of registered voters approved of the jury's decision. Polling also found 56% of Republicans who were unchanged by the verdict, and 35% of Republicans and 18% of independents who stated they were more likely to vote for Trump.", "masks": ["Georgia"]}
{"masked_text": "Most states are not competitive because demographics keep them solidly behind a party. Because of the nature of the Electoral College, this means a limited number of swing states—competitive states that \"swing\" between the parties—are vital to winning the presidency. These are the Rust Belt states of Wisconsin, Michigan, and Pennsylvania; and the Sun Belt states of Arizona, [MASK0], Nevada, and North Carolina.", "masks": ["Georgia"]}
{"masked_text": "Due to gradual demographic shifts, some former swing states such as Iowa, Ohio, and Florida have shifted significantly towards the Republicans, while Colorado, New [MASK0], and Oregon have moved towards the Democrats. The Democratic electoral coalition, securing the \"blue states\" for Democratic presidential candidates, has had relatively high support among Black voters; voters who have attended college or who live in urban areas. Some working class voters since the 1970s, have drifted towards Republican candidates as  Democrats moved to the left on cultural issues. The traditional Republican coalition in \"red states\" is composed mainly of rural White voters, evangelicals, the elderly, and non-college educated voters. Republicans had performed well with suburban, middle class voters since the 1950s, but this bloc has drifted away from them recently because of the rise of the Make America Great Again movement. The acceleration of this trend has been credited with tipping the 2020 presidential election in favor of Democrat Joe Biden, because the incumbent Trump was historically unpopular in the suburbs for a Republican candidate, underperforming there.", "masks": ["Mexico"]}
{"masked_text": "Border security and immigration are among the top issues concerning potential voters in the election. Polling has shown that most Americans want to reduce immigration and that a substantial minority of white Republicans are concerned about white demographic decline. In 2023 and early 2024, a surge of migrants entering through the border with [MASK0] occurred. By June 2024, illegal crossings reached a three-year low following four consecutive monthly drops, which senior officials attributed to increased enforcement between the US and [MASK0], the weather, and Biden's executive order increasing asylum restrictions. By July 2024, border arrests dropped 33% to a 46-month low as a result of Biden's executive action after it previously dropped by 55% in June, bringing it to its lowest level since September 2020.", "masks": ["Mexico"]}
{"masked_text": "Climate change is expected to be an issue in the 2024 presidential election. In 2023, the United States saw a record in crude oil production with over 13.2 million barrels of crude per day beating the 13 million barrels per day produced at the peak of Trump's presidency. America also dealt with supply shocks caused by the 2021–2024 global energy crisis due to the COVID-19 pandemic and Russian invasion of [MASK0].", "masks": ["Ukraine"]}
{"masked_text": "The Russian invasion of [MASK0] and Israel–Hamas war are expected issues in the election. Harris has signaled to generally follow Biden's foreign policy on NATO and [MASK0], supporting both in the aftermath of the Russian invasion. A supporter of the two-state solution, Harris is seen as more sympathetic to Palestinians than Biden, who has described himself as a Zionist and has a long history with Israeli leaders. Regarding the Israel–Hamas war, analysts expect Harris to continue Biden's approach. Following Hamas's attack on Israel in 2023, Harris strongly supported Israel's offensive, stating that \"the threat Hamas poses to the people of Israel must be eliminated\". However, she has since criticized Israel's approach and the Gaza humanitarian crisis. In March 2024, Harris opposed Israel's invasion of Rafah, called for an immediate ceasefire in Gaza, and stated that the situation in Gaza is a \"humanitarian catastrophe\". Harris has advocated for \"de-risking\" from Beijing, a policy that encourages reducing Western economic dependence on China. Harris is expected to continue deepening American alliances in Asia and the Pacific with the intention of curbing China's rising power both economically and militarily.", "masks": ["Ukraine"]}
{"masked_text": "The Russian invasion of Ukraine and [MASK0]–Hamas war are expected issues in the election. Harris has signaled to generally follow Biden's foreign policy on NATO and Ukraine, supporting both in the aftermath of the Russian invasion. A supporter of the two-state solution, Harris is seen as more sympathetic to Palestinians than Biden, who has described himself as a Zionist and has a long history with Israeli leaders. Regarding the [MASK0]–Hamas war, analysts expect Harris to continue Biden's approach. Following Hamas's attack on [MASK0] in 2023, Harris strongly supported [MASK0]'s offensive, stating that \"the threat Hamas poses to the people of [MASK0] must be eliminated\". However, she has since criticized [MASK0]'s approach and the Gaza humanitarian crisis. In March 2024, Harris opposed [MASK0]'s invasion of Rafah, called for an immediate ceasefire in Gaza, and stated that the situation in Gaza is a \"humanitarian catastrophe\". Harris has advocated for \"de-risking\" from Beijing, a policy that encourages reducing Western economic dependence on China. Harris is expected to continue deepening American alliances in Asia and the Pacific with the intention of curbing China's rising power both economically and militarily.", "masks": ["Israel"]}
{"masked_text": "The Russian invasion of Ukraine and Israel–Hamas war are expected issues in the election. Harris has signaled to generally follow Biden's foreign policy on NATO and Ukraine, supporting both in the aftermath of the Russian invasion. A supporter of the two-state solution, Harris is seen as more sympathetic to Palestinians than Biden, who has described himself as a Zionist and has a long history with Israeli leaders. Regarding the Israel–Hamas war, analysts expect Harris to continue Biden's approach. Following Hamas's attack on Israel in 2023, Harris strongly supported Israel's offensive, stating that \"the threat Hamas poses to the people of Israel must be eliminated\". However, she has since criticized Israel's approach and the Gaza humanitarian crisis. In March 2024, Harris opposed Israel's invasion of Rafah, called for an immediate ceasefire in Gaza, and stated that the situation in Gaza is a \"humanitarian catastrophe\". Harris has advocated for \"de-risking\" from Beijing, a policy that encourages reducing Western economic dependence on [MASK0]. Harris is expected to continue deepening American alliances in Asia and the Pacific with the intention of curbing [MASK0]'s rising power both economically and militarily.", "masks": ["China"]}
{"masked_text": "Trump's 2024 campaign has reiterated its isolationist \"America First\" foreign policy agenda, and has promised to \"fundamentally reevaluate\" NATO's purpose and mission, shifting the nation's defense burdens from Europe towards Asia. Trump has stated he would encourage [MASK0] to \"do whatever the hell they want\" to countries that did not contribute enough to NATO. Trump has said he would cut off aid to Ukraine quickly if reelected. Trump previously stated he would potentially recognize [MASK0]'s illegal annexation of Crimea, and made suggestions that he could have prevented the war by ceding parts of eastern Ukraine to [MASK0]. Trump has voiced strong support for Israel in the Israel–Hamas war, and has stated that they must \"finish the problem\". Trump has promised a tougher stance against China than Biden, but has also questioned whether America should defend Taiwan. Trump has suggested withdrawing troops from South_korea if it does not pay more to support U.S. troops there.", "masks": ["Russia"]}
{"masked_text": "Trump's 2024 campaign has reiterated its isolationist \"America First\" foreign policy agenda, and has promised to \"fundamentally reevaluate\" NATO's purpose and mission, shifting the nation's defense burdens from Europe towards Asia. Trump has stated he would encourage Russia to \"do whatever the hell they want\" to countries that did not contribute enough to NATO. Trump has said he would cut off aid to [MASK0] quickly if reelected. Trump previously stated he would potentially recognize Russia's illegal annexation of Crimea, and made suggestions that he could have prevented the war by ceding parts of eastern [MASK0] to Russia. Trump has voiced strong support for Israel in the Israel–Hamas war, and has stated that they must \"finish the problem\". Trump has promised a tougher stance against China than Biden, but has also questioned whether America should defend Taiwan. Trump has suggested withdrawing troops from South_korea if it does not pay more to support U.S. troops there.", "masks": ["Ukraine"]}
{"masked_text": "Trump's 2024 campaign has reiterated its isolationist \"America First\" foreign policy agenda, and has promised to \"fundamentally reevaluate\" NATO's purpose and mission, shifting the nation's defense burdens from Europe towards Asia. Trump has stated he would encourage Russia to \"do whatever the hell they want\" to countries that did not contribute enough to NATO. Trump has said he would cut off aid to Ukraine quickly if reelected. Trump previously stated he would potentially recognize Russia's illegal annexation of Crimea, and made suggestions that he could have prevented the war by ceding parts of eastern Ukraine to Russia. Trump has voiced strong support for [MASK0] in the [MASK0]–Hamas war, and has stated that they must \"finish the problem\". Trump has promised a tougher stance against China than Biden, but has also questioned whether America should defend Taiwan. Trump has suggested withdrawing troops from South_korea if it does not pay more to support U.S. troops there.", "masks": ["Israel"]}
{"masked_text": "Trump's 2024 campaign has reiterated its isolationist \"America First\" foreign policy agenda, and has promised to \"fundamentally reevaluate\" NATO's purpose and mission, shifting the nation's defense burdens from Europe towards Asia. Trump has stated he would encourage Russia to \"do whatever the hell they want\" to countries that did not contribute enough to NATO. Trump has said he would cut off aid to Ukraine quickly if reelected. Trump previously stated he would potentially recognize Russia's illegal annexation of Crimea, and made suggestions that he could have prevented the war by ceding parts of eastern Ukraine to Russia. Trump has voiced strong support for Israel in the Israel–Hamas war, and has stated that they must \"finish the problem\". Trump has promised a tougher stance against [MASK0] than Biden, but has also questioned whether America should defend Taiwan. Trump has suggested withdrawing troops from South_korea if it does not pay more to support U.S. troops there.", "masks": ["China"]}
{"masked_text": "Trump's 2024 campaign has reiterated its isolationist \"America First\" foreign policy agenda, and has promised to \"fundamentally reevaluate\" NATO's purpose and mission, shifting the nation's defense burdens from Europe towards Asia. Trump has stated he would encourage Russia to \"do whatever the hell they want\" to countries that did not contribute enough to NATO. Trump has said he would cut off aid to Ukraine quickly if reelected. Trump previously stated he would potentially recognize Russia's illegal annexation of Crimea, and made suggestions that he could have prevented the war by ceding parts of eastern Ukraine to Russia. Trump has voiced strong support for Israel in the Israel–Hamas war, and has stated that they must \"finish the problem\". Trump has promised a tougher stance against China than Biden, but has also questioned whether America should defend Taiwan. Trump has suggested withdrawing troops from [MASK0] if it does not pay more to support U.S. troops there.", "masks": ["South_korea"]}
{"masked_text": "Trump has previously promised he would bar Gaza residents from entering the United States through an extended travel ban. Trump has stated he would shut down pro-Palestinian protests, deport demonstrators, and \"set the movement back 25 or 30 years\". At times, however, he has also been critical of [MASK0]'s war in Gaza. In April 2024, Trump said [MASK0] should \"get it over with ... get back to peace and stop killing people.\" In July 2024, Trump said that [MASK0] should end the war in Gaza as soon as possible.", "masks": ["Israel"]}
{"masked_text": "Polling has indicated that the majority of voters support a ceasefire and American mediation in the [MASK0]-Hamas war.  Republicans also generally support arms to [MASK0], while Democrats are divided on the issue. In the Democratic primaries, the Uncommitted National Movement led a protest campaign against Biden over the war, calling for a ceasefire and arms embargo on [MASK0]. It received over 700,000 votes and 36 delegates.", "masks": ["Israel"]}
{"masked_text": "Harris has been seen as more sympathetic to Palestinians during the war, and her and her campaign have interacted with Arab-American and Uncommitted leaders on multiple occasions. However, Harris has refused to halt  any weapons shipments to [MASK0] or shift policy from Biden, saying [MASK0] has a right to defend itself. Trump also supports [MASK0]'s campaign and has said it \"has to have a victory\", though has said it needs to \"get it over with\". Trump has taken a more hardline stance on pro-Palestinian protests on university campuses, pledging to deport non-citizen protestors and \"set that movement back 25 or 30 years\".", "masks": ["Israel"]}
{"masked_text": "Jason Palmer, who surprised many by winning the American [MASK0] caucuses, became the first candidate to win a contested primary against an incumbent president since Ted Kennedy in 1980. However, he suspended his campaign on May 15, 2024. On March 12, 2024, Biden secured a majority of delegates, becoming the presumptive Democratic nominee.", "masks": ["Samoa"]}
{"masked_text": "On July 15, 2024, the first day of the Republican National Convention, Trump officially announced that Senator JD Vance of Ohio would be his running mate. If elected, he would be the first marine and first [MASK0] War veteran to serve as vice president.", "masks": ["Iraq"]}
{"masked_text": "Chase Oliver was chosen by the Libertarian Party as its presidential nominee on May 26, 2024, at the 2024 Libertarian National Convention. Oliver was the party's candidate in the 2022 United States Senate election in [MASK0]. As of May 2024, the party has ballot access in at least 37 states with a total of 380 electoral votes.", "masks": ["Georgia"]}
