{"masked_text": "The incumbent president, Joe Biden, a member of the Democratic Party, initially ran for re-election and became the party's presumptive nominee, facing little opposition. However, Biden's performance in the June 2024 presidential debate intensified concerns about his age and health, and led to calls within his party for him to leave the race. Although initially adamant that he would remain in the race, Biden ultimately withdrew on July 21 and endorsed Vice President Kamala Harris, who became the party's nominee on August 5. Harris selected Tim Walz, the governor of Minnesota, as her running mate. Biden's withdrawal makes him the first eligible incumbent president since Lyndon B. [MASK0] in 1968 not to run for re-election, and the first to withdraw after securing enough delegates to win the nomination. Harris is the first nominee who did not participate in the primaries since Hubert Humphrey, also in 1968.", "masks": ["Johnson"]}
{"masked_text": "Biden's predecessor, Donald Trump, a member of the Republican Party, is running for re-election for a second, non-consecutive term, after losing to Biden in 2020. Although more than a dozen candidates sought the nomination, only Trump and four others made it to the primaries. Other than Trump, only Nikki Haley managed to gather any significant support during the Republican primaries. Trump was nominated during the 2024 Republican National Convention along with his running mate, Ohio senator [MASK0]. Trump's campaign has been criticized by legal experts, historians, and political scientists for invoking violent rhetoric and authoritarian statements. Trump has made large numbers of false and misleading statements, promoted conspiracy theories, and has continued to repeat false claims that the 2020 election was rigged and stolen from him, which prompted the January 6 Capitol attack. The Republican Party has made efforts to disrupt the 2024 presidential election as part of a larger election denial movement.  In 2023 and 2024, Trump was found liable and guilty in civil and criminal proceedings, respectively, for sexual abuse, defamation, financial fraud, and falsifying business records, becoming the first former president to be convicted of a crime.", "masks": ["Vance"]}
{"masked_text": "On July 13, 2024, Trump survived an assassination attempt while addressing a campaign rally near [MASK0], Pennsylvania. Trump was shot and wounded on his right ear by Thomas Matthew Crooks, a 20-year-old man from Bethel Park, Pennsylvania, who fired eight Rounds with an AR-15–style rifle from the roof of a building located approximately 400 feet (120 meters) from the stage; the shots killed audience member Corey Comperatore and critically injured two other audience members. Seconds later Crooks was shot and killed by the U.S. Secret Service's counter-sniper team. The motive and cause of the assassination attempt are still under investigation by authorities.", "masks": ["Butler"]}
{"masked_text": "On July 13, 2024, Trump survived an assassination attempt while addressing a campaign rally near Butler, Pennsylvania. Trump was shot and wounded on his right ear by Thomas Matthew Crooks, a 20-year-old man from Bethel Park, Pennsylvania, who fired eight [MASK0] with an AR-15–style rifle from the roof of a building located approximately 400 feet (120 meters) from the stage; the shots killed audience member Corey Comperatore and critically injured two other audience members. Seconds later Crooks was shot and killed by the U.S. Secret Service's counter-sniper team. The motive and cause of the assassination attempt are still under investigation by authorities.", "masks": ["Rounds"]}
{"masked_text": "Author Marianne Williamson was the first to challenge Biden by announcing her candidacy in February 2023. In April 2023, Robert F. [MASK0] Jr. also entered the race but later shifted his campaign to an independent run on October 9, 2023. Representative Dean Phillips joined the race on October 26, 2023. Williamson initially withdrew from the race in February 2024 but later resumed her campaign, only to end it again on June 11, 2024.", "masks": ["Kennedy"]}
{"masked_text": "Jason Palmer, who surprised many by winning the American Samoa caucuses, became the first candidate to win a contested primary against an incumbent president since Ted [MASK0] in 1980. However, he suspended his campaign on May 15, 2024. On March 12, 2024, Biden secured a majority of delegates, becoming the presumptive Democratic nominee.", "masks": ["Kennedy"]}
{"masked_text": "Following Biden's withdrawal, Tim Walz, Josh Shapiro, [MASK0], and Andy Beshear emerged as lead candidates in the veepstakes. Shapiro received pushback from pro-Palestine activists for comments on college protesters and for claiming to volunteer for the IDF, while [MASK0] was criticized by \"labor groups.\"", "masks": ["Kelly"]}
{"masked_text": "On July 15, 2024, the first day of the Republican National Convention, Trump officially announced that [MASK0] of Ohio would be his running mate. If elected, he would be the first marine and first Iraq War veteran to serve as vice president.", "masks": ["Vance"]}
{"masked_text": "Third-party and independent candidates have also announced presidential runs, including Cornel West and Robert F. [MASK0] Jr.", "masks": ["Kennedy"]}
{"masked_text": "[MASK0] dropped out of the race in August 2024, though he remains on the ballot in some states. Centrist political organization No Labels abandoned its efforts in April 2024. Some existing third parties, such as the American Solidarity Party, the Prohibition Party, the Constitution Party, the Libertarian Party and the Party for Socialism and Liberation, and the Green Party have announced presidential nominees.", "masks": ["Kennedy"]}
{"masked_text": "Party for Socialism and Liberation: Claudia De la [MASK0], political activist", "masks": ["Cruz"]}
{"masked_text": "Robert F. [MASK0] Jr., environmental lawyer, anti-vaccine activist and conspiracy theorist, previously Democratic primaries candidate launching an independent campaign (endorsed Trump)", "masks": ["Kennedy"]}
{"masked_text": "On August 15, 2024, vice presidential candidates [MASK0] and Tim Walz agreed to a debate hosted on CBS News on October 1, though [MASK0] indicated he would only attend under certain conditions. [MASK0] said he couldn't participate in a fake debate where he couldn't exchange good ideas about policy. In particular, [MASK0] added that he would like to debate Walz at least once.", "masks": ["Vance"]}
